{
  "lastUpdated": "2026-02-20T07:16:15.486Z",
  "count": 5,
  "articles": [
    {
      "id": "ps-1771571736664-zhc4oy",
      "headline": "Bitcoin Mining Difficulty Surges 15%, Largest Jump in Over Four Years",
      "subheadline": "Network difficulty hits 144.4 trillion as hashrate recovers to 1 ZH/s, even as miners face multi-year low revenues",
      "body": "Bitcoin's mining difficulty has spiked 15% in a single adjustment — the largest increase since 2021 — rising to 144.4 trillion as the network's total hashrate recovered to approximately 1 zettahash per second. The sharp recalibration signals a rapid return of mining power to the network after a recent dip.\n\nThe surge is particularly notable given the challenging economics facing miners. Hashprice, the standard measure of mining revenue per unit of computational power, sits near multi-year lows amid a broader slump in Bitcoin's market price. The divergence suggests that large-scale mining operations are continuing to expand capacity and deploy next-generation hardware regardless of short-term price conditions, a pattern consistent with miners positioning for long-term profitability rather than reacting to current market signals.\n\nBitcoin's difficulty adjustment mechanism, which recalibrates roughly every two weeks to maintain a consistent ten-minute block interval, serves as one of the most reliable indicators of miner commitment to the network. A 15% jump of this magnitude implies that substantial hashrate came online in a compressed timeframe, likely driven by the activation of new mining facilities or the re-energizing of previously idled machines. The 1 ZH/s hashrate milestone underscores the continued industrial scaling of Bitcoin mining even under financial pressure.",
      "category": "markets",
      "breaking": false,
      "importance": 6,
      "imageUrl": "https://picsum.photos/seed/540/1200/630",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/bitcoin-difficulty-jumps-15-largest-increase-since-2021-despite-price-slump",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T07:15:36.664Z"
    },
    {
      "id": "ps-1771571746071-uns02e",
      "headline": "General Catalyst Pledges $5B to India, Quintupling Previous Commitment",
      "subheadline": "Venture giant dramatically escalates its India bet, up from an earlier $500M–$1B earmark over five years",
      "body": "General Catalyst has committed $5 billion to India over the next five years, a dramatic escalation that signals deepening confidence in the country's startup ecosystem from one of Silicon Valley's most influential venture firms.\n\nThe pledge represents at least a fivefold increase from the firm's earlier earmark of $500 million to $1 billion for Indian investments. The move positions General Catalyst among the largest foreign investors targeting India's technology sector, which has seen surging deal activity driven by a maturing founder class, expanding digital infrastructure, and a massive consumer market.\n\nThe commitment comes as global venture capital firms increasingly view India as a critical growth market, particularly as investment conditions in China remain uncertain due to regulatory and geopolitical headwinds. With a young, digitally native population exceeding 1.4 billion and government-backed initiatives accelerating tech adoption, India has become the focal point for international capital seeking outsized returns in emerging markets. General Catalyst's bet underscores a broader trend of institutional investors shifting significant resources eastward — and betting that India's next wave of technology companies will rival those built in the United States and China.",
      "category": "business",
      "breaking": false,
      "importance": 6,
      "imageUrl": "https://picsum.photos/seed/403/1200/630",
      "sourceUrl": "https://techcrunch.com/2026/02/19/general-catalyst-commits-5b-to-india-over-five-years/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-20T07:15:46.071Z"
    },
    {
      "id": "ps-1771571755611-dzpvyc",
      "headline": "Fostrom Launches IoT Cloud Platform to Simplify Device Fleet Management",
      "subheadline": "Born from the frustrations of running an automated vertical farm, the platform offers typed schemas, per-device mailboxes, and a novel DuckDB-based data layer.",
      "body": "Fostrom, a new IoT cloud platform built by former vertical farming founders Arjun and Sid, has launched in technical preview with the goal of eliminating the infrastructure burden that slows IoT developers down.\n\nThe platform offers device SDKs in Python, JavaScript, and Elixir, along with typed schemas, per-device mailboxes, programmable actions, and deployment across four global regions. Its technical architecture is notably unconventional: the team built a Go-to-Elixir bridge that executes JavaScript code in WebAssembly for server-side actions, implemented a custom DuckDB library for Elixir, and wrote a background device agent in Rust. The open-source device agent, called DeviceKit, is available on GitHub.\n\nPerhaps the most consequential design decision was the data layer. After years of experimenting with distributed databases and complex abstraction layers, the founders concluded that a traditional SQL approach was essential for the consistency and querying demands of fleet operations. They settled on a replicated, multi-tenant architecture built on DuckDB — the embeddable analytical database — which they say dramatically simplified the broader codebase while concentrating operational complexity in a manageable number of components. The platform is currently in technical preview, with a CLI tool and automatic device monitoring among the next planned features.",
      "category": "tech",
      "breaking": false,
      "importance": 4,
      "imageUrl": "https://picsum.photos/seed/349/1200/630",
      "sourceUrl": "https://fostrom.io/",
      "sourceName": "Hacker News",
      "publishedAt": "2026-02-20T07:15:55.611Z"
    },
    {
      "id": "ps-1771571766766-lc8klt",
      "headline": "Neo Launches Residency Program With $750K Investment on Uncapped SAFE",
      "subheadline": "Ali Partovi's accelerator bets on founder-friendly terms, offers college students $40K no-strings grants",
      "body": "Neo, the accelerator founded by tech investor Ali Partovi, is challenging the conventional startup accelerator model with a new Residency program that offers significantly more founder-friendly terms than its competitors.\n\nThe program will invest $750,000 in each participating startup through an uncapped SAFE — a structure that avoids setting a valuation cap, potentially giving founders far more favorable economics than the standard accelerator deal. For comparison, leading accelerators like Y Combinator typically take a fixed equity stake at a set valuation. Neo is also introducing a $40,000 grant for college students with no equity strings attached, signaling an aggressive push to capture talent earlier in the pipeline.\n\nThe move positions Neo as a direct competitor to established programs by appealing to founders who are increasingly wary of giving up significant equity at the earliest stages. Uncapped SAFEs defer valuation to a future funding round, meaning founders avoid locking in a potentially low price on their company before they have meaningful traction. Partovi, who co-founded iLike and Code.org and has invested in companies including Facebook and Dropbox, appears to be leveraging his network and reputation to attract top-tier founders who might otherwise bypass accelerators altogether.",
      "category": "business",
      "breaking": false,
      "importance": 5,
      "imageUrl": "https://picsum.photos/seed/435/1200/630",
      "sourceUrl": "https://techcrunch.com/2026/02/19/ali-partovis-neo-looks-to-upend-the-accelerator-model-with-low-dilution-terms/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-20T07:16:06.766Z"
    },
    {
      "id": "ps-1771571775486-qk4gmy",
      "headline": "Bitcoin Retreats Near $68,000 as U.S.-Iran Tensions Rattle Markets",
      "subheadline": "Gold surges as geopolitical risk drives investors toward safe havens; strategists warn of potential retest of 2024 lows",
      "body": "Bitcoin fell to near $68,000 as escalating tensions between the United States and Iran dampened risk appetite across global markets. Gold prices jumped as investors rotated into traditional safe-haven assets, reflecting deepening unease over the geopolitical landscape.\n\nU.S. equities struck a cautious tone alongside the cryptocurrency pullback, with market participants reassessing their exposure to risk assets. Some strategists are warning that the current downturn could deepen further, with a potential retest of 2024 lows before any sustained recovery takes hold.\n\nThe divergence between gold and bitcoin underscores a familiar pattern: when geopolitical crises intensify, institutional capital tends to favor established stores of value over digital alternatives. While bitcoin advocates have long positioned the asset as \"digital gold,\" its correlation with risk-on assets like equities continues to dominate during periods of acute market stress. Traders will be watching diplomatic developments closely for signals on whether the current risk-off sentiment represents a temporary shock or the beginning of a more prolonged repricing across asset classes.",
      "category": "markets",
      "breaking": false,
      "importance": 6,
      "imageUrl": "https://picsum.photos/seed/503/1200/630",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/bitcoin-nears-usd68-000-gold-jumps-as-us-iran-tensions-return",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T07:16:15.486Z"
    }
  ]
}