{
  "lastUpdated": "2026-02-21T11:03:16.758Z",
  "count": 50,
  "articles": [
    {
      "id": "ps-1771671722034-g8ne",
      "slug": "supreme-court-strikes-down-trump-tariffs-president-fires-bac",
      "headline": "Supreme Court Strikes Down Trump Tariffs; President Fires Back With New 10% Levy",
      "subheadline": "In a 6-3 ruling, justices found Trump overstepped his authority, but the president immediately invoked an alternative law to reimpose global duties",
      "body": "The U.S. Supreme Court ruled Friday that President Donald Trump exceeded his constitutional authority in imposing sweeping global tariffs under the International Emergency Economic Powers Act, delivering a landmark rebuke to the centerpiece of his trade agenda. Within hours, Trump signed a proclamation establishing a new 10% tariff on imports under a different and previously untapped statute, vowing to press forward despite the judicial defeat.\n\nThe 6-3 decision saw Chief Justice John Roberts, joined by the court's three liberal justices and two Trump appointees — Amy Coney Barrett and Neil Gorsuch — conclude that IEEPA, a 1977 law granting emergency economic powers, was never intended to authorize tariffs. \"Had Congress intended to convey the distinct and extraordinary power to impose tariffs, it would have done so expressly, as it consistently has in other tariff statutes,\" Roberts wrote. Justices Clarence Thomas, Brett Kavanaugh, and Samuel Alito dissented. Trump responded by calling the Republican-appointed justices who voted against him \"fools and lap dogs\" and \"very unpatriotic.\"\n\nThe ruling opens the door to potentially billions of dollars in refunds from at least $130 billion in tariffs already collected under IEEPA, though the path to recouping those funds remains murky. Hundreds of companies — including Costco, Alcoa, and Bumble Bee — have already filed lawsuits seeking refunds, but the majority opinion did not address the mechanics of repayment, leaving that question to the Court of International Trade. Trump indicated he would fight refund claims in court for years. Diane Swonk, chief economist at KPMG US, cautioned that litigation costs could make recovery difficult for smaller businesses.\n\nThe president moved swiftly to fill the gap, invoking Section 122 of the Trade Act — a never-before-used provision allowing tariffs of up to 15% for 150 days without congressional approval. The new 10% levy takes effect February 24 and includes exemptions for certain minerals, agricultural products, pharmaceuticals, some electronics, and vehicles, though the scope of those carve-outs remains vaguely defined. Canada and Mexico retain their exemption under the USMCA trade agreement. Countries that previously negotiated bilateral deals with Washington, including the United Kingdom, India, and the European Union, will now face the blanket 10% rate — though the administration expects them to honor concessions already made.\n\nWall Street greeted the ruling with cautious optimism, with the S&P 500 closing up roughly 0.7%. Small business owners who challenged the tariffs expressed relief, though analysts warned the trade landscape has grown more complex, not less. Geoffrey Gertz, senior fellow at the Center for a New American Security, said bluntly: \"Things have only gotten more complicated and more messy today.\" The administration is also expected to explore additional tariff authorities under Sections 232 and 301, which address national security and unfair trade practices — tools Trump has already used for levies on steel, aluminum, and automobiles that were unaffected by Friday's ruling.",
      "category": "breaking",
      "importance": 9,
      "tags": [
        "Supreme Court",
        "tariffs",
        "Trump",
        "trade policy",
        "IEEPA",
        "Section 122",
        "US economy"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/c962/live/48a8efe0-0eb0-11f1-801d-ed3cff6bf876.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/cn8146l0n55o?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-21T11:02:02.034Z"
    },
    {
      "id": "ps-1771671735109-1i8n",
      "slug": "bird-flu-outbreak-kills-over-1-100-geese-across-new-jersey",
      "headline": "Bird Flu Outbreak Kills Over 1,100 Geese Across New Jersey",
      "subheadline": "Mass die-off of Canada geese prompts lake closures and public health warnings as avian influenza spreads",
      "body": "A large-scale avian influenza outbreak in New Jersey has left at least 1,100 birds dead or severely ill, primarily Canada geese, according to state officials. The die-off, which began on Valentine's Day, has triggered the closure of at least one lake and prompted public health authorities to issue warnings about potential risks to humans and domestic animals.\n\nThe outbreak represents one of the more significant recent bird flu events on the U.S. East Coast, underscoring the persistent threat posed by highly pathogenic avian influenza (HPAI) strains that have circulated globally in recent years. Canada geese, which congregate in large flocks around lakes, parks, and suburban waterways throughout the Mid-Atlantic region, appear to be bearing the brunt of the current wave. State wildlife and health agencies are working to assess the scope of the outbreak and contain further spread.\n\nThe closure of affected lakes reflects growing concern not only about wildlife transmission but also about the potential for spillover into poultry operations and, in rarer cases, human populations. The U.S. Centers for Disease Control and Prevention has maintained that the general public risk from avian influenza remains low, but officials consistently advise against handling dead or visibly sick wild birds. Domestic poultry farmers in the region have been urged to tighten biosecurity protocols.\n\nAvian influenza has been a mounting concern worldwide since a wave of HPAI H5N1 infections began spreading aggressively through wild bird populations starting in 2021 and 2022, eventually jumping into mammals including dairy cattle in the United States. Each new outbreak in wild birds raises questions about mutation potential and the adequacy of surveillance systems designed to catch early signs of adaptation toward human transmissibility.\n\nNew Jersey officials have not yet confirmed the specific strain responsible for the current die-off, though testing is underway. Residents near affected areas have been advised to keep pets away from shorelines and to report sightings of dead or distressed waterfowl to state wildlife authorities.",
      "category": "science",
      "importance": 6,
      "tags": [
        "bird flu",
        "avian influenza",
        "New Jersey",
        "Canada geese",
        "wildlife disease",
        "public health"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1751615314771-340c968e1cbe?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxOHx8YmlyZCUyMGZsdSUyMGF2aWFuJTIwaW5mbHVlbnphfGVufDB8MHx8fDE3NzE2NTAxMjV8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://phys.org/news/2026-02-dead-sick-geese-nj-bird.html",
      "sourceName": "Phys.org",
      "publishedAt": "2026-02-21T11:02:15.109Z"
    },
    {
      "id": "ps-1771671749924-1qoh",
      "slug": "massive-medicare-study-links-air-pollution-directly-to-alzhe",
      "headline": "Massive Medicare Study Links Air Pollution Directly to Alzheimer's Risk",
      "subheadline": "Research spanning 27.8 million older Americans suggests fine particulate matter harms the brain directly, not just through chronic disease",
      "body": "Long-term exposure to fine particulate air pollution is associated with a significantly higher risk of developing Alzheimer's disease — and the damage appears to bypass the body's other chronic conditions to act directly on the brain, according to a sweeping new study of nearly 28 million Americans.\n\nResearchers led by Yanling Deng of Emory University analyzed Medicare records from more than 27.8 million beneficiaries aged 65 and older, collected between 2000 and 2018, making it one of the largest investigations ever conducted into the relationship between air quality and dementia. The study, published February 17 in the open-access journal PLOS Medicine, compared participants' pollution exposure levels against new Alzheimer's diagnoses while accounting for pre-existing chronic conditions including hypertension, stroke, and depression. The central finding was striking: the elevated Alzheimer's risk associated with polluted air was not primarily driven by these intermediary illnesses, suggesting that fine particulate matter — tiny airborne particles known as PM2.5 — may be damaging neural tissue through more direct biological pathways.\n\nThe research did identify one notable exception. Individuals with a prior history of stroke showed a somewhat stronger association between pollution exposure and Alzheimer's onset, indicating that vascular damage to the brain may leave it more vulnerable to environmental insults. Hypertension and depression, by contrast, did not meaningfully amplify the pollution-related risk. \"Our findings suggest that individuals with a history of stroke may be particularly vulnerable to the harmful effects of air pollution on brain health, highlighting an important intersection between environmental and vascular risk factors,\" the authors wrote.\n\nThe findings carry significant public health implications at a time when Alzheimer's disease affects roughly 57 million people worldwide and remains without a cure. If fine particulate pollution acts as an independent risk factor through direct neurological effects, then air quality improvements could represent a population-level strategy for reducing dementia incidence — a consideration with particular relevance as regulatory debates over emissions standards continue in the United States and abroad.\n\nThe study, funded by the National Institutes of Health, adds to a growing body of evidence connecting environmental exposures to neurodegeneration. Previous research has linked PM2.5 to a range of health outcomes beyond respiratory disease, including cardiovascular damage and liver disease. The Emory team's work narrows the mechanistic picture for Alzheimer's specifically, suggesting that the brain may be more directly exposed to airborne toxins than previously appreciated — and that cleaner air could be one of the most impactful interventions available for protecting cognitive health in aging populations.",
      "category": "science",
      "importance": 7,
      "tags": [
        "Alzheimer's disease",
        "air pollution",
        "PM2.5",
        "dementia",
        "public health",
        "Medicare",
        "Emory University"
      ],
      "imageUrl": "https://www.sciencedaily.com/images/1920/industrial-pollution-woman-children-future.webp",
      "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260220010836.htm",
      "sourceName": "Science Daily",
      "publishedAt": "2026-02-21T11:02:29.924Z"
    },
    {
      "id": "ps-1771671765097-wq66",
      "slug": "anthropic-and-openai-backers-clash-in-congressional-race-ove",
      "headline": "Anthropic and OpenAI Backers Clash in Congressional Race Over AI Regulation",
      "subheadline": "Dueling AI-funded PACs pour millions into a New York district race that has become a proxy war over the industry's future",
      "body": "A New York congressional race has become the unlikely battleground for a high-stakes proxy war between rival factions of the artificial intelligence industry, with dueling political action committees spending millions to shape the future of AI regulation in the United States.\n\nPublic First Action, a PAC backed by a $20 million donation from AI safety company Anthropic, is spending $450,000 to support New York Assembly member Alex Bores in his bid for the state's 12th congressional district seat, according to a Bloomberg report. The spending puts Anthropic's political operation in direct conflict with Leading the Future, a super PAC armed with more than $100 million from prominent tech figures and firms including venture capital giant Andreessen Horowitz, OpenAI President Greg Brockman, AI search startup Perplexity, and Palantir co-founder Joe Lonsdale. Leading the Future has already spent $1.1 million on ads attacking Bores.\n\nAt the center of the dispute is Bores' sponsorship of New York's RAISE Act, legislation that would require major AI developers to disclose their safety protocols and report serious incidents of system misuse. The bill represents exactly the kind of transparency mandate that companies racing to deploy AI at scale have lobbied against — and precisely the regulatory framework that Anthropic, which has positioned itself as the safety-conscious player in the AI arms race, has broadly supported. While both PACs describe themselves as pro-AI, they represent starkly different visions: Public First Action emphasizes transparency, safety standards, and public oversight, while Leading the Future has characterized regulations like the RAISE Act as impediments to American competitiveness.\n\nThe clash marks a significant escalation in the AI industry's political spending and lays bare a deepening ideological rift. On one side stand firms and investors who argue that regulation will stifle innovation; on the other, companies like Anthropic that contend responsible governance is essential to the technology's long-term success. The combined war chest exceeds $120 million — an extraordinary sum for what amounts to a single House race.\n\nFor Bores, the dynamic is unusual: a state legislator targeted by one wing of the tech industry and championed by another, all because of a bill focused on disclosure requirements rather than outright restrictions. The outcome of the race could signal to lawmakers nationwide whether supporting even modest AI oversight measures carries political risk — or political reward.",
      "category": "tech",
      "importance": 7,
      "tags": [
        "Anthropic",
        "OpenAI",
        "AI regulation",
        "super PAC",
        "RAISE Act",
        "political spending",
        "Alex Bores"
      ],
      "imageUrl": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2259873774.jpg?w=1024",
      "sourceUrl": "https://techcrunch.com/2026/02/20/anthropic-funded-group-backs-candidate-attacked-by-rival-ai-super-pac/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-21T11:02:45.097Z"
    },
    {
      "id": "ps-1771671780753-lhfa",
      "slug": "ecb-staff-frustration-mounts-over-lagarde-s-unclear-exit-pla",
      "headline": "ECB Staff Frustration Mounts Over Lagarde's Unclear Exit Plans",
      "subheadline": "Reports of an early departure by the central bank president have triggered internal confusion and questions about her authority",
      "body": "Growing frustration is rippling through the European Central Bank as staff grapple with reports that President Christine Lagarde may step down before her term concludes, according to a Bloomberg report published Friday. The uncertainty surrounding her potential early exit has left officials confused and questioning the strength of her leadership at a critical juncture for eurozone monetary policy.\n\nLagarde, who took the helm of the ECB in November 2019 with an eight-year mandate, has faced mounting speculation about a premature departure. The reports have caught many inside the Frankfurt-based institution off guard, generating what sources described as a mood of shock and irritation among staff who were given no clear communication about the president's intentions. The lack of transparency has raised pointed questions about institutional governance and the chain of command at Europe's most powerful financial authority.\n\nThe timing of the turmoil is particularly sensitive. The ECB is navigating a complex policy environment as it manages interest rates amid uneven economic recovery across the eurozone, persistent geopolitical risks, and evolving trade dynamics. A leadership vacuum — or even the perception of one — could complicate the bank's ability to project the steady hand that markets and member states expect from the institution. Central bank credibility rests heavily on clear, predictable communication, and the ambiguity surrounding Lagarde's future cuts directly against that principle.\n\nThe episode also raises immediate questions about succession. Any early departure would trigger a high-stakes political negotiation among EU member states to select a replacement, a process that historically involves intense jockeying between France, Germany, and other major economies. The last transition, which saw Lagarde succeed Mario Draghi, took months of diplomatic maneuvering. A sudden vacancy could accelerate those dynamics in ways that add further uncertainty to European financial markets.\n\nNeither Lagarde nor the ECB have issued a definitive public statement clarifying the situation, leaving both internal staff and external observers parsing signals. For an institution built on forward guidance and measured deliberation, the silence itself has become a source of unease.",
      "category": "business",
      "importance": 7,
      "tags": [
        "ECB",
        "Christine Lagarde",
        "European Central Bank",
        "central banking",
        "eurozone",
        "monetary policy"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1600880292203-757bb62b4baf?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw1fHxidXNpbmVzc3xlbnwwfDB8fHwxNzcxNjI4NTg2fDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-21/inside-the-ecb-irritation-grows-over-lagarde-s-handling-of-exit",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-21T11:03:00.753Z"
    },
    {
      "id": "ps-1771671796648-ehro",
      "slug": "supreme-court-strikes-down-trump-tariffs-in-6-3-ruling-bitco",
      "headline": "Supreme Court Strikes Down Trump Tariffs in 6-3 Ruling; Bitcoin Rally Fizzles",
      "subheadline": "BTC briefly topped $68,000 before sellers overwhelmed gains, while stocks held up better on the landmark decision",
      "body": "The U.S. Supreme Court ruled Friday that President Donald Trump's sweeping tariff regime is unconstitutional, delivering a landmark 6-3 decision that declared the executive branch had overstepped its authority. Bitcoin briefly surged on the news before sellers quickly erased the gains, underscoring the fragile state of crypto markets even in the face of a major macroeconomic catalyst.\n\nThe high court found that no president had ever invoked the relevant statute to impose tariffs of such \"magnitude and scope,\" writing that the \"lack of historical precedent\" combined with the \"breadth of authority\" claimed by the administration indicated the tariffs extended beyond the president's \"legitimate reach.\" The ruling effectively dismantles a trade policy framework that had weighed on global markets for months.\n\nBitcoin jumped roughly 2% immediately after the decision, briefly pushing above $68,000, but the move proved ephemeral. Within minutes, BTC slid back below $67,000, a pattern that has become frustratingly familiar to crypto traders — modest rallies met with swift distribution by larger holders. Data from analytics firm Santiment shows that wallets holding 10 to 10,000 bitcoin have been reducing positions since the October all-time high, even as smaller retail wallets have increased holdings by 2.5% over the same period. That dynamic helps explain why recovery attempts keep stalling. Equities, by contrast, showed more staying power: the Nasdaq climbed 0.6% to session highs following the ruling.\n\nThe Supreme Court decision landed on a day already colored by troubling economic signals. The Commerce Department reported that U.S. GDP grew just 1.4% in the fourth quarter of 2025, while core personal consumption expenditure prices rose 3% year-over-year — above the anticipated 2.9% and up from 2.8% in the prior reading. For the full year, the economy expanded only 2.2%, its weakest pace since the pandemic year of 2020. Art Hogan, chief market strategist at B. Riley Wealth, characterized the data as a \"messy message\" of hotter inflation and slower growth that reinforces the Federal Reserve's cautious approach to monetary policy.\n\nThe convergence of a historic court ruling and stagflationary economic data sets up a complex landscape for risk assets heading into the spring. While the removal of tariffs could eventually ease inflationary pressures and improve the trade outlook, the immediate market reaction suggests investors remain deeply uncertain about the path forward — particularly in crypto, where selling pressure from large holders continues to cap any upside momentum.",
      "category": "markets",
      "importance": 8,
      "tags": [
        "Supreme Court",
        "Trump tariffs",
        "Bitcoin",
        "stagflation",
        "US economy",
        "cryptocurrency",
        "Federal Reserve"
      ],
      "imageUrl": "https://cdn.sanity.io/images/s3y3vcno/production/31baab3948c5b1f8a4e57e1789ccfd534d92a939-1920x1080.jpg?auto=format&amp;w=960&amp;h=540&amp;crop=focalpoint&amp;fit=clip&amp;q=75&amp;fm=jpg",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/bitcoin-pops-then-drops-as-supreme-court-strikes-down-trump-tariffs",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-21T11:03:16.648Z"
    },
    {
      "id": "ps-1771670846383-6nbv",
      "slug": "common-pneumonia-bacterium-linked-to-alzheimer-s-disease-pro",
      "headline": "Common Pneumonia Bacterium Linked to Alzheimer's Disease Progression",
      "subheadline": "Cedars-Sinai researchers find Chlamydia pneumoniae invades the retina and brain, worsening neurodegeneration",
      "body": "A widespread bacterium responsible for respiratory infections may be quietly accelerating the progression of Alzheimer's disease, according to a study published February 21 in Nature Communications by researchers at Cedars-Sinai Medical Center.\n\nThe team found that Chlamydia pneumoniae — a common pathogen that causes pneumonia and sinus infections — can persist for years in the retina and brain, where it triggers inflammation, kills nerve cells, and drives the accumulation of amyloid-beta, the protein most closely associated with Alzheimer's pathology. In an analysis of retinal tissue from 104 individuals spanning the cognitive spectrum from healthy to severely impaired, people diagnosed with Alzheimer's harbored significantly higher levels of the bacterium in both their retinas and brains. Those carrying the APOE4 gene variant, already the strongest known genetic risk factor for late-onset Alzheimer's, showed particularly elevated bacterial loads.\n\n\"Seeing Chlamydia pneumoniae consistently across human tissues, cell cultures and animal models allowed us to identify a previously unrecognized link between bacterial infection, inflammation and neurodegeneration,\" said Maya Koronyo-Hamaoui, professor of Neurosurgery, Neurology, and Biomedical Sciences at Cedars-Sinai and senior author of the study. The research team validated its human findings in laboratory nerve cell cultures and Alzheimer's mouse models, where infection with the bacterium reproducibly increased inflammation, nerve cell death, amyloid-beta production, and cognitive deterioration.\n\nPerhaps the most clinically intriguing aspect of the work is its implications for early detection. The study demonstrated for the first time that Chlamydia pneumoniae can travel to the retina, the light-sensitive tissue at the back of the eye, where its inflammatory footprint mirrors what is happening in the brain. Koronyo-Hamaoui described the eye as \"a surrogate for the brain,\" suggesting that retinal imaging could eventually serve as a noninvasive screening tool to identify individuals at risk before significant cognitive decline sets in.\n\nThe findings raise the prospect that targeting what the researchers call the \"infection-inflammation axis\" — potentially through early antibiotic treatment or anti-inflammatory therapies — could represent a novel strategy against Alzheimer's. Timothy Crother, co-corresponding author and research professor at Cedars-Sinai, noted that the discovery opens the door to therapeutic approaches that address a chronic infectious driver rather than solely the downstream protein aggregates that have been the focus of most drug development. The study was funded by multiple National Institutes of Health grants and the Alzheimer's Association, and its authors emphasized that further clinical research will be needed to determine whether antimicrobial or anti-inflammatory interventions can meaningfully alter the course of the disease.",
      "category": "science",
      "importance": 7,
      "tags": [
        "Alzheimer's disease",
        "Chlamydia pneumoniae",
        "neurodegeneration",
        "retinal imaging",
        "APOE4",
        "Cedars-Sinai"
      ],
      "imageUrl": "https://www.sciencedaily.com/images/1920/neuroscience-brain-inflammation-disease.webp",
      "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000321.htm",
      "sourceName": "Science Daily",
      "publishedAt": "2026-02-21T10:47:26.383Z"
    },
    {
      "id": "ps-1771670860571-d8sy",
      "slug": "ukrainian-sentenced-to-five-years-for-helping-north-koreans-",
      "headline": "Ukrainian Sentenced to Five Years for Helping North Koreans Infiltrate U.S. Firms",
      "subheadline": "Oleksandr Didenko managed over 870 stolen identities and ran 'laptop farms' to disguise workers' true locations",
      "body": "A federal court has sentenced 29-year-old Ukrainian national Oleksandr Didenko to five years in prison for operating an identity theft ring that enabled North Korean workers to fraudulently obtain jobs at dozens of American companies — funneling wages back to Pyongyang's sanctioned nuclear weapons program.\n\nDidenko, a Kyiv resident, ran a website called Upworksell that served as a marketplace where overseas workers, including North Koreans, could purchase or rent stolen U.S. identities to secure employment with American firms. According to the Department of Justice, Didenko handled more than 870 stolen identities before the FBI seized the site in 2024 and redirected its traffic to government servers. Polish authorities arrested Didenko, who was subsequently extradited to the United States, where he pleaded guilty to the charges.\n\nBeyond the identity theft operation, prosecutors said Didenko maintained so-called \"laptop farms\" — rooms stacked with open computers hosted by paid accomplices in California, Tennessee, and Virginia. These setups allowed North Korean operatives to remotely log in and perform their work as though they were physically located in the United States, bypassing geographic detection measures that employers might use. The arrangement is a hallmark of North Korea's expanding IT worker schemes, which cybersecurity firm CrowdStrike has flagged as sharply increasing, with operatives typically posing as remote software developers and engineers.\n\nSecurity researchers have characterized North Korean IT workers as a \"triple threat\" to Western businesses. The operatives violate U.S. sanctions, steal sensitive corporate data during their employment, and subsequently attempt to extort victim companies by threatening to release proprietary information. The earnings generated through these schemes represent one of several revenue streams the North Korean regime has developed to circumvent international financial sanctions.\n\nThe Didenko case is the latest in a growing series of prosecutions targeting individuals who facilitate Pyongyang's IT infiltration networks. North Korean operatives have also been documented impersonating recruiters and venture capitalists to target high-net-worth individuals, particularly in the cryptocurrency sector, by tricking victims into granting remote access to their devices. The Department of Justice's announcement this week signals continued federal focus on dismantling the infrastructure that makes these schemes possible.",
      "category": "tech",
      "importance": 7,
      "tags": [
        "North Korea",
        "cybersecurity",
        "identity theft",
        "sanctions",
        "FBI",
        "IT workers"
      ],
      "imageUrl": "https://techcrunch.com/wp-content/uploads/2026/02/laptop-farm-upscale.jpeg?resize=1200,802",
      "sourceUrl": "https://techcrunch.com/2026/02/20/ukrainian-man-jailed-for-identity-theft-that-helped-north-koreans-get-jobs-at-us-companies/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-21T10:47:40.571Z"
    },
    {
      "id": "ps-1771669990302-e9fo",
      "slug": "sec-lets-broker-dealers-count-stablecoins-as-capital-in-majo",
      "headline": "SEC Lets Broker-Dealers Count Stablecoins as Capital in Major Policy Shift",
      "subheadline": "A quiet FAQ update applying just a 2% haircut to stablecoin holdings could reshape how Wall Street engages with tokenized finance",
      "body": "The U.S. Securities and Exchange Commission has opened the door for broker-dealers to treat stablecoin holdings as regulatory capital, a move industry observers are calling one of the most consequential crypto policy changes to emerge from the agency's ongoing deregulatory push. The change, disclosed this week through a modest update to an FAQ document on the SEC's website, instructs firms to apply only a 2% haircut to holdings of dollar-pegged tokens such as Circle's USDC and Tether's USDT — meaning 98% of their value can count toward capital requirements.\n\nThe practical impact is enormous. Previously, broker-dealers effectively faced a 100% haircut on stablecoin holdings, forcing them to zero out those assets in capital calculations. Holding stablecoins amounted to a financial penalty, discouraging firms from custodying tokenized securities or facilitating crypto trading. The new guidance places stablecoins on roughly equal footing with money market funds on a firm's balance sheet, according to Tonya Evans, a crypto education executive and Digital Currency Group board member. \"Holding them was a financial penalty. That's over,\" Evans wrote on X.\n\nThe change arrives as part of the SEC's broader Project Crypto initiative, which has relied on informal guidance, staff statements, and industry correspondence rather than formal rulemaking to reshape the agency's approach to digital assets. SEC Commissioner Hester Peirce, who leads the Crypto Task Force established under the Trump administration, said in a statement that the update \"will make it feasible for broker-dealers to engage in a broader range of business activities relating to tokenized securities and other crypto assets.\" She added that she wants to explore how existing SEC rules could be formally amended to account for payment stablecoins.\n\nThe implications extend across the financial industry. Larry Florio, deputy general counsel at Ethena Labs, noted that the capital calculations affected by this change govern operations \"everywhere from Robinhood to Goldman Sachs.\" With stablecoins now functioning as working capital, broker-dealers can more readily provide liquidity, facilitate settlement, and advance tokenized finance — areas that had been effectively blocked by the prior regulatory treatment.\n\nYet the informal nature of the policy shift remains a concern. Staff guidance lacks the legal weight of a formal rule and can be reversed just as easily as it was issued. Cody Carbone, CEO of the Digital Chamber, acknowledged that while the guidance \"helps reduce uncertainty for firms seeking to operate compliantly,\" it does not create new rules. That fragility is why crypto advocates continue to press Congress for legislation like the GENIUS Act, which would codify stablecoin regulation into law rather than leave it subject to the preferences of whichever leadership next occupies the SEC's top offices.",
      "category": "markets",
      "importance": 7,
      "tags": [
        "SEC",
        "stablecoins",
        "broker-dealers",
        "crypto regulation",
        "tokenized finance",
        "capital requirements"
      ],
      "imageUrl": "https://cdn.sanity.io/images/s3y3vcno/production/a0b9c77ef2096d8c4905fefac8edbe280eb49ff3-1920x1080.jpg?auto=format&amp;w=960&amp;h=540&amp;crop=focalpoint&amp;fit=clip&amp;q=75&amp;fm=jpg",
      "sourceUrl": "https://www.coindesk.com/policy/2026/02/20/sec-makes-quiet-shift-to-brokers-stablecoin-holdings-that-may-pack-big-results",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-21T10:33:10.302Z"
    },
    {
      "id": "ps-1771667248828-52xm",
      "slug": "ai-generated-fake-news-more-credible-than-human-written-ling",
      "headline": "AI-Generated Fake News More Credible Than Human-Written, Linguist Warns",
      "subheadline": "Multilingual research project reveals linguistic patterns behind disinformation — and why AI makes them harder to detect",
      "body": "Artificial intelligence is making fake news significantly more convincing to readers, according to new research from linguist Silje Susanne Alvestad, whose multilingual study of disinformation's linguistic fingerprints has raised fresh concerns about the erosion of public trust in media.\n\nAlvestad, who leads the \"Fakespeak — the language of fake news\" research project, found that AI-generated disinformation is often perceived as more credible than fake news written by humans. The project, which analyzed fake news texts across English, Russian, and Norwegian, sought to identify whether disinformation could be reliably detected based on linguistic traits alone. The findings suggest that while human-authored fake news tends to carry identifiable stylistic markers — such as emotional language, syntactical irregularities, or inconsistent tone — AI-produced content often smooths over these telltale signs, producing text that reads with the polished authority of legitimate journalism.\n\nThe research builds on nearly a decade of growing concern about disinformation's societal impact. Norway's Language Council selected \"fake news\" as its word of the year back in 2017, reflecting how deeply the phenomenon had already penetrated public consciousness. But the landscape has shifted dramatically since then. The proliferation of large language models capable of generating fluent, contextually appropriate prose has introduced what Alvestad's work characterizes as a qualitative escalation in the disinformation threat.\n\nBy examining fake news across three languages with distinct media ecosystems and political contexts, the Fakespeak project offers a rare cross-linguistic perspective on how disinformation operates. The multilingual approach is particularly valuable given that much existing research has focused predominantly on English-language content, potentially overlooking how fake news exploits the specific rhetorical conventions and reader expectations of other languages.\n\nThe implications extend well beyond academia. As AI tools become cheaper and more accessible, the barrier to producing professional-grade disinformation continues to fall. Alvestad's findings underscore an uncomfortable reality for fact-checkers, platform moderators, and media literacy advocates: the linguistic cues that once helped trained readers identify questionable content are becoming increasingly unreliable. The research suggests that combating AI-enhanced disinformation will require new detection frameworks that move beyond surface-level textual analysis toward deeper structural and contextual verification methods.",
      "category": "tech",
      "importance": 6,
      "tags": [
        "artificial intelligence",
        "disinformation",
        "fake news",
        "linguistics",
        "media literacy"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1764549906172-0153db0825bc?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxN3x8YXJ0aWZpY2lhbCUyMGludGVsbGlnZW5jZSUyMGRpc2luZm9ybWF0aW9ufGVufDB8MHx8fDE3NzE2NjU0MzB8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://phys.org/news/2026-02-linguist-ai-fake-news-credible.html",
      "sourceName": "Phys.org",
      "publishedAt": "2026-02-21T09:47:28.828Z"
    },
    {
      "id": "ps-1771661873246-jkit",
      "slug": "mexico-canada-dodge-10-us-tariff-after-supreme-court-ruling",
      "headline": "Mexico, Canada Dodge 10% US Tariff After Supreme Court Ruling",
      "subheadline": "Immediate relief for North American trade partners, but looming USMCA review poses larger threat to trilateral commerce",
      "body": "Mexico and Canada have secured an exemption from the 10 percent universal tariff that the United States had sought to impose, following the Supreme Court's landmark decision to strike down significant portions of President Donald Trump's tariff regime. But trade analysts warn that a far more consequential battle over the future of North American commerce lies ahead.\n\nThe Court's ruling, which invalidated many of the tariffs enacted under the Trump administration, provided immediate breathing room for America's two largest trading partners. The decision effectively shields goods flowing across the northern and southern borders from the blanket levy that had threatened to disrupt supply chains stretching across all three nations. For manufacturers and agricultural exporters who depend on seamless cross-border trade, the exemption represents a significant, if temporary, reprieve.\n\nYet the relief may prove short-lived. The United States-Mexico-Canada Agreement, the trilateral trade pact that replaced NAFTA in 2020, faces a scheduled review that could fundamentally reshape the terms of North American economic integration. The USMCA contains a sunset clause requiring the three governments to confirm their commitment to the agreement by 2026, with a comprehensive review process that opens the door to renegotiation or even withdrawal. Given the current political climate in Washington, where trade skepticism remains a potent force across party lines, the review carries substantial downside risk for all parties involved.\n\nThe stakes are enormous. Trade among the three USMCA nations totals well over $1.5 trillion annually, supporting millions of jobs in industries ranging from automotive manufacturing to agriculture and energy. Any disruption to the agreement's preferential terms — including its rules of origin for automobiles, its digital trade provisions, and its labor and environmental standards — could send shockwaves through integrated supply chains that have been decades in the making.\n\nFor now, businesses on both sides of the border can operate without the immediate burden of an additional 10 percent levy. But the broader trajectory of U.S. trade policy remains deeply uncertain, and the approaching USMCA review ensures that Mexico and Canada will face continued pressure to make concessions in order to preserve the framework that underpins continental commerce.",
      "category": "business",
      "importance": 7,
      "tags": [
        "USMCA",
        "tariffs",
        "Supreme Court",
        "US trade policy",
        "Mexico",
        "Canada",
        "North American trade"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1462206092226-f46025ffe607?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxN3x8YnVzaW5lc3N8ZW58MHwwfHx8MTc3MTYzMzk4NHww&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-21/mexico-canada-get-exemption-to-10-us-levy-but-usmca-risk-looms",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-21T08:17:53.246Z"
    },
    {
      "id": "ps-1771660018513-f1ls",
      "slug": "trump-signals-possible-limited-military-strike-against-iran",
      "headline": "Trump Signals Possible Limited Military Strike Against Iran",
      "subheadline": "President floats military action as diplomatic window narrows, with Iran promising a draft agreement within days",
      "body": "President Donald Trump said Friday he is weighing a limited military strike on Iran, escalating pressure on Tehran as nuclear negotiations enter what both sides describe as a critical phase. The remarks came hours after senior administration officials had publicly raised the possibility of military action.\n\nTrump told reporters earlier in the week that the world would learn \"over the next, probably, 10 days\" whether Iran would agree to a deal constraining its nuclear program or face U.S. military force. Iranian Foreign Minister Abbas Araghchi responded Friday by announcing that Tehran is preparing \"a draft of a possible agreement\" to be delivered to U.S. Special Envoy Steve Witkoff within days. The two sides have been holding talks in Geneva, with both characterizing the discussions as productive.\n\nThe diplomatic maneuvering is unfolding against a backdrop of significant American military buildup in the region. The USS Gerald R. Ford — the world's largest warship — appears to be heading toward the vicinity of Iran, joining the USS Abraham Lincoln carrier strike group alongside an expanding flotilla of destroyers, combat ships, and fighter jets. Satellite imagery indicates Iran has bolstered its own military installations in response, while Supreme Leader Ayatollah Ali Khamenei has posted veiled threats aimed at U.S. forces on social media.\n\nThe situation carries echoes of last July's Operation Midnight Hammer, when U.S. forces struck Iranian nuclear facilities even as White House officials were still publicly discussing the prospects for successful negotiations. The day before that strike, Press Secretary Karoline Leavitt read a Trump statement suggesting he would decide on military action \"within the next two weeks\" — language strikingly similar to his current rhetoric. Trump has long favored strategic ambiguity, frequently reminding journalists he prefers to keep adversaries guessing about his intentions.\n\nAny military escalation would arrive at a politically delicate moment for the administration. Trump is contending with the Supreme Court's landmark ruling striking down his sweeping tariff regime, and polls show growing public dissatisfaction with his handling of immigration and the economy. A protracted, multi-week campaign against Iran — reportedly among the range of options presented to the president by military planners — could risk alienating elements of his MAGA base, many of whom were drawn to his promises to avoid costly foreign entanglements. The United States and its European allies maintain that Iran is moving toward developing a nuclear weapon, an accusation Tehran has consistently denied.",
      "category": "breaking",
      "importance": 9,
      "tags": [
        "Iran",
        "Trump",
        "military strike",
        "nuclear negotiations",
        "Middle East",
        "US foreign policy"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/1a63/live/ac7525e0-0ea4-11f1-8fa9-a78fde43271a.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/cdxzk4gvzp0o?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-21T07:46:58.513Z"
    },
    {
      "id": "ps-1771651943716-ny06",
      "slug": "ancient-oxygen-breathing-microbes-may-explain-origins-of-com",
      "headline": "Ancient Oxygen-Breathing Microbes May Explain Origins of Complex Life",
      "subheadline": "Massive genomic study of Asgard archaea resolves long-standing paradox about how eukaryotes first emerged",
      "body": "A sweeping genomic analysis of ancient microbes has yielded compelling evidence that the ancestors of all complex life — plants, animals, and fungi — were already capable of using oxygen long before they evolved into the first eukaryotic cells. The findings, published in Nature on February 20, address one of evolutionary biology's most persistent puzzles.\n\nResearchers at the University of Texas at Austin, led by marine scientist Brett Baker, assembled more than 13,000 new microbial genomes from roughly 15 terabytes of environmental DNA collected across multiple marine expeditions. From this dataset, the team recovered hundreds of previously unknown genomes belonging to Asgard archaea, a group widely regarded as the closest living relatives of the organism that gave rise to all complex life. The effort nearly doubled the known genomic diversity of the entire Asgard group and revealed previously unrecognized protein families, doubling the number of recognized enzymatic classes within these microbes.\n\nThe central finding challenges a longstanding assumption. Most known Asgard archaea inhabit oxygen-free deep-sea environments, which made it difficult to explain how they could have partnered with oxygen-dependent alphaproteobacteria — the symbiotic merger that scientists believe produced the first eukaryotic cell and its energy-producing mitochondria. Baker's team discovered that a subgroup called Heimdallarchaeia, the Asgards most closely related to eukaryotes, actually thrives in oxygen-rich shallow coastal sediments and open water columns. These organisms possess multiple metabolic pathways for oxygen use. Using the AI protein-structure prediction tool AlphaFold2, the researchers demonstrated that several Heimdallarchaeia proteins closely resemble those eukaryotic cells use today for oxygen-based energy metabolism.\n\nThe timeline reinforces the case. Following the Great Oxidation Event more than 1.7 billion years ago, when atmospheric oxygen levels surged, the earliest known eukaryotic microfossils appear in the geological record within a few hundred thousand years. \"Oxygen appeared in the environment, and Asgards adapted to that,\" Baker said. \"They found an energetic advantage to using oxygen, and then they evolved into eukaryotes.\"\n\nThe research, which grew from co-author Kathryn Appler's doctoral work beginning in 2019 at the UT Marine Science Institute, involved collaborators at Monash University in Australia, Wageningen University in the Netherlands, and several other institutions. Funding came in part from the Gordon and Betty Moore and Simons Foundations. By resolving the oxygen paradox at the heart of eukaryotic origins, the study offers the strongest evidence yet that breathable air was not merely a backdrop to the emergence of complex life — it was a catalyst.",
      "category": "science",
      "importance": 8,
      "tags": [
        "eukaryotes",
        "Asgard archaea",
        "evolution",
        "oxygen metabolism",
        "genomics",
        "origin of life"
      ],
      "imageUrl": "https://www.sciencedaily.com/images/1920/collecting-microbial-metagenomes-in-shallow-coastal-sediments.webp",
      "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260220010825.htm",
      "sourceName": "Science Daily",
      "publishedAt": "2026-02-21T05:32:23.716Z"
    },
    {
      "id": "ps-1771651049519-elrc",
      "slug": "giant-virus-found-in-japan-bolsters-theory-that-viruses-spar",
      "headline": "Giant Virus Found in Japan Bolsters Theory That Viruses Sparked Complex Life",
      "subheadline": "Ushikuvirus, isolated from a Japanese lake, exhibits unusual nuclear-disrupting behavior that bridges gaps in viral evolution",
      "body": "A newly identified giant virus isolated from a lake in Japan is providing fresh evidence for one of biology's most provocative hypotheses: that viruses may have given rise to the nucleus at the heart of all complex cells, effectively catalyzing the emergence of eukaryotic life on Earth.\n\nThe virus, named ushikuvirus after Lake Ushiku in Ibaraki Prefecture, was described in a study published in the Journal of Virology by a team led by Professor Masaharu Takemura of Tokyo University of Science alongside collaborators at Japan's National Institute of Natural Sciences. Ushikuvirus infects vermamoeba, a single-celled amoeba, and belongs to the broader group of giant DNA viruses — entities so large and genetically complex that they blur the traditional boundary between viruses and living cells. What makes this particular specimen significant is the way it replicates: unlike related viruses in the Mamonoviridae family, which commandeer the host cell's intact nucleus as a factory for producing new viral particles, ushikuvirus actively breaks down the nuclear membrane during replication.\n\nThat distinction matters because it positions ushikuvirus as a potential evolutionary link between two previously separate categories of giant viruses — those that replicate inside an intact nucleus, like medusavirus, and those that dismantle the nuclear membrane entirely, like pandoravirus. Takemura, who along with Macquarie University's Philip Bell independently proposed the viral eukaryogenesis hypothesis in 2001, argues that such intermediate behaviors strengthen the case that a large DNA virus once established a stable symbiotic relationship inside an ancient archaeal cell, eventually transforming into the membrane-bound nucleus found in all eukaryotes today. That hypothesis gained significant traction after the first giant DNA viruses were discovered in 2003, revealing that some viral infections produce membrane-enclosed \"virus factories\" inside host cells that bear a striking resemblance to primitive nuclei.\n\nBeyond its evolutionary implications, ushikuvirus presents a suite of distinctive physical features. Its capsid surface is studded with spiked structures capped by unique formations, some trailing filament-like extensions never observed in related medusaviruses. Infected vermamoeba cells swell to unusual sizes, a cytopathic effect distinct from those caused by other known giant viruses. The research team — which included master's students Jiwan Bae and Narumi Hantori, along with Dr. Raymond Burton-Smith and Professor Kazuyoshi Murata — notes that these differences likely reflect long-term adaptation to different amoeba hosts.\n\nThe discovery also carries potential medical relevance. Certain amoeba species closely related to those infected by giant viruses can cause life-threatening conditions, including amoebic encephalitis. Understanding how giant viruses infiltrate and destroy amoebae could eventually inform new strategies for treating such infections. \"Giant viruses can be said to be a treasure trove whose world has yet to be fully understood,\" Takemura said. \"One of the future possibilities of this research is to provide humanity with a new view that connects the world of living organisms with the world of viruses.\"",
      "category": "science",
      "importance": 7,
      "tags": [
        "giant virus",
        "eukaryogenesis",
        "evolution",
        "cell nucleus",
        "virology",
        "ushikuvirus"
      ],
      "imageUrl": "https://www.sciencedaily.com/images/1920/giant-virus.webp",
      "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040814.htm",
      "sourceName": "Science Daily",
      "publishedAt": "2026-02-21T05:17:29.519Z"
    },
    {
      "id": "ps-1771649229602-f22y",
      "slug": "new-method-measures-relativistic-temperature-using-only-stoc",
      "headline": "New Method Measures Relativistic Temperature Using Only Stochastic Noise",
      "subheadline": "Physicist demonstrates that electromagnetic fluctuations alone can reveal the full thermal state of a fast-moving plasma",
      "body": "A new theoretical framework shows that the temperature and velocity of a relativistic medium can be extracted purely from the random electromagnetic noise it naturally emits — eliminating the need for external probes, spectral line analysis, or absolute intensity calibration.\n\nPublished on the arXiv preprint server on February 18, physicist Ira Wolfson presents a method for reconstructing the inverse-temperature four-vector, the fundamental quantity describing thermal equilibrium in special relativity. Unlike classical thermodynamics, where temperature is a simple scalar, relativistic systems require a four-component object — denoted β^μ — that encodes both the rest-frame temperature and the medium's bulk drift velocity relative to an observer. Wolfson's key insight is that when a hot, moving plasma emits thermal radiation, a Lorentz boost transforms what would be isotropic noise in the plasma's rest frame into a distinctive pattern of correlated electric and magnetic field fluctuations. These correlations contain enough information to determine the drift velocity without any external reference.\n\nThe approach leverages the covariant fluctuation-dissipation theorem, a cornerstone result connecting thermal noise to the dissipative properties of a system. By measuring angle-resolved noise spectra from the electromagnetic emissions, the full four-vector β^μ can be assembled using only passive detection of stochastic fields. Critically, the method relies on a gain-independent observable — a ratio of fluctuation quantities that cancels out detector calibration factors — making it robust against the systematic uncertainties that typically plague precision plasma diagnostics.\n\nMonte Carlo simulations reported in the four-page paper demonstrate that the technique achieves percent-level accuracy at realistic signal-to-noise ratios. Feasibility estimates suggest that for laboratory plasmas, integration times on the order of sub-microsecond durations would be sufficient, placing the method well within reach of existing experimental capabilities. This speed could prove valuable in transient plasma experiments, including those in fusion energy research and high-energy-density physics, where conditions change rapidly.\n\nWolfson describes this as the first method capable of reconstructing the covariant thermal state of a relativistic medium from passive stochastic fields alone. If validated experimentally, the technique would establish vacuum electromagnetic fluctuations as a direct, operational probe of relativistic equilibrium — a conceptual advance that bridges plasma physics, statistical mechanics, and general relativity. The work has been cross-listed across all three of those arXiv categories, signaling its interdisciplinary significance.",
      "category": "physics",
      "importance": 6,
      "tags": [
        "relativistic thermodynamics",
        "plasma physics",
        "electromagnetic fluctuations",
        "covariant temperature",
        "fluctuation-dissipation theorem"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1652967358211-899209821b8b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxM3x8cmVsYXRpdmlzdGljJTIwdGhlcm1vZHluYW1pY3MlMjBwbGFzbWElMjBwaHlzaWNzfGVufDB8MHx8fDE3NzE2MDk3MDd8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://arxiv.org/abs/2602.16765",
      "sourceName": "arXiv Physics",
      "publishedAt": "2026-02-21T04:47:09.602Z"
    },
    {
      "id": "ps-1771648332888-qw76",
      "slug": "new-ai-framework-embeds-maxwell-s-equations-into-diffusion-m",
      "headline": "New AI Framework Embeds Maxwell's Equations Into Diffusion Models for Photonic Design",
      "subheadline": "MxDiffusion uses a two-stage physics-guided approach that outperforms purely data-driven methods for inverse metasurface engineering",
      "body": "A team of researchers has developed a novel generative AI framework that bakes the fundamental laws of electromagnetism directly into a diffusion model, enabling more accurate and physically consistent design of photonic metasurfaces — nanoscale structures that manipulate light in ways natural materials cannot.\n\nThe system, called MxDiffusion, was introduced in a preprint by Sujoy Mondal, Taehyuk Park, Sudipta Biswas, Alan X. Wang, and Wenshan Cai. Unlike conventional machine learning approaches to inverse photonic design, which rely entirely on training data to learn the relationship between a desired optical response and the structure that produces it, MxDiffusion incorporates Maxwell's equations — the foundational laws governing electromagnetic wave behavior — as an explicit constraint during model training. The result is a hybrid physics-and-data-driven system that generates photonic structures from target optical properties with significantly higher fidelity, particularly in challenging design scenarios.\n\nThe framework operates through a two-stage strategy. In the first stage, a diffusion model is trained using a loss function derived directly from Maxwell's equations, embedding physical principles into the generation process and producing a physically consistent intermediate representation. The second stage then translates that intermediate output into a final structural geometry. This division of labor allows the model to maintain physical plausibility while still leveraging the flexibility and generative power of modern diffusion architectures.\n\nThe researchers validated MxDiffusion on two representative test cases: gold nanostructures patterned on a silica substrate and a highly tunable bandpass filter based on phase-change material. In both scenarios, the physics-guided framework consistently outperformed a conventional data-driven diffusion model benchmark. The advantages were most pronounced for out-of-training-distribution design targets — cases where the desired optical response falls outside the range of examples the model was trained on — and for highly constrained resonance conditions, where small structural errors can produce large deviations in optical behavior.\n\nThe work addresses a persistent bottleneck in nanophotonics. Designing metasurfaces traditionally requires computationally expensive electromagnetic simulations, and purely data-driven inverse design methods often struggle with generalization and physical accuracy. By grounding the generative process in Maxwell's equations, MxDiffusion offers what the authors describe as a general physics-guided inverse design paradigm — one that could extend beyond photonics to other domains where governing physical laws can be mathematically encoded into machine learning pipelines. The preprint was posted to arXiv on February 18, 2026.",
      "category": "physics",
      "importance": 6,
      "tags": [
        "photonics",
        "metasurfaces",
        "diffusion models",
        "inverse design",
        "Maxwell's equations",
        "nanophotonics",
        "machine learning"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1622548283559-4dbd130508e0?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxfHxwaG90b25pY3MlMjBtZXRhc3VyZmFjZXN8ZW58MHwwfHx8MTc3MTYwOTUwOHww&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://arxiv.org/abs/2602.16851",
      "sourceName": "arXiv Physics",
      "publishedAt": "2026-02-21T04:32:12.888Z"
    },
    {
      "id": "ps-1771641184676-9ng0",
      "slug": "paramount-skydance-clears-key-antitrust-hurdle-in-77-9b-warn",
      "headline": "Paramount Skydance Clears Key Antitrust Hurdle in $77.9B Warner Bid",
      "subheadline": "Hart-Scott-Rodino waiting period expires, but Justice Department could still challenge the mega-merger",
      "body": "Paramount Skydance announced Friday that it faces no remaining statutory barrier in the United States to completing its proposed $77.9 billion acquisition of Warner Bros. Discovery, after a critical antitrust review period expired without federal action to block the deal.\n\nThe company said it has fully complied with the U.S. Justice Department's second-request review process under the Hart-Scott-Rodino Act, a procedural step that allows regulators to scrutinize large mergers before they close. A mandatory 10-day waiting period following that compliance lapsed on Thursday, removing one of the most significant regulatory checkpoints standing between the two entertainment giants and a transformative combination.\n\nHowever, the expiration of the waiting period does not constitute regulatory approval. The Justice Department retains the authority to file suit to block the merger at any point, and has done so in past cases even after HSR waiting periods have passed. The distinction is an important one for investors and industry observers watching what would be one of the largest media deals in history — a transaction that would unite Paramount's film studio, CBS network, and streaming platform with Warner Bros. Discovery's sprawling portfolio of assets including HBO, CNN, and the Warner Bros. film and television operations.\n\nThe deal, which would reshape the competitive landscape of an entertainment industry already under intense pressure from streaming economics and cord-cutting, has drawn scrutiny from analysts questioning whether regulators in the current administration would permit such extensive consolidation. A combined entity would control an enormous share of scripted television production, film distribution, and streaming content, potentially raising concerns about market concentration and bargaining power over distributors.\n\nParamount Skydance — itself the product of Skydance Media's recent takeover of the legacy Paramount operation — framed the milestone as significant forward progress, stating it sees \"no statutory impediment\" to closing. Yet the path to completion likely involves additional regulatory reviews in international jurisdictions, and the Justice Department's silence should not be read as tacit endorsement. For now, the mega-merger remains alive, but far from assured.",
      "category": "business",
      "importance": 7,
      "tags": [
        "Paramount",
        "Warner Bros Discovery",
        "mergers and acquisitions",
        "antitrust",
        "media consolidation",
        "Skydance"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1520607162513-77705c0f0d4a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw2fHxidXNpbmVzc3xlbnwwfDB8fHwxNzcxNjI4NTg2fDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/videos/2026-02-20/paramount-regulatory-waiting-period-for-warner-bid-ends-video",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-21T02:33:04.676Z"
    },
    {
      "id": "ps-1771634872111-tyjb",
      "slug": "new-asymptotic-solution-captures-heat-effects-of-em-beams-on",
      "headline": "New Asymptotic Solution Captures Heat Effects of EM Beams on Skin",
      "subheadline": "Researchers derive closed-form expressions that account for both incident angle and lateral heat conduction in electromagnetic skin heating",
      "body": "A team of researchers has developed a more complete mathematical framework for predicting how electromagnetic beams heat biological skin tissue, closing a gap in previous models that failed to capture the significant effects of lateral heat conduction at realistic length scales.\n\nThe study, posted to the arXiv preprint server on February 18 by Ulises Jaime-Yepez, Hongyun Wang, Shannon E. Foley, and Hong Zhou, extends earlier work that derived only the leading-term asymptotic solution for temperature distribution during electromagnetic skin heating at arbitrary incident angles. The new analysis provides closed-form analytical expressions for both the first-order and second-order terms in an asymptotic expansion, enabling substantially more accurate temperature predictions — particularly in scenarios where the ratio of beam penetration depth to lateral beam size is moderate rather than vanishingly small.\n\nThe asymptotic approach exploits the fact that electromagnetic beams penetrate skin to a depth much smaller than their cross-sectional width, allowing the temperature field to be expanded in powers of this small depth-to-lateral scale ratio. A key finding is that while the incident angle of the beam affects all terms in the expansion, lateral heat conduction — the sideways spreading of thermal energy through tissue — appears only in terms of positive even powers. This means the leading-term solution, which was the state of the art from prior work, entirely misses the contribution of lateral conduction. At a depth-to-lateral ratio of 0.1, a value the authors characterize as moderate and physically relevant, the lateral conduction effect proves \"quite significant\" and cannot be neglected in any meaningful approximation.\n\nThe work spans classical physics and biological physics, reflecting its dual relevance to electromagnetic theory and biomedical applications. Electromagnetic skin heating arises in contexts ranging from medical therapies and dermatological treatments to safety assessments of radiation exposure. Accurate modeling of temperature distributions in tissue is critical for predicting thermal damage thresholds, optimizing therapeutic protocols, and understanding how beam geometry and orientation influence heating patterns beneath the skin surface.\n\nThe paper, which the authors describe as a preprint to be submitted for publication, represents a meaningful advance in the analytical toolkit available for these problems. By providing exact closed-form expressions rather than purely numerical solutions, the framework offers both computational efficiency and physical transparency — allowing researchers and engineers to directly see how each parameter governs the thermal response of irradiated tissue.",
      "category": "physics",
      "importance": 4,
      "tags": [
        "electromagnetic heating",
        "asymptotic analysis",
        "skin tissue",
        "classical physics",
        "biophysics",
        "thermal modeling"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1765410848575-063a741bfcab?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw3fHxlbGVjdHJvbWFnbmV0aWMlMjBoZWF0aW5nJTIwYXN5bXB0b3RpYyUyMGFuYWx5c2lzfGVufDB8MHx8fDE3NzE2MzQ4NzJ8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://arxiv.org/abs/2602.16751",
      "sourceName": "arXiv Physics",
      "publishedAt": "2026-02-21T00:47:52.111Z"
    },
    {
      "id": "ps-1771632167941-u474",
      "slug": "tesla-fails-to-overturn-243-million-autopilot-crash-verdict",
      "headline": "Tesla Fails to Overturn $243 Million Autopilot Crash Verdict",
      "subheadline": "Federal judge rejects automaker's motion, saying arguments were already 'considered and rejected' during trial",
      "body": "A federal judge has denied Tesla's attempt to reverse a $243 million jury verdict that found the automaker partially liable for a fatal 2019 crash in Florida involving its Autopilot driver assistance system, dealing a significant blow to the company's legal defense of the technology.\n\nHon. Judge Beth Bloom ruled on February 20 that Tesla's arguments for overturning the verdict were essentially recycled from earlier stages of the litigation. \"The grounds for relief that Tesla relies upon are virtually the same as those Tesla put forth previously during the course of trial and in their briefings on summary judgment — arguments that were already considered and rejected,\" the judge wrote, adding that Tesla failed to present any new legal arguments or controlling law that would justify altering the jury's decision.\n\nThe case stems from a 2019 crash in Florida that killed Naibel Benavides and critically injured Dillon Angulo. Last August, a jury awarded $243 million in damages, assigning two-thirds of the blame to the driver and one-third to Tesla. In a notable detail, the jury levied punitive damages exclusively against Tesla — a signal that jurors found the company's conduct warranted punishment beyond simple compensation. Tesla's legal team had argued that responsibility for the crash rested squarely with the driver.\n\nThe ruling carries broad implications for Tesla as it faces mounting legal scrutiny over its driver assistance technology. Autopilot, which handles certain steering, acceleration, and braking functions, has been at the center of numerous lawsuits and federal investigations. Critics have long argued that Tesla's marketing and naming of the system encourages drivers to over-rely on technology that still requires active human supervision. The company maintains that Autopilot is designed to assist — not replace — an attentive driver.\n\nThe decision arrives at a sensitive moment for Tesla, which continues to push aggressively into autonomous driving with its Full Self-Driving software. With the $243 million verdict now upheld, the case could embolden plaintiffs in other pending Autopilot-related lawsuits and increase pressure on regulators to impose stricter oversight on advanced driver assistance systems across the industry.",
      "category": "tech",
      "importance": 7,
      "tags": [
        "Tesla",
        "Autopilot",
        "autonomous driving",
        "lawsuit",
        "EV safety"
      ],
      "imageUrl": "https://techcrunch.com/wp-content/uploads/2023/12/tesla-autopilot-2.jpg?resize=1200,675",
      "sourceUrl": "https://techcrunch.com/2026/02/20/tesla-loses-bid-to-overturn-243m-autopilot-verdict/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-21T00:02:47.941Z"
    },
    {
      "id": "ps-1771631277484-ghw1",
      "slug": "blue-owl-offloads-1-4b-loan-portfolio-to-pensions-own-insure",
      "headline": "Blue Owl Offloads $1.4B Loan Portfolio to Pensions, Own Insurer",
      "subheadline": "Alternative asset manager tapped North America's largest pension funds and its affiliated insurance unit to meet fund redemption deadline",
      "body": "Blue Owl Capital sold a $1.4 billion portfolio of private loans to four buyers — three of North America's largest pension funds and its own insurance asset management arm — as the firm raced to return capital to investors in one of its private credit funds ahead of a looming redemption deadline.\n\nThe transaction underscores the growing entanglement between alternative asset managers, institutional pension capital, and affiliated insurance platforms in the rapidly expanding private credit market. Blue Owl, which has built itself into one of the sector's most prominent players, turned to a mix of external and internal buyers to liquidate the loan book, a maneuver that highlights both the depth of institutional demand for private debt and the potential conflicts that arise when firms sell assets to entities they control.\n\nThe sale to Blue Owl's own insurance asset manager is likely to draw particular scrutiny. Asset managers that also operate or advise insurance affiliates have faced mounting regulatory attention over concerns that captive insurers can serve as convenient warehouses for assets that might otherwise be difficult to move. Regulators and ratings agencies have increasingly questioned whether such arrangements adequately protect policyholders and whether pricing reflects true arm's-length terms.\n\nFor the pension funds involved, the deal represents an opportunity to acquire seasoned private credit assets at a time when many institutional allocators are actively increasing their exposure to the asset class. Pension systems across North America have been shifting portfolios toward private markets in search of higher yields and diversification away from publicly traded fixed income, a trend that has accelerated as private credit has expanded to fill lending gaps left by traditional banks.\n\nBlue Owl Capital, publicly traded on the New York Stock Exchange, has amassed significant scale in direct lending and other alternative credit strategies. The firm's ability to orchestrate a $1.4 billion secondary sale to meet investor redemptions suggests both robust demand for its loan assets and the operational complexity of managing liquidity in funds that invest in inherently illiquid instruments. The transaction serves as a case study in how private credit managers navigate the tension between long-duration assets and investors' periodic need for cash.",
      "category": "business",
      "importance": 6,
      "tags": [
        "Blue Owl Capital",
        "private credit",
        "pension funds",
        "insurance",
        "alternative assets",
        "loan sales"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1641914568078-3b6e1aa2d987?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxNHx8Qmx1ZSUyME93bCUyMENhcGl0YWwlMjBwcml2YXRlJTIwY3JlZGl0fGVufDB8MHx8fDE3NzE2Mjk0ODd8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-20/blue-owl-sold-private-loans-to-pension-giants-and-own-insurer",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T23:47:57.484Z"
    },
    {
      "id": "ps-1771630382999-1l2h",
      "slug": "teneo-warns-scotus-tariff-ruling-adds-new-layer-of-market-un",
      "headline": "Teneo Warns SCOTUS Tariff Ruling Adds New Layer of Market Uncertainty",
      "subheadline": "Political risk adviser says Supreme Court decision compounds existing corporate damage from trade policy",
      "body": "A recent Supreme Court ruling on tariffs has injected fresh uncertainty into markets already grappling with the financial toll of trade restrictions on corporate America, according to a senior political risk adviser at Teneo.\n\nKevin Kajiwara, co-president of political risk advisory at the consulting firm, said in a Bloomberg Television appearance on Thursday that while tariffs have already left visible marks on corporate income statements and balance sheets, the high court's decision introduces an additional dimension of unpredictability for businesses and investors. Speaking on Bloomberg's \"The Close\" with Romaine Bostick and Katie Greifeld, Kajiwara outlined how the legal landscape surrounding trade policy is now compounding the economic pressures companies have been absorbing for months.\n\nThe comments underscore a growing concern among risk consultants and market strategists that U.S. trade policy has become a multi-front challenge for corporations. Beyond the direct cost increases from tariffs — which have forced companies to raise prices, absorb margin compression, or restructure supply chains — firms must now contend with evolving judicial interpretations of executive trade authority. The Supreme Court's involvement signals that the constitutional boundaries of tariff powers remain a live and contested legal question, one with potentially far-reaching consequences for how aggressively the executive branch can deploy trade barriers.\n\nKajiwara also flagged geopolitical tensions surrounding Iran as a concurrent risk factor for markets. The convergence of trade uncertainty with Middle Eastern security concerns creates a complex backdrop for corporate planning and investor positioning heading into the spring. Teneo, which advises major multinational companies on navigating political and regulatory risks, has seen demand for its services rise as firms struggle to scenario-plan amid overlapping policy and geopolitical disruptions.\n\nFor market participants, the message is sobering: tariff risk is no longer confined to spreadsheet calculations of duty rates and sourcing costs. It now encompasses constitutional law, judicial unpredictability, and the potential for abrupt shifts in the legal framework governing international trade — all layered atop a geopolitical environment that shows few signs of stabilizing.",
      "category": "business",
      "importance": 6,
      "tags": [
        "tariffs",
        "Supreme Court",
        "Teneo",
        "political risk",
        "trade policy",
        "Iran",
        "corporate earnings"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1704545576746-e282fd02f2ad?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxfHx0YXJpZmZzJTIwU3VwcmVtZSUyMENvdXJ0fGVufDB8MHx8fDE3NzE2MTUxMTN8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/videos/2026-02-20/teneo-s-kajiwara-on-scotus-tariff-impact-iran-concerns-video",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T23:33:02.999Z"
    },
    {
      "id": "ps-1771629487912-lp7y",
      "slug": "blue-owl-capital-offloads-1-4b-loan-portfolio-to-pensions-ow",
      "headline": "Blue Owl Capital Offloads $1.4B Loan Portfolio to Pensions, Own Insurance Arm",
      "subheadline": "Private credit giant tapped three major North American pension funds and its in-house insurer to meet investor redemption deadline",
      "body": "Blue Owl Capital arranged the sale of a $1.4 billion portfolio of loans from one of its private credit funds to four buyers, including three of North America's largest pension funds and the firm's own insurance asset management division, according to Bloomberg.\n\nThe deal was driven by an approaching deadline that required Blue Owl to return capital to investors in the fund. By assembling a group of institutional buyers willing to absorb the sizable loan book, the alternative asset manager was able to generate the liquidity needed to meet its payout obligations. The involvement of Blue Owl's own insurance arm in the transaction, however, is likely to draw scrutiny from market observers who monitor potential conflicts of interest when firms act on both sides of a deal.\n\nThe transaction underscores a growing dynamic in private credit markets, where managers increasingly rely on large institutional buyers — particularly pension funds and insurance companies hungry for yield — to provide secondary liquidity for portfolios that were originally designed to be held to maturity. As private credit has ballooned into a multi-trillion-dollar asset class, the infrastructure for trading and recycling these illiquid positions has become a critical piece of the market's plumbing.\n\nBlue Owl, which manages more than $200 billion in assets across private credit, GP stakes, and real estate strategies, has built one of the largest direct lending platforms in the industry. The New York-based firm has expanded aggressively into insurance asset management, a channel that has become a major source of permanent capital for alternative managers. That Blue Owl turned partly to its own insurance unit to absorb loans from a separate fund highlights how vertically integrated many of these platforms have become.\n\nFor the pension funds involved, the acquisition represents an opportunity to gain exposure to seasoned private credit assets at potentially attractive terms, bypassing the typical blind-pool commitment structure. The identities of the three pension buyers were not disclosed. The deal also reflects the broader trend of Canadian and American public pension systems allocating increasing shares of their portfolios to private debt as they seek returns above what public fixed-income markets currently offer.",
      "category": "business",
      "importance": 6,
      "tags": [
        "Blue Owl Capital",
        "private credit",
        "pension funds",
        "loan portfolio",
        "alternative assets",
        "insurance asset management"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1606904022510-cb7a4a492173?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxNnx8Qmx1ZSUyME93bCUyMENhcGl0YWwlMjBwcml2YXRlJTIwY3JlZGl0fGVufDB8MHx8fDE3NzE2Mjk0ODd8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/videos/2026-02-20/blue-owl-sold-loans-to-pensions-own-insurance-arm-video",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T23:18:07.912Z"
    },
    {
      "id": "ps-1771628587025-cyz7",
      "slug": "weinstein-s-saba-cox-launch-tender-offers-for-blue-owl-bdc-s",
      "headline": "Weinstein's Saba, Cox Launch Tender Offers for Blue Owl BDC Shares",
      "subheadline": "Activist investor moves on Blue Owl's business development companies amid growing private credit market concerns",
      "body": "Activist investor Boaz Weinstein's Saba Capital Management, along with Cox, has launched tender offers for shares in Blue Owl Capital's business development companies, seizing on a turbulent stretch for the lender and mounting anxiety over risks accumulating in the $1.8 trillion private credit market.\n\nThe move represents an escalation by Weinstein, who has built a reputation as one of Wall Street's most aggressive activist investors, particularly in the closed-end fund space. Blue Owl Capital, a major player in alternative asset management, operates several BDCs that provide financing to middle-market companies — vehicles that have surged in popularity as private credit has ballooned into one of the fastest-growing corners of finance.\n\nThe tender offers come after what Bloomberg described as a challenging week for Blue Owl, though the specific difficulties were not detailed. The broader context, however, is unmistakable: investors and regulators alike have grown increasingly wary of the rapid expansion of private credit, which has swelled to roughly $1.8 trillion in assets. Critics warn that the sector's explosive growth, fueled by years of institutional capital flooding into alternatives, may be masking credit quality issues that could surface as economic conditions shift.\n\nBDCs, which are publicly traded vehicles that lend to private companies, often trade at discounts to their net asset value — a gap that activist investors like Weinstein have historically targeted. By launching tender offers, Saba and Cox are effectively betting they can acquire shares below intrinsic value, pressuring Blue Owl's management in the process. Weinstein's Saba Capital has been involved in numerous campaigns against closed-end funds and similar structures, frequently pushing for measures to narrow trading discounts.\n\nThe campaign adds another front to the growing tension between alternative asset managers and activist investors who argue that certain fund structures inadequately serve shareholders. For Blue Owl, which has built a significant franchise in private credit and GP stakes investing, the tender offers could force a public defense of its BDC valuations and governance at a moment when the broader market is already scrutinizing the sector's fundamentals.",
      "category": "business",
      "importance": 6,
      "tags": [
        "Saba Capital",
        "Blue Owl Capital",
        "private credit",
        "BDC",
        "activist investing",
        "Boaz Weinstein"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1664575602276-acd073f104c1?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw0fHxidXNpbmVzc3xlbnwwfDB8fHwxNzcxNjI4NTg2fDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-20/saba-and-cox-announce-tender-offers-for-blue-owl-bdc-shares",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T23:03:07.025Z"
    },
    {
      "id": "ps-1771627625265-m04r",
      "slug": "nasa-sets-march-6-launch-for-artemis-ii-humanity-s-farthest-",
      "headline": "NASA Sets March 6 Launch for Artemis II, Humanity's Farthest Space Voyage",
      "subheadline": "Four astronauts will loop around the far side of the Moon in a 10-day mission, the first crewed lunar flight in over 50 years",
      "body": "NASA has confirmed a target launch date of March 6 for Artemis II, the mission that will send four astronauts around the Moon and back — marking humanity's deepest venture into space and the first crewed lunar voyage since the Apollo era ended in 1972.\n\nThe agency locked in the date after completing a successful \"wet dress rehearsal\" at Kennedy Space Center in Florida on Thursday, a critical test in which the 98-meter-tall Space Launch System (SLS) rocket was fully loaded with propellant and taken through its countdown sequence. The milestone came on the team's second attempt; an earlier rehearsal in early February was cut short by a hydrogen fuel leak at the launch pad. NASA's Lori Glaze told a Friday press conference that seal and filter issues had been resolved, and that the rocket was fueled within the planned timeline. The four-person crew — Americans Reid Wiseman, Victor Glover, and Christina Koch, joined by Canadian astronaut Jeremy Hansen — entered quarantine on Friday.\n\nThe 10-day mission profile calls for the crew to spend their first day orbiting Earth inside the Orion capsule, a cabin roughly the size of a minibus mounted atop the SLS. If systems check out, they will fire toward the Moon on a four-day transit, swinging around its far side at an altitude of 6,500 to 9,500 kilometers above the lunar surface. The astronauts will have several hours to study and photograph the Moon before beginning a four-day return trip, culminating in a splashdown in the Pacific Ocean. The SLS has flown only once before, carrying an uncrewed Orion capsule on the Artemis I test flight in November 2022.\n\nA successful Artemis II would set the stage for Artemis III, the mission intended to put boots on the lunar surface for the first time in more than half a century. NASA has targeted 2028 for that landing, though the timeline remains ambitious. SpaceX holds the contract to build the Artemis III lunar lander using a variant of its Starship vehicle, but persistent delays have prompted NASA to request an accelerated development plan. The agency has also asked Blue Origin, Jeff Bezos's space company, to propose a faster path to the Moon as a potential alternative.\n\nThe urgency is partly geopolitical. China has announced plans for a crewed lunar landing by 2030 and has demonstrated steady progress toward that goal. Both the United States and China are eyeing the Moon's south pole as the prime location for future bases, creating a new era of space competition that lends strategic weight to every launch window NASA can meet.",
      "category": "science",
      "importance": 9,
      "tags": [
        "NASA",
        "Artemis II",
        "Moon mission",
        "SLS",
        "space exploration",
        "SpaceX",
        "lunar landing"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/041d/live/dd9135c0-0e80-11f1-801d-ed3cff6bf876.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/c86y1g6wde3o?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T22:47:05.265Z"
    },
    {
      "id": "ps-1771626777547-t2v2",
      "slug": "russian-fuel-tanker-headed-for-cuba-tests-trump-sanctions-re",
      "headline": "Russian Fuel Tanker Headed for Cuba Tests Trump Sanctions Regime",
      "subheadline": "The shipment challenges U.S. blockade enforcement as Cuba's energy crisis deepens and geopolitical tensions mount",
      "body": "A tanker believed to be loaded with Russian fuel is currently en route to Cuba, setting up a direct confrontation with the Trump administration's sanctions apparatus as the Caribbean island nation grapples with a worsening energy emergency.\n\nThe vessel's voyage, first reported by Bloomberg on February 20, represents one of the most visible tests yet of Washington's willingness and ability to enforce its economic restrictions on both Cuba and Russia simultaneously. The Trump administration has pursued an aggressive sanctions posture toward Havana, building on measures tightened during the president's first term and further expanded since his return to office. Russia, meanwhile, remains subject to sweeping U.S. financial and trade penalties stemming from its invasion of Ukraine.\n\nCuba has been mired in a severe energy crisis that has left millions of residents enduring rolling blackouts, fuel shortages, and collapsing infrastructure. The island's antiquated power grid, heavily dependent on imported petroleum, has struggled to meet even basic demand. Russia has historically been a key energy supplier to Cuba, stepping into a role once filled by Venezuela, whose own economic troubles have curtailed its ability to deliver subsidized oil to allied nations.\n\nThe shipment poses a delicate enforcement question for Washington. Intercepting or deterring the tanker would signal robust sanctions enforcement but could escalate tensions with Moscow at a moment when U.S.-Russia relations are already under intense scrutiny. Allowing the delivery to proceed, however, risks undermining the credibility of the broader sanctions framework and inviting further attempts to circumvent American restrictions. The scenario also highlights the persistent challenge of policing global maritime trade routes, where sanctions evasion tactics — including ship-to-ship transfers, flag changes, and opaque ownership structures — have become increasingly sophisticated.\n\nThe situation underscores the broader geopolitical chess match playing out in the Western Hemisphere, where Russia has maintained strategic relationships with Cuba, Venezuela, and Nicaragua even as the United States has sought to isolate those governments economically and diplomatically. How the Trump administration responds to this particular shipment could set a precedent for future enforcement actions and signal its priorities in balancing Cuba policy against its wider approach to Russia.",
      "category": "business",
      "importance": 6,
      "tags": [
        "Cuba",
        "Russia",
        "sanctions",
        "Trump",
        "energy crisis",
        "oil tanker",
        "geopolitics"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1696148899432-13ff6c14b8e2?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw4fHxydXNzaWFuJTIwZnVlbCUyMHRhbmtlcnxlbnwwfDB8fHwxNzcxNjI2Nzc3fDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-20/cuba-bound-tanker-carrying-russian-fuels-to-test-trump-blockade",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T22:32:57.547Z"
    },
    {
      "id": "ps-1771625889964-4e8j",
      "slug": "supreme-court-tariff-ruling-sparks-rally-in-emerging-market-",
      "headline": "Supreme Court Tariff Ruling Sparks Rally in Emerging-Market Assets",
      "subheadline": "BlackRock's flagship emerging-market ETF surges to all-time high as currencies recover weekly losses following landmark decision",
      "body": "Emerging-market stocks, currencies, and bonds rallied sharply after the U.S. Supreme Court struck down President Donald Trump's sweeping global tariffs, removing one of the most significant headwinds that had weighed on developing economies for months.\n\nThe landmark ruling sent a wave of relief through global markets, with emerging-market currencies erasing their weekly losses in a single session. BlackRock's flagship emerging-market exchange-traded fund surged to a record high as investors rapidly repriced the outlook for trade-dependent economies that had been most vulnerable to the tariff regime. The decision effectively invalidated the broad-based import duties that Trump had imposed, which had disrupted supply chains and dampened growth prospects across Asia, Latin America, and other developing regions.\n\nThe court's intervention marks a pivotal turning point for emerging markets, which had been caught in the crossfire of escalating trade tensions. Nations that rely heavily on exports to the United States — including major manufacturing hubs in Southeast Asia and commodity producers in Latin America — stand to benefit most directly from the removal of tariff barriers. The ruling also alleviates pressure on central banks in developing countries that had been forced to defend their currencies against dollar strength driven in part by trade uncertainty.\n\nThe rally in the BlackRock ETF to all-time highs signals that institutional investors are moving quickly to rebuild positions in emerging-market assets. Portfolio flows into developing economies had slowed significantly during the tariff regime, as fund managers weighed the risks of holding assets in countries facing potential export disruptions. With that overhang now lifted by the Supreme Court, strategists expect a period of sustained inflows as valuations in many emerging markets remain attractive relative to developed-market peers.\n\nWhile the immediate market reaction has been overwhelmingly positive, analysts caution that the broader policy landscape remains uncertain. The Trump administration could pursue alternative trade measures that fall within constitutional boundaries, and geopolitical tensions — including building concerns over Iran — continue to pose risks to emerging-market stability. Still, for now, the court's decision has delivered the clearest positive catalyst for developing economies in months, resetting expectations for growth, trade, and capital flows across the emerging world.",
      "category": "markets",
      "importance": 8,
      "tags": [
        "emerging-markets",
        "Supreme Court",
        "tariffs",
        "BlackRock",
        "ETF",
        "trade-policy",
        "currencies"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1748267887709-25aaa0c30115?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxNXx8ZW1lcmdpbmctbWFya2V0cyUyMFN1cHJlbWUlMjBDb3VydHxlbnwwfDB8fHwxNzcxNjI0MDkzfDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-20/em-stocks-currencies-decline-as-iran-tensions-build-oil-spikes",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T22:18:09.964Z"
    },
    {
      "id": "ps-1771625904613-gjny",
      "slug": "purpose-built-ai-catches-92-of-defi-exploits-dwarfing-generi",
      "headline": "Purpose-Built AI Catches 92% of DeFi Exploits, Dwarfing Generic Models",
      "subheadline": "New open-source benchmark reveals domain-specific AI detected vulnerabilities worth $96.8M versus just $7.5M for a standard GPT-5.1 agent",
      "body": "A specialized artificial intelligence security system identified exploitable vulnerabilities in 92 percent of real-world decentralized finance smart contracts that had already been hacked, dramatically outperforming a general-purpose AI coding agent that caught only 34 percent, according to new research published Thursday by AI security firm Cecuro.\n\nThe study tested both systems against a benchmark of 90 smart contracts exploited between October 2024 and early 2026, collectively representing $228 million in verified losses. The purpose-built agent flagged flaws tied to $96.8 million in exploit value, while a baseline agent built on OpenAI's GPT-5.1 managed to cover just $7.5 million. Critically, both systems ran on the same underlying frontier model — the performance gap stemmed entirely from domain-specific methodology, structured audit phases, and DeFi-focused security heuristics layered on top by Cecuro's team. Several of the exploited contracts in the dataset had previously passed professional security audits before being drained.\n\nThe findings land at a particularly fraught moment for crypto security. Separate research from Anthropic and OpenAI has demonstrated that AI agents can now execute end-to-end exploits on most known vulnerable smart contracts at an average cost of roughly $1.22 per attempt, with offensive exploit capability reportedly doubling every 1.3 months. North Korean hacking operations have already begun integrating AI tools to automate and scale their attacks, widening what researchers describe as a growing asymmetry between offensive and defensive AI capabilities in the crypto ecosystem.\n\nCecuro has open-sourced its benchmark dataset, evaluation framework, and baseline agent on GitHub, but the firm declined to release its full specialized security agent, citing concerns that the tooling could be repurposed by attackers. The company argues that many DeFi teams continue to rely on general-purpose AI tools or periodic one-off audits — an approach the benchmark data suggests is inadequate for catching the high-value, complex vulnerabilities that sophisticated attackers target.\n\nThe research underscores a broader tension in the race between AI-powered offense and defense in decentralized finance. As the cost and technical barrier to launching AI-driven exploits continues to plummet, the results suggest that generic AI models alone are insufficient for meaningful smart contract security — and that the application layer built around a model may matter far more than the model itself.",
      "category": "tech",
      "importance": 6,
      "tags": [
        "artificial intelligence",
        "DeFi",
        "cybersecurity",
        "smart contracts",
        "crypto exploits"
      ],
      "imageUrl": "https://cdn.sanity.io/images/s3y3vcno/production/56a4c15b5193f534a64f932d3e14fdd33fafac55-1919x1080.jpg?auto=format&amp;w=960&amp;h=540&amp;crop=focalpoint&amp;fit=clip&amp;q=75&amp;fm=jpg",
      "sourceUrl": "https://www.coindesk.com/business/2026/02/20/specialized-ai-detects-92-of-real-world-defi-exploits",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T22:18:24.614Z"
    },
    {
      "id": "ps-1771624987782-wgmm",
      "slug": "canadian-stocks-rally-after-u-s-supreme-court-strikes-down-t",
      "headline": "Canadian Stocks Rally After U.S. Supreme Court Strikes Down Trump Tariffs",
      "subheadline": "Canada's benchmark index climbs as the high court's ruling removes a major overhang on North American trade",
      "body": "Canadian equities surged on Thursday after the United States Supreme Court struck down President Donald Trump's sweeping global tariffs, removing one of the most significant sources of uncertainty that had weighed on cross-border commerce for months.\n\nCanada's benchmark stock index posted broad-based gains as investors recalibrated their outlook for the country's export-heavy economy. The ruling effectively dismantles a tariff regime that had disrupted supply chains and dampened business confidence across North America, particularly in Canada, where roughly three-quarters of exports are destined for the U.S. market. Sectors with heavy American exposure — including energy, manufacturing, and materials — were among the biggest beneficiaries of the post-ruling rally.\n\nThe Supreme Court's decision marks a pivotal moment in the legal battle over Trump's trade agenda, which had drawn challenges from multiple trading partners and domestic industry groups arguing the tariffs exceeded presidential authority. While the full scope of the ruling and its implications for existing trade agreements remain subject to legal interpretation, markets moved swiftly to price in a more favorable environment for Canadian exporters. The Canadian dollar also strengthened against its U.S. counterpart in the wake of the news.\n\nThe tariffs had been a persistent drag on Canadian markets since their implementation, prompting retaliatory measures from Ottawa and fueling fears of a broader economic slowdown. Canadian business leaders and policymakers had repeatedly warned that prolonged trade barriers risked undermining the deeply integrated North American economy, where goods and components routinely cross the border multiple times during production.\n\nAnalysts cautioned that volatility could persist as the legal and political fallout from the ruling unfolds. The Trump administration could pursue alternative trade measures or seek legislative avenues to reimpose duties, leaving some uncertainty intact. Still, for now, the court's decision has provided a significant tailwind for Canadian equities and a measure of relief to businesses on both sides of the border that had been navigating an unpredictable trade landscape.",
      "category": "markets",
      "importance": 9,
      "tags": [
        "Canadian stocks",
        "Trump tariffs",
        "Supreme Court",
        "trade policy",
        "North American trade"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1718332521992-4a407b3b23b0?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwyfHxDYW5hZGlhbiUyMHN0b2NrcyUyMFRydW1wJTIwdGFyaWZmc3xlbnwwfDB8fHwxNzcxNjI0OTg3fDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-20/canadian-stocks-whipsaw-after-trump-tariffs-struck-down",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T22:03:07.782Z"
    },
    {
      "id": "ps-1771623188968-1t6g",
      "slug": "supreme-court-strikes-down-trump-s-global-tariffs-in-6-3-rul",
      "headline": "Supreme Court Strikes Down Trump's Global Tariffs in 6-3 Ruling",
      "subheadline": "Chief Justice Roberts writes majority opinion finding president exceeded his authority; markets rally on the decision",
      "body": "The United States Supreme Court on Thursday declared President Donald Trump's sweeping global tariffs unconstitutional, ruling 6-3 that the president overstepped his executive authority in imposing the trade levies. Chief Justice John Roberts authored the majority opinion in what stands as one of the most consequential checks on presidential trade power in decades.\n\nThe decision immediately reverberated through financial markets. U.S. equities and Treasury yields jumped on the news, while the dollar weakened — a signal that investors view the removal of tariffs as a net positive for the domestic economy and a potential easing of inflationary pressures that had built up since the duties were first imposed. The tariffs, which targeted imports from countries around the world, had been a cornerstone of Trump's economic agenda and a persistent source of friction with trading partners.\n\nPresident Trump responded sharply, calling the ruling a \"disgrace\" — language that underscores the political stakes of the decision and sets the stage for a potential confrontation between the executive branch and the judiciary over the limits of trade authority. The ruling effectively curtails the president's ability to unilaterally impose broad-based tariffs without explicit congressional authorization, a question that legal scholars and trade policy experts have debated since the tariffs were first enacted.\n\nThe 6-3 split suggests the court's decision crossed ideological lines, with Roberts — a George W. Bush appointee — leading a coalition that included justices from both conservative and liberal wings of the bench. The ruling carries significant implications not only for current trade policy but for the broader balance of power between Congress and the White House on economic matters. Constitutional experts say the opinion could reshape how future administrations approach tariff authority under statutes like the International Emergency Economic Powers Act and the Trade Expansion Act of 1962.\n\nFor businesses and consumers, the practical effect may be substantial. The global tariffs had raised costs across a wide range of imported goods, contributing to elevated prices and supply chain adjustments. Their removal could provide relief to industries from manufacturing to retail, though the timeline for unwinding the tariffs and any potential legislative response from Congress remains unclear. The White House has not yet indicated whether it will seek alternative legal avenues to reimpose the duties.",
      "category": "breaking",
      "importance": 10,
      "tags": [
        "Supreme Court",
        "tariffs",
        "Trump",
        "trade policy",
        "constitutional law",
        "markets"
      ],
      "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iOhKLBvpGeck/v3/-1x-1.webp",
      "sourceUrl": "https://www.bloomberg.com/news/videos/2026-02-20/us-supreme-court-strikes-down-trump-s-global-tariffs-video",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T21:33:08.968Z"
    },
    {
      "id": "ps-1771618705921-im22",
      "slug": "trump-s-tariff-regime-reshapes-global-trade-as-costs-mount",
      "headline": "Trump's Tariff Regime Reshapes Global Trade as Costs Mount",
      "subheadline": "A sprawling web of import levies across sectors and countries is altering supply chains and raising prices for businesses and consumers",
      "body": "President Donald Trump's expansive tariff agenda has grown into one of the most aggressive trade policy campaigns in modern American history, imposing levies across a broad swath of industries and trading partners that are rippling through the global economy.\n\nThe administration has enacted tariffs targeting steel, aluminum, automobiles, and a wide range of Chinese goods, among other categories, creating a complex and shifting landscape that businesses must navigate in real time. The cumulative effect has pushed the effective U.S. tariff rate to levels not seen in decades, according to trade economists, with some estimates suggesting it now exceeds rates that prevailed before the mid-20th century liberalization of global commerce. China has faced some of the steepest levies, with tariffs on certain goods reaching well above 100 percent after successive rounds of escalation.\n\nThe economic consequences are increasingly tangible. Importers face higher costs that many are passing along to consumers, contributing to upward pressure on prices for everything from electronics to household goods. Manufacturers that depend on imported components have been forced to reconfigure supply chains, in some cases shifting sourcing to countries not subject to the highest tariffs — a phenomenon economists call trade diversion. Retaliatory measures from trading partners, particularly China, Canada, and the European Union, have meanwhile squeezed American exporters, especially in agriculture.\n\nThe administration has argued the tariffs serve multiple strategic objectives: reducing the U.S. trade deficit, reviving domestic manufacturing, and providing leverage in bilateral negotiations. Some sectors, notably steel production, have seen modest employment gains. But broader economic assessments have been more cautious. Multiple analyses suggest the tariffs function as a tax on American consumers and businesses, with the costs outweighing the targeted benefits. The Federal Reserve and private forecasters have flagged tariff-related uncertainty as a drag on business investment.\n\nAs the tariff regime continues to evolve — with pauses, exemptions, and new levies announced at irregular intervals — the lack of predictability has become a challenge in its own right. Companies report difficulty planning capital expenditures when the rules of international commerce can shift with a single presidential announcement. The ultimate economic toll will depend on whether the tariffs prove to be temporary negotiating tools or permanent features of U.S. trade policy, a question that remains unresolved as the administration presses forward on multiple fronts simultaneously.",
      "category": "business",
      "importance": 7,
      "tags": [
        "tariffs",
        "trade policy",
        "Trump administration",
        "global trade",
        "supply chains",
        "U.S. economy"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1678716193852-e6ca47a46b4f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxNnx8dGFyaWZmcyUyMHRyYWRlJTIwcG9saWN5fGVufDB8MHx8fDE3NzE2MTg3MDV8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/graphics/trump-tariffs-tracker/",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T20:18:25.921Z"
    },
    {
      "id": "ps-1771617810051-wnxd",
      "slug": "trump-announces-10-global-tariff-hours-after-supreme-court-s",
      "headline": "Trump Announces 10% Global Tariff Hours After Supreme Court Strikes Down Previous Levies",
      "subheadline": "President invokes Section 122 authority to reimpose sweeping trade barriers, declares all national security tariffs remain in effect",
      "body": "President Donald Trump moved swiftly on Friday to reimpose broad trade barriers on imports worldwide, announcing a 10% global tariff just hours after the U.S. Supreme Court struck down his administration's earlier tariff regime as unconstitutional.\n\nSpeaking at a White House press conference, Trump said the new levy — which would be layered on top of existing duties — would be authorized under Section 122 of the Trade Act of 1974, a rarely invoked provision that grants the president temporary authority to impose tariffs of up to 15% for 150 days to address large and serious balance-of-payments deficits. The president simultaneously declared that all national security tariffs imposed under Section 232, as well as existing Section 301 tariffs targeting specific countries and industries, remain in full force and effect.\n\nThe announcement represents a dramatic legal pivot by the administration, which had relied on broader executive authority to justify its earlier global tariff program before the Supreme Court invalidated that approach. By shifting to Section 122, Trump is effectively daring opponents to mount a fresh legal challenge while maintaining economic pressure on trading partners. Legal experts have noted, however, that Section 122 imposes significant constraints — including a cap on tariff rates and a built-in expiration — that could limit the administration's ability to sustain the policy long-term without congressional action.\n\nThe Supreme Court's ruling earlier Friday marked one of the most significant checks on presidential trade authority in decades, finding that the administration had exceeded its statutory power in levying sweeping tariffs without explicit congressional authorization. Markets had initially rallied on the decision, but gains were quickly pared as Trump signaled his intent to find alternative legal pathways to maintain the tariffs. The rapid response underscores the administration's determination to preserve its aggressive trade posture as a cornerstone of economic policy.\n\nThe reimposition of a 10% blanket tariff is likely to reignite tensions with major trading partners, including the European Union, China, and Japan, all of which had signaled relief at the court's ruling. Business groups and importers, who had lobbied aggressively against the earlier tariff regime, now face renewed uncertainty over supply chains and input costs. With the Section 122 clock ticking from the moment of imposition, attention will turn quickly to whether Congress moves to codify or block the tariffs — and whether a second round of legal challenges can reach the courts before the duties take full economic effect.",
      "category": "breaking",
      "importance": 10,
      "tags": [
        "tariffs",
        "Supreme Court",
        "trade policy",
        "Trump",
        "Section 122",
        "global trade"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1640537125136-84808f980658?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw4fHx0YXJpZmZzJTIwU3VwcmVtZSUyMENvdXJ0fGVufDB8MHx8fDE3NzE2MTUxMTN8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/videos/2026-02-20/trump-to-impose-10-global-tariff-after-scotus-ruling-video",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T20:03:30.051Z"
    },
    {
      "id": "ps-1771614223694-n35u",
      "slug": "dubai-opens-secondary-market-for-tokenized-real-estate-on-xr",
      "headline": "Dubai Opens Secondary Market for Tokenized Real Estate on XRP Ledger",
      "subheadline": "The $5 million pilot marks phase two of Dubai's plan to tokenize $16 billion in property by 2033",
      "body": "Dubai's government real estate authority has launched a secondary trading market for blockchain-based property tokens, advancing one of the most ambitious tokenization experiments in the world. The Dubai Land Department (DLD) and infrastructure partner Ctrl Alt announced on Friday that roughly 7.8 million tokens representing fractional ownership in ten Dubai properties — valued at over $5 million — are now eligible for resale on a controlled trading platform.\n\nThe tokens, built on Ripple's XRP Ledger and secured through Ripple Custody, are directly backed by title deeds and synced with Dubai's official land registry. A compliance layer using so-called Asset-Referenced Virtual Assets (ARVAs) governs who can trade and under what conditions, ensuring that every transaction is reflected in the emirate's property records. The setup represents a deliberate effort to bridge decentralized blockchain infrastructure with traditional real estate law.\n\nThe secondary market launch constitutes the second phase of a pilot that began when the DLD partnered with Ctrl Alt and Prypco to tokenize property deeds on the XRP Ledger. The broader ambition is sweeping: Dubai aims to tokenize 7% of its real estate market — approximately $16 billion worth — by 2033. If successful, the initiative could position the city-state as the global leader in blockchain-based property transactions, where ownership transfers that currently take days or weeks could settle in minutes.\n\nThe project arrives at a moment of growing momentum for real-world asset tokenization globally. A Deloitte report published last year projected that $4 trillion in real estate will be tokenized by 2035, implying annual growth of roughly 27%. Yet significant obstacles remain. An EY analysis has noted that uneven regulation across jurisdictions continues to limit adoption, while thin secondary market liquidity — the very problem Dubai's pilot seeks to address — constrains investor interest. In the United States, real estate billionaire Barry Sternlicht has publicly expressed interest in tokenization but cited regulatory barriers as a major impediment.\n\nDubai's controlled trading environment is designed to test market infrastructure, investor protections, and legal alignment before any broader rollout. While $5 million in tradable property tokens remains a tiny fraction of the emirate's roughly $229 billion real estate market, the pilot's significance lies in what it is proving: that government registries and blockchain settlement can operate in tandem. Whether that model scales to $16 billion will depend on liquidity depth, regulatory durability, and whether investors trust tokens as much as traditional title deeds.",
      "category": "markets",
      "importance": 6,
      "tags": [
        "tokenization",
        "Dubai",
        "real estate",
        "XRP Ledger",
        "Ripple",
        "blockchain",
        "real-world assets"
      ],
      "imageUrl": "https://cdn.sanity.io/images/s3y3vcno/production/8120f19a9e4ab07a954184d8a19c7b3decd072de-1920x1080.png?auto=format&amp;w=960&amp;h=540&amp;crop=focalpoint&amp;fit=clip&amp;q=75&amp;fm=jpg",
      "sourceUrl": "https://www.coindesk.com/business/2026/02/20/dubai-unveils-secondary-market-for-usd5-million-tokenized-real-estate-via-xrp-ledger",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T19:03:43.694Z"
    },
    {
      "id": "ps-1771613326260-7yhf",
      "slug": "oil-prices-hold-near-six-month-high-amid-trump-s-iran-strike",
      "headline": "Oil Prices Hold Near Six-Month High Amid Trump's Iran Strike Warning",
      "subheadline": "President issues 15-day ultimatum to Tehran over nuclear program as U.S. forces gather in the Middle East",
      "body": "Crude oil prices remained elevated near six-month highs on Thursday after President Donald Trump disclosed he is considering a limited military strike against Iran, injecting fresh geopolitical risk into global energy markets already grappling with tight supply dynamics.\n\nTrump's remarks, in which he warned Tehran it had no more than 15 days to reach an agreement over its nuclear program, came as U.S. military forces were reported gathering in the Middle East. The combination of an explicit ultimatum and visible force posturing sent a clear signal that Washington is prepared to escalate if diplomatic efforts stall. Iran, an OPEC member that produces roughly 3.2 million barrels per day, sits at a critical chokepoint for global oil flows — any disruption to its output or to shipping through the Strait of Hormuz could ripple through markets worldwide.\n\nThe threat alone has been sufficient to buoy prices. Oil traders have been pricing in a growing geopolitical risk premium, reflecting the possibility that even a limited strike could trigger retaliatory actions that disrupt regional production or tanker traffic. The Strait of Hormuz, through which approximately 20% of the world's petroleum passes daily, remains the most watched bottleneck in global energy logistics. Market participants are now closely monitoring diplomatic channels for any indication of whether Tehran will engage in negotiations or dig in ahead of the deadline.\n\nThe standoff adds another layer of complexity to an oil market already shaped by OPEC+ production management, sanctions enforcement, and shifting demand forecasts. Analysts note that sustained elevated prices could compound inflationary pressures in the United States and Europe at a time when central banks are navigating delicate monetary policy paths. For consumers, a prolonged crisis could translate into higher gasoline and heating costs heading into the spring.\n\nWith the 15-day window now ticking, energy markets are likely to remain volatile as traders weigh the probability of a diplomatic resolution against the risk of military action. The coming days will test whether Trump's ultimatum represents a genuine redline or a negotiating tactic designed to force Tehran back to the table.",
      "category": "markets",
      "importance": 8,
      "tags": [
        "oil prices",
        "Iran",
        "Trump",
        "Middle East",
        "geopolitics",
        "crude oil",
        "energy markets"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1656567298829-480f3666addc?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxfHxvaWwlMjBwcmljZXMlMjBJcmFufGVufDB8MHx8fDE3NzE2MTMzMjZ8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-19/latest-oil-market-news-and-analysis-for-feb-20",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T18:48:46.260Z"
    },
    {
      "id": "ps-1771611447873-1psy",
      "slug": "uk-man-faces-48-charges-for-drugging-wife-recruiting-men-to-",
      "headline": "UK Man Faces 48 Charges for Drugging Wife, Recruiting Men to Assault Her",
      "subheadline": "Twelve co-defendants also charged in case spanning decades; trial set for September in Manchester",
      "body": "A man in his sixties from Stockport, Greater Manchester, has been charged with 48 criminal counts for allegedly drugging his wife into unconsciousness and facilitating her sexual assault by multiple men over a period stretching back to the early 2000s.\n\nThe husband, who cannot be named for legal reasons, faces charges including conspiracy to rape, sexual assault by penetration, and conspiracy to administer a substance with intent to commit a sexual offence. Twelve other men, ranging in age from 28 to 73, are co-defendants in the case. All 13 appeared at Manchester Minshull Street Crown Court, where seven — including the husband — entered not guilty pleas to all charges. Five defendants were not asked to enter pleas at this stage. One man pleaded guilty to conspiracy to commit rape, conspiracy to administer a substance with intent, conspiracy to commit sexual assault by penetration, and one count of committing sexual assault by penetration.\n\nMembers of the woman's family were present in the public gallery during the hearing. The allegations describe a prolonged pattern of abuse in which the victim was rendered unconscious before being subjected to sexual violence by her husband and men he allegedly recruited. The case bears striking similarities to the high-profile French trial of Dominique Pelicot, who was convicted in December 2024 of drugging his wife Gisèle and inviting dozens of strangers to rape her over nearly a decade.\n\nA further hearing is scheduled for March, with a full trial set to begin on September 1. The proceedings are expected to last approximately 12 weeks, reflecting the breadth and complexity of the charges. Greater Manchester Police are leading the investigation.\n\nThe case underscores ongoing concerns about drug-facilitated sexual violence within intimate relationships — crimes that experts say remain significantly underreported due to victims being unaware of the abuse while it occurs. Legal observers note that the scale of the alleged conspiracy, involving more than a dozen defendants over two decades, makes it one of the most significant cases of its kind to come before UK courts.",
      "category": "breaking",
      "importance": 8,
      "tags": [
        "sexual assault",
        "UK crime",
        "Manchester",
        "drug-facilitated abuse",
        "criminal trial"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/3f1a/live/dcd53690-0e71-11f1-9acc-6bf6c7adf476.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/cqxde27ep5qo?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T18:17:27.873Z"
    },
    {
      "id": "ps-1771611507034-hfos",
      "slug": "trade-linked-stocks-surge-after-supreme-court-strikes-down-t",
      "headline": "Trade-Linked Stocks Surge After Supreme Court Strikes Down Tariffs",
      "subheadline": "Retailers, industrials, and automakers rally sharply as high court rules against Trump's sweeping global trade levies",
      "body": "Shares of trade-sensitive companies across the retail, industrial, and automotive sectors jumped sharply on Friday after the U.S. Supreme Court struck down President Donald Trump's sweeping global tariffs, removing a major overhang that had weighed on corporate earnings outlooks and supply chain planning for months.\n\nThe ruling, which invalidated the broad tariff regime Trump had imposed on imports from countries around the world, sent an immediate jolt through equity markets. Retailers — many of which rely heavily on imported consumer goods — were among the biggest beneficiaries, alongside industrial manufacturers and automakers whose complex global supply chains had been disrupted and made more costly by the levies. The decision effectively unwound one of the most consequential trade policy experiments in modern American history, restoring a degree of certainty to businesses that had struggled to price in the unpredictable tariff landscape.\n\nThe Supreme Court's intervention marks a dramatic check on executive trade authority and is likely to reshape the legal and political boundaries of presidential power over commerce. While the specifics of the court's reasoning were not immediately detailed, the market's reaction suggested investors had been pricing in at least some probability that the tariffs would remain in place. The swift rally indicated significant pent-up demand for exposure to trade-dependent sectors that had been under pressure.\n\nFor retailers, the ruling could translate into lower input costs and improved margins in coming quarters, particularly for companies that source heavily from Asia. Automakers, which had faced the dual burden of higher component costs and retaliatory measures from trading partners, stand to benefit from both reduced expenses and potentially reopened export markets. Industrial firms with sprawling international operations may see relief on both the cost and revenue sides of their ledgers.\n\nThe broader implications for U.S. trade policy remain to be seen. The decision could constrain future administrations' ability to impose unilateral tariffs without congressional approval, fundamentally altering the balance of power over trade. Market participants will be closely watching for any legislative response from Capitol Hill, as well as the administration's next moves in the wake of what amounts to a historic judicial rebuke of its economic agenda.",
      "category": "markets",
      "importance": 9,
      "tags": [
        "Supreme Court",
        "tariffs",
        "trade policy",
        "stock market",
        "Trump administration",
        "retailers",
        "automakers"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1648344621504-88ee18f2864a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxNHx8U3VwcmVtZSUyMENvdXJ0JTIwdGFyaWZmc3xlbnwwfDB8fHwxNzcxNjA5NzUzfDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/videos/2026-02-20/trade-linked-stocks-rise-as-court-strikes-down-tariffs-video",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T18:18:27.034Z"
    },
    {
      "id": "ps-1771608680835-p41q",
      "slug": "police-search-former-prince-andrew-s-homes-after-historic-ar",
      "headline": "Police Search Former Prince Andrew's Homes After Historic Arrest",
      "subheadline": "Andrew Mountbatten-Windsor held for nearly 11 hours on suspicion of sharing confidential trade secrets with Jeffrey Epstein",
      "body": "British police conducted extensive searches of two properties linked to Andrew Mountbatten-Windsor on Friday, one day after the former prince was arrested on suspicion of misconduct in public office — marking the first arrest of a member of the royal family in nearly four centuries.\n\nThames Valley Police detained the 66-year-old at 8 a.m. Thursday — his birthday — at his temporary residence on King Charles III's Sandringham estate, holding him for nearly 11 hours at a nearby police station before releasing him. Officers have since completed their search of Wood Farm, his current accommodation on the Sandringham grounds, but continued combing through Royal Lodge, the 30-room Windsor residence from which he was evicted earlier this month after his brother stripped him of all royal titles and honors in October. Unmarked vans, believed to be police vehicles, were observed entering the Royal Lodge grounds throughout Friday morning.\n\nThe investigation centers on allegations that Mountbatten-Windsor passed confidential government information to the late convicted sex offender Jeffrey Epstein while serving as a U.K. trade envoy. Emails released last month by the U.S. Department of Justice appear to show him forwarding official reports on diplomatic visits to Hong Kong, Vietnam, and Singapore — one sent just five minutes after he received it. A separate communication allegedly contained a confidential brief on investment opportunities tied to reconstruction in Afghanistan's Helmand Province. Mountbatten-Windsor has consistently denied any wrongdoing but has not addressed the most recent allegations stemming from the so-called Epstein files.\n\nLegal experts cautioned that the road to any prosecution remains uncertain. Criminal defense lawyer Sean Caulfield noted that misconduct in public office is \"notoriously difficult to prove,\" beginning with the threshold question of whether Andrew's trade envoy role legally constitutes that of a public officer. The Crown Prosecution Service will ultimately decide whether to bring charges, applying a two-stage test weighing the realistic prospect of conviction and the public interest. Mountbatten-Windsor, who remains eighth in line to the throne, has not been charged.\n\nThe arrest represents one of the gravest crises to confront the House of Windsor in its century-long history, drawing comparisons to the abdication of Edward VIII in 1936 and the death of Princess Diana in 1997. It is the first arrest of a royal since King Charles I, whose detention precipitated the English Civil War and his eventual execution. King Charles III issued a brief statement saying \"the law must take its course\" but declined further comment. Separately, police forces across the U.K. are conducting their own investigations into Epstein's ties to Britain, including reviews of flight logs at multiple airports. The trafficking allegations previously made by the late Virginia Giuffre were not part of Thursday's arrest, though they remain under separate review.",
      "category": "breaking",
      "importance": 9,
      "tags": [
        "Prince Andrew",
        "Jeffrey Epstein",
        "British monarchy",
        "misconduct in public office",
        "Thames Valley Police",
        "King Charles III"
      ],
      "imageUrl": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7109x3997+0+540/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fee%2F58%2Fc6fe821d489780cf6485e6cf85aa%2Fap26051383066859.jpg",
      "sourceUrl": "https://www.npr.org/2026/02/20/g-s1-110915/uk-former-prince-andrew-epstein-investigation",
      "sourceName": "NPR News",
      "publishedAt": "2026-02-20T17:31:20.835Z"
    },
    {
      "id": "ps-1771608223355-59yq",
      "slug": "u-s-military-buildup-near-iran-reaches-critical-mass-as-seco",
      "headline": "U.S. Military Buildup Near Iran Reaches Critical Mass as Second Carrier Deploys",
      "subheadline": "Pentagon positions forces capable of sustained bombing campaign while Trump remains noncommittal on use of force",
      "body": "The United States has amassed military assets in the Middle East sufficient to sustain a weeks-long bombing campaign against Iran, with a second aircraft carrier moving into the Mediterranean and 50 additional fighter jets arriving in the region, according to NPR reporting on February 20.\n\nThe buildup significantly exceeds what military analysts say would be needed simply to pressure Tehran during nuclear negotiations, raising questions about the administration's endgame. President Trump has declined to specify his objectives but has demanded that Iran effectively dismantle its nuclear program and make additional concessions — terms Tehran has historically rejected. Alex Vatanka, an Iran expert at the Middle East Institute, told NPR that Iranian leadership anticipates a military conflict with the United States larger than last summer's 12-day war with Israel, though not on the scale of the 2003 Iraq invasion.\n\nThe military escalation comes as Trump simultaneously pursues an expansive diplomatic agenda through his newly created Board of Peace, which held its inaugural meeting on February 19. The administration used the occasion to unveil ambitious development plans for Gaza's coastline, including high-end condominiums and skyscrapers. Trump announced that member states have pledged $7 billion for Gaza's reconstruction, with the United States committing an additional $10 billion. The board, initially formed to oversee the Gaza ceasefire, is being positioned as a vehicle for addressing multiple global conflicts — a scope that has alarmed some world leaders who fear it could sideline the United Nations. Critics warn that the world's most powerful nation establishing an alternative multilateral framework threatens to undermine the U.N.'s role as a platform where smaller countries participate in international decision-making.\n\nThe dual developments — military brinkmanship with Iran and a bold reimagining of postwar Gaza — underscore the administration's willingness to reshape Middle Eastern geopolitics through both hard and soft power simultaneously. With Iran showing no signs of capitulating to American demands and the Board of Peace generating international unease, the coming weeks could prove pivotal for regional stability and the broader international order. The situation also arrives against the backdrop of significant domestic and allied tensions, including the unprecedented arrest of King Charles' brother Andrew Mountbatten-Windsor on suspicion of sharing sensitive government information, which British authorities continue to investigate.",
      "category": "breaking",
      "importance": 9,
      "tags": [
        "Iran",
        "U.S. military",
        "Middle East",
        "Board of Peace",
        "Gaza",
        "Trump",
        "nuclear negotiations"
      ],
      "imageUrl": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7755x4362+0+404/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc1%2Fcc%2F4f9efaaf4862a0d8ccf034d96f78%2Fgettyimages-2261210029.jpg",
      "sourceUrl": "https://www.npr.org/2026/02/20/g-s1-110892/up-first-newsletter-iran-us-military-board-of-peace-former-prince-andrew-arrest-kennedy-center",
      "sourceName": "NPR News",
      "publishedAt": "2026-02-20T17:23:43.355Z"
    },
    {
      "id": "ps-1771608073029-l1cr",
      "slug": "two-teenagers-sentenced-to-life-for-racist-murder-in-south-w",
      "headline": "Two Teenagers Sentenced to Life for Racist Murder in South Wales",
      "subheadline": "Kamran Aman, 38, was stabbed through the heart while delivering groceries to his mother's home in Barry",
      "body": "Two teenagers have been sentenced to life in prison for the racially motivated murder of Kamran Aman, a 38-year-old father who was attacked without provocation while delivering food to his mother's home in Barry, south Wales. Marcus Staniforth, 17, received a minimum term of 17 years, while a second defendant, 16, who cannot be named for legal reasons, was given a minimum of 15 years at Cardiff Crown Court.\n\nThe attack occurred just before midnight on June 30, when Aman parked his car a few doors from his mother's house on Barry Road after spending the day working and the evening with his wife and four-year-old daughter. The younger defendant, looking down from a bedroom window after hours of drinking, spotted Aman in his car and decided to attack him. After hurling racist abuse and attempting to enter the vehicle, the 16-year-old began punching Aman as he exited the car, with Staniforth quickly joining the assault. Witnesses described the beating as \"relentless,\" likening the attackers to a \"pack of animals.\" Staniforth then ran into a nearby house, returning 15 seconds later with a large kitchen knife that he swung \"multiple times,\" stabbing Aman once through the heart.\n\nAman managed to reach a neighbor's doorway, telling her \"I think I've been stabbed\" and \"I can't breathe\" as blood pooled on the floor. Even as the victim lay dying, the younger defendant bent over him shouting racist abuse. South Wales Police said Aman suffered \"abhorrent racist abuse before, during and after\" the assault. Staniforth attempted to destroy evidence by washing the knife and his hands with bleach, but both teenagers were arrested roughly 10 minutes later. His DNA was found on the weapon, and Aman's blood was recovered from Staniforth's shorts and the other defendant's shoes.\n\nJudge Mr. Justice Griffiths called Staniforth a \"very dangerous man indeed,\" telling him he had \"turned a failing attempt at beating a man into murder.\" Addressing the younger defendant, the judge said he had \"instigated a deliberate, unprovoked, sustained, violent racist attack\" and was \"old enough to know that to cause serious injury on a stranger because of his race was wrong.\" Defense counsel argued the 16-year-old suffered from autism spectrum disorder and ADHD that affected his emotional maturity, and that he had not known Staniforth would bring a knife. The court was not persuaded to significantly reduce the sentence.\n\nAman's wife, Khaleela James, told the court their daughter is now \"traumatised\" by her father's death and suffers from separation anxiety, fearing her mother will also not come home. \"There is a hole in our heart that can never be filled,\" she said, addressing the defendants, who showed no emotion. Aman's mother, Shahnaz Aman, said her surviving family members are now \"terrified\" and no longer visit Barry. Aliya Mohammed, CEO of Race Equality First, said the court's explicit recognition of the racial motive sends \"an important message that racism has been taken seriously by the courts,\" adding that racist violence harms entire communities beyond the immediate victim.",
      "category": "breaking",
      "importance": 7,
      "tags": [
        "hate crime",
        "racism",
        "Wales",
        "knife crime",
        "murder sentencing",
        "Barry"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/c7a3/live/4caa5f40-0c10-11f1-ad4b-755d3b02c9a5.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/c8r1kmz614po?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T17:21:13.029Z"
    },
    {
      "id": "ps-1771603361793-owem",
      "slug": "uk-athletics-pleads-guilty-to-corporate-manslaughter-of-para",
      "headline": "UK Athletics Pleads Guilty to Corporate Manslaughter of Paralympian",
      "subheadline": "Abdullah Hayayei, a UAE father of five, was killed when a metal cage collapsed on him during training in 2017",
      "body": "UK Athletics, the governing body for track and field in Britain, reversed its earlier plea on Friday and admitted guilt to the corporate manslaughter of Paralympian Abdullah Hayayei, who was killed during a training session in London nearly eight years ago.\n\nHayayei, a 36-year-old thrower from the United Arab Emirates and father of five, died in July 2017 when a metal cage fell on him at Newham Leisure Centre. He had been preparing for the World Para-athletics Championships in London, where he was due to compete in the F34 shot put, discus, and javelin events. The athlete had made his Paralympic debut at Rio 2016, finishing sixth in the javelin and seventh in the shot put, and had previously represented his country at the 2015 World Championships in Doha.\n\nThe guilty plea, entered at the Old Bailey, marks a dramatic reversal from March 2025, when UK Athletics had denied the charge. Keith Davies, 78, who served as head of sport for the 2017 World Para-athletics Championships, also changed his plea on Friday, admitting to a health and safety offense after previously denying gross negligence manslaughter. Prosecutor Karen Robinson told the court that a two-day sentencing hearing would be scheduled for early June, and that the prosecution would not pursue a trial. Outstanding charges against both defendants will be resolved at sentencing. Davies was granted continued bail on the condition that he cooperate with the Probation Service for a pre-sentence report.\n\nThe case has drawn renewed attention to safety standards at major international athletics events. Hayayei's death cast a shadow over the 2017 World Para-athletics Championships, where a moment of silence was held in his honor during the opening ceremony at London Stadium. The lengthy legal proceedings — spanning nearly eight years from the incident to a guilty plea — underscore the complexity of corporate manslaughter prosecutions in the United Kingdom, which require proof that senior management failures caused a death.\n\nUK Athletics now faces what could be a substantial financial penalty at sentencing. Under English law, corporate manslaughter convictions carry unlimited fines, with courts directed to consider the severity of the management failure and the organization's financial resources. The sentencing hearing in June will determine the consequences for both the governing body and Davies personally.",
      "category": "breaking",
      "importance": 7,
      "tags": [
        "UK Athletics",
        "corporate manslaughter",
        "Abdullah Hayayei",
        "Paralympics",
        "athlete safety"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a742/live/9c6dfac0-0e4d-11f1-9189-e7ebb4fb5ccd.jpg",
      "sourceUrl": "https://www.bbc.com/sport/articles/c0ljn0z94n5o?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T16:02:41.793Z"
    },
    {
      "id": "ps-1771602464205-hxpm",
      "slug": "eric-dane-grey-s-anatomy-and-euphoria-star-dies-at-53",
      "headline": "Eric Dane, Grey's Anatomy and Euphoria Star, Dies at 53",
      "subheadline": "The actor spent his final months as a tireless advocate for ALS research after revealing his diagnosis in April 2025",
      "body": "Eric Dane, the actor beloved for his roles as \"Dr. McSteamy\" on Grey's Anatomy and the troubled patriarch Cal Jacobs on HBO's Euphoria, died Thursday afternoon following a battle with amyotrophic lateral sclerosis. He was 53 years old, and had lived less than a year since publicly disclosing his diagnosis.\n\nDane's family confirmed his death in a statement, saying he spent his final days surrounded by his wife, actress and model Rebecca Gayheart, and their two daughters, Billie and Georgia, who were \"the center of his world.\" Born in San Francisco in 1972, Dane built a career spanning more than three decades, beginning with a television debut on The Wonder Years in 1993. He went on to appear in Charmed, The Last Ship, and films including Marley & Me and Burlesque, but it was his 2006 arrival on Grey's Anatomy as the charismatic plastic surgeon Dr. Mark Sloan that made him a household name.\n\nIn the ten months between his April 2025 diagnosis and his death, Dane channeled his public profile into an urgent campaign for ALS awareness and research funding. He joined the board of directors of Target ALS in December and helped one of its fundraising campaigns surpass $500,000. Earlier this month, Time magazine named him among its 100 most influential people in health. \"I'm trying to save my life,\" he told the publication, \"and if my actions can move the needle forward for myself and countless others, I'm satisfied.\" In November, he took on a role in NBC's Brilliant Minds portraying a firefighter grappling with an ALS diagnosis — art mirroring his own reality.\n\nTributes poured in from across Hollywood. Patrick Dempsey, his longtime Grey's Anatomy co-star, called him \"the funniest man\" and \"wickedly intelligent,\" praising both his on-set humor and his advocacy work. Euphoria creator Sam Levinson described working with Dane as \"an honor\" and his friendship as \"a gift.\" Ashton Kutcher urged fans to \"keep fighting the fight to solve ALS,\" while actress Nina Dobrev said Dane \"led with kindness and made everyone on our set feel seen.\"\n\nDane had spoken candidly about the emotional weight of his illness, telling Good Morning America in June that the diagnosis made him \"angry\" — particularly because he had lost his own father to suicide as a child and feared his daughters would lose him while they were still young. ALS, also known as Lou Gehrig's disease, is a progressive neurodegenerative condition with no cure. According to the Muscular Dystrophy Association, most patients survive three to five years after diagnosis, though Dane's decline was notably swift. His family asked that his memory continue to fuel the research and awareness he championed until the end.",
      "category": "breaking",
      "importance": 7,
      "tags": [
        "Eric Dane",
        "ALS",
        "Grey's Anatomy",
        "Euphoria",
        "celebrity death",
        "motor neurone disease"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/15be/live/432eaa20-0e45-11f1-8705-e59653a64488.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/c78j01n775ko?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T15:47:44.205Z"
    },
    {
      "id": "ps-1771599751437-wz7m",
      "slug": "israeli-settlers-kill-19-year-old-palestinian-american-in-we",
      "headline": "Israeli Settlers Kill 19-Year-Old Palestinian American in West Bank",
      "subheadline": "Nasrallah Abu Siyam is the second U.S. citizen killed by settlers in under a year as West Bank violence escalates",
      "body": "Israeli settlers shot and killed Nasrallah Abu Siyam, a 19-year-old Palestinian American, during an attack on the West Bank village of Mukhmas on Wednesday, according to the Palestinian Health Ministry and eyewitnesses. The killing marks the first Palestinian death at the hands of settlers in 2026 and the second fatal shooting of a U.S. citizen by settlers in less than a year.\n\nAccording to village resident Raed Abu Ali, a group of settlers descended on Mukhmas — located east of Ramallah — on Wednesday afternoon, assaulting a farmer and triggering clashes when villagers intervened. Israeli military forces subsequently arrived and deployed tear gas, sound grenades, and live ammunition, Abu Ali said. He described armed settlers opening fire after soldiers appeared on the scene, killing Abu Siyam and injuring several others. \"When the settlers saw the army, they were encouraged and started shooting live bullets,\" Abu Ali told the Associated Press, adding that settlers beat wounded Palestinians with sticks as they lay on the ground.\n\nThe Israeli military acknowledged using \"riot dispersal methods\" after receiving reports of rock-throwing but denied its forces fired during the confrontation. It confirmed that unnamed suspects had shot at Palestinians, who were evacuated for medical treatment. The military did not indicate whether any arrests were made. A U.S. Embassy spokesperson said they \"condemn this violence,\" though offered no further detail.\n\nThe incident comes amid a sustained escalation in the occupied West Bank. Israeli forces and settlers killed 240 Palestinians in 2025, according to the United Nations Office for the Coordination of Humanitarian Affairs, while Palestinians killed 17 Israelis — six of them soldiers — over the same period. The Palestinian Authority's Wall and Settlement Resistance Commission identified Abu Siyam as the first settler-related fatality of the new year. Mukhmas and its surrounding area, most of which falls under Israeli civil and military administration, have become a focal point for settler violence, including arson, physical assaults, and the construction of outposts deemed illegal even under Israeli law.\n\nThe killing coincided with a sweeping report from the U.N. High Commissioner for Human Rights accusing Israel of war crimes in the West Bank and warning that the forced displacement of Palestinians and demographic alterations to the territory \"raise concerns over ethnic cleansing.\" The office cited a \"concerted and accelerating effort to consolidate annexation\" based on findings from November 2024 through October 2025. Palestinian rights advocates and human rights organizations have long charged that Israeli authorities routinely fail to prosecute settlers or hold them accountable, a pattern they say emboldens further violence. Israel has repeatedly rejected allegations of bias from U.N. bodies.",
      "category": "breaking",
      "importance": 8,
      "tags": [
        "West Bank",
        "Israeli settlers",
        "Palestinian American",
        "U.S. citizen",
        "settler violence",
        "United Nations",
        "human rights"
      ],
      "imageUrl": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8563x4817+0+446/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4f%2F53%2Fc86adc87442b828e675c1713f10a%2Fap26050415877532.jpg",
      "sourceUrl": "https://www.npr.org/2026/02/20/nx-s1-5720677/israeli-settlers-kill-19-year-old-palestinian-american-officials-and-witnesses-say",
      "sourceName": "NPR News",
      "publishedAt": "2026-02-20T15:02:31.437Z"
    },
    {
      "id": "ps-1771599798551-slpa",
      "slug": "taliban-escalates-enforcement-of-women-s-dress-code-in-afgha",
      "headline": "Taliban Escalates Enforcement of Women's Dress Code in Afghan City of Herat",
      "subheadline": "Hospital admissions dropped 28% as vice agents blocked women without burkas from accessing healthcare and transport",
      "body": "Taliban authorities have intensified enforcement of strict dress codes for women and girls in the western Afghan city of Herat since November, deploying agents at hospitals, schools, and transport checkpoints to bar those who show their faces in public, according to interviews with more than a dozen residents and reports from international organizations.\n\nThe crackdown, led by officials from the Ministry for the Promotion of Virtue and Prevention of Vice, initially required women to wear the full Afghan burka — a blue garment with a netted eye opening — before entering government buildings and health facilities. At Herat Regional Hospital, the consequences were immediate and severe. Female staff were forced to wait outside for hours, exchanging burkas with colleagues ending night shifts like tokens granting \"entry permission,\" according to a male medic who spoke to NPR on condition of anonymity. Doctors Without Borders reported a 28% drop in urgent admissions during the first days of enforcement, though numbers recovered after the initial shock. Human Rights Watch documented the detention of a female surgeon for several hours for failing to wear a burka.\n\nFacing resistance, authorities partially relented. After what residents described as sustained pushback — including an incident in which dozens of teenage girls physically overwhelmed vice agents posted outside a religious seminary — officials eased requirements to allow women to wear the traditional chaddar cloak with a face mask. The seminary confrontation saw girls refuse to enter the school, telling Taliban officials to \"either repeal this law or we will not enter.\" They were ultimately allowed in without burkas but were ordered to wear black niqabs and gloves.\n\nThe enforcement extended to public transport, where agents set up checkpoints to inspect women's clothing inside vehicles. Women were first ordered to sit only in the back of shared minibuses, then banned from riding alongside men entirely. The segregation tripled fares for women — from roughly 50 cents to $1.60 per ride — and some drivers refused to carry female passengers at all due to checkpoint delays. Two female health workers told NPR they witnessed agents detaining women inside a shipping container in a Herat square for hours in freezing November temperatures, their offense being the wearing of headscarves and long coats without a chaddar.\n\nThe restrictions trace back to a May 2022 edict requiring post-pubescent women to wear either a burka or a full black robe with face veil and gloves, with male guardians held responsible for compliance. A more detailed law followed in August 2024. Sahar Fetrat of Human Rights Watch called the policies part of the Taliban's effort \"to make women invisible,\" noting that Afghan women and United Nations experts have labeled the system \"gender apartheid.\" Kate Clark of the Afghanistan Analysts Network observed that enforcement \"moves in waves\" driven by unpredictable factors, from changes in local leadership to public backlash. The Taliban did not respond to requests for comment.",
      "category": "breaking",
      "importance": 7,
      "tags": [
        "Afghanistan",
        "Taliban",
        "women's rights",
        "gender apartheid",
        "Herat",
        "human rights"
      ],
      "imageUrl": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4981x2802+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F05%2F07%2F3a2f744b4b78ba3ec8e6fe680728%2Fburka-2255831260.jpg",
      "sourceUrl": "https://www.npr.org/2026/02/20/g-s1-110736/taliban-afghanistan-women-face-covering",
      "sourceName": "NPR News",
      "publishedAt": "2026-02-20T15:03:18.551Z"
    },
    {
      "id": "ps-1771595237986-uzhj",
      "slug": "prince-andrew-s-arrest-poses-unprecedented-crisis-for-britis",
      "headline": "Prince Andrew's Arrest Poses Unprecedented Crisis for British Monarchy",
      "subheadline": "King Charles pledges 'full and wholehearted' cooperation as his brother is detained on suspicion of misconduct in public office",
      "body": "The arrest of Andrew Mountbatten-Windsor — the former Prince Andrew — on suspicion of misconduct in public office has plunged the British monarchy into what may be its most acute institutional crisis in a generation, forcing King Charles III into the extraordinary position of publicly distancing himself from his own brother while pledging full cooperation with investigators.\n\nAndrew was taken from his residence on the King's Sandringham estate in Norfolk, photographed, fingerprinted, and held for approximately 11 hours at Aylsham Police Investigation Centre before being released under investigation. In a carefully worded statement issued hours after the arrest, the King expressed his \"deepest concern\" about \"Andrew Mountbatten-Windsor and suspicion of misconduct in public office,\" notably using his brother's legal surname rather than any royal title and making no reference to their familial bond. The authorities, Charles wrote, \"have our full and wholehearted support and cooperation.\"\n\nThe arrest caps a dramatic fall for a man who, just months ago, appeared publicly with the royal family at the funeral of the Duchess of Kent at Westminster Cathedral and who for years used Buckingham Palace as the backdrop for his investment initiative, Pitch@Palace. Royal supporters have pointed to the unprecedented steps Charles has already taken — stripping Andrew of his titles, removing him from Royal Lodge, and offering assistance to investigators — as evidence of decisive leadership. Jonathan Dimbleby, the King's biographer and friend, argued on BBC Radio 4's World at One that the arrest need not damage the monarchy itself. \"I think we have to separate the notion of a family from the institution of the monarchy,\" Dimbleby said.\n\nThat distinction, however, is one the broader public may not readily accept. Andrew remains in the line of succession to the Crown, and his decades as a working royal make any claim that his legal troubles are a \"private matter\" difficult to sustain. The Palace has long maintained a boundary between members' public duties and personal lives, but critics argue the institution was too slow to act as allegations accumulated over years — particularly those connected to the Jeffrey Epstein scandal. New Mexico has separately reopened a criminal inquiry into Epstein's Zorro Ranch property, and newly released files suggest the financier sought record-label investments as a means of accessing women, raising the prospect of further revelations.\n\nFor King Charles, the challenge is existential in nature: a hereditary monarchy derives its legitimacy from bloodline, yet that very bloodline now ties the Crown to a criminal investigation. The Palace has signaled it will not seek any special treatment for the former prince, but the unanswered question looming over the institution is how much more damaging information the promised \"wholehearted\" cooperation might ultimately surface.",
      "category": "breaking",
      "importance": 9,
      "tags": [
        "Prince Andrew",
        "British monarchy",
        "King Charles",
        "Jeffrey Epstein",
        "Royal Family",
        "misconduct in public office"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/e07f/live/6b0f1980-0e45-11f1-b7e1-afb6d0884c18.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/cm21xjg2npjo?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T13:47:17.986Z"
    },
    {
      "id": "ps-1771595283904-ye3p",
      "slug": "trump-sets-15-day-deadline-for-iran-nuclear-deal-as-u-s-surg",
      "headline": "Trump Sets 15-Day Deadline for Iran Nuclear Deal as U.S. Surges Forces to Region",
      "subheadline": "A second aircraft carrier approaches the Middle East while Iran conducts joint military drills with Russia, raising fears of imminent conflict.",
      "body": "President Donald Trump issued a stark warning to Iran on Thursday, declaring that 10 to 15 days should be \"enough time\" to reach a nuclear agreement and that \"bad things happen\" if a meaningful deal cannot be struck — even as the United States deployed a second aircraft carrier toward the Middle East and Iran staged joint naval exercises with Russia.\n\nThe escalation marks the most dangerous moment in U.S.-Iran relations since American and Israeli strikes hit Iranian nuclear sites and military installations last summer. According to a senior U.S. official speaking on condition of anonymity, top national security officials met Wednesday and were briefed that the \"full forces\" required to execute potential military action against Iran are expected to be in position by mid-March. An additional 50 U.S. combat aircraft — including F-35s, F-22s, and F-16s — were ordered to the region this week alone, joining hundreds already stationed at bases across the Arab Gulf states.\n\nDiplomatic channels remain open but fragile. Iran has agreed to draft a written proposal addressing American concerns raised during indirect nuclear talks in Geneva this week, though no timeline for delivery has been disclosed. The negotiations face a fundamental impasse: Washington and Israel want Iran to curtail its ballistic missile program and cut ties with proxy groups like Hamas and Hezbollah, while Tehran insists discussions must focus solely on nuclear matters. Iran's ambassador to the United Nations, Amir Saeid Iravani, warned in a letter to the Security Council that any U.S. aggression would be met \"decisively and proportionately,\" and that all American bases and assets in the region would become \"legitimate targets.\"\n\nThe military posturing is intensifying on all sides. The USS Gerald R. Ford carrier strike group was tracked off the coast of Morocco on Wednesday, headed toward the Mediterranean, while Iranian and Russian forces conducted drills in the Gulf of Oman and Indian Ocean. Iran also carried out live-fire exercises in the Strait of Hormuz, through which roughly one-fifth of the world's traded oil transits. Israeli Prime Minister Benjamin Netanyahu declared his country \"prepared for any scenario,\" warning that any Iranian attack on Israel would provoke a response Tehran \"cannot even imagine.\" Polish Prime Minister Donald Tusk urged his citizens to leave Iran immediately, warning that evacuation could become impossible within hours, while Germany began withdrawing non-essential military personnel from northern Iraq.\n\nA senior regional government official who has been in private contact with Iranian leaders said he has urged Tehran to take Trump's threats at face value, pointing to the president's track record of following through on rhetoric. The official cautioned, however, that a limited U.S. strike intended to pressure Iran could backfire, potentially prompting Supreme Leader Ali Khamenei to abandon negotiations entirely. Iran's theocratic government is already under severe strain, facing mass anti-government protests that were violently suppressed in January, with mourners still holding memorial ceremonies for slain demonstrators 40 days later.",
      "category": "breaking",
      "importance": 9,
      "tags": [
        "Iran",
        "Trump",
        "nuclear talks",
        "Middle East",
        "USS Gerald R. Ford",
        "military escalation",
        "U.S. foreign policy"
      ],
      "imageUrl": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4800x2700+0+133/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F85%2Fa7%2F56f31b2548dfa05e7d71340e7c00%2Fap26050449890011.jpg",
      "sourceUrl": "https://www.npr.org/2026/02/20/nx-s1-5720662/trump-warns-bad-things-iran-doesnt-make-deal-second-us-carrier-nears",
      "sourceName": "NPR News",
      "publishedAt": "2026-02-20T13:48:03.904Z"
    },
    {
      "id": "ps-1771591673602-reeu",
      "slug": "epstein-eyed-emi-records-deal-to-access-women-doj-files-reve",
      "headline": "Epstein Eyed EMI Records Deal to Access Women, DOJ Files Reveal",
      "subheadline": "Newly released emails show convicted sex offender's associate pitched music industry investment as offering access to 'P'",
      "body": "Newly released U.S. Department of Justice files reveal that convicted sex offender Jeffrey Epstein considered investing in troubled music conglomerate EMI after an associate suggested the deal could offer access to women, adding another disturbing dimension to the financier's pattern of leveraging business ventures for predatory purposes.\n\nThe emails, part of a tranche of Epstein files released by the DOJ, show London-based German businessman David Stern forwarding a news article about EMI's financial difficulties in February 2010 with the note: \"Troubled industry but related to P.\" The letter \"P\" was Epstein's habitual shorthand for women, believed to abbreviate a vulgar term he frequently used. Stern routinely employed the code in correspondence — wishing Epstein \"lots of P\" on birthdays, rating destinations by \"P factor\" (Ibiza received 9 out of 10), and once offering fashion show tickets \"to review Chinese P.\"\n\nEpstein responded to the EMI pitch with apparent interest, asking whether they needed help from \"mandelson\" — an apparent reference to Lord Mandelson, who at the time served as Britain's First Secretary of State and Business Secretary. Stern advised it was \"too early to get Mandelson involved.\" Days later, Epstein appears to have emailed Lord Mandelson directly requesting a contact's information regarding EMI. Lord Mandelson appears to have responded with contact details, though portions of the exchange were redacted. Neither Stern nor Lord Mandelson responded to requests for comment.\n\nThe proposed acquisition never materialized. Epstein suggested installing Tommy Mottola, the former Sony Music CEO, to run the operation, writing that he wanted Mottola \"brought in to fix it.\" Mottola's name appears more than 700 times across the DOJ files, though an appearance in the documents is not an indication of wrongdoing. Mottola did not respond to a request for comment. EMI's main lender, Citigroup, ultimately seized control of the company and later sold it to Universal Music and a Sony-led consortium in 2012.\n\nThe EMI episode was not an isolated case. As late as 2011, Stern was still pushing the idea, writing that the company \"could actually be of interest to Chinese if structured properly\" and was \"most certainly great asset to have for P!\" The DOJ files also document discussions among Epstein and his associates about acquiring modeling agencies and fashion-related businesses — none of which went forward. French prosecutors previously suspected that Epstein used fashion industry contacts, including the late Jean-Luc Brunel, to house and transport underage girls. Stern, who had close ties to Andrew Mountbatten-Windsor and directed the former prince's Pitch@Palace startup competition, also served as an intermediary in negotiations involving Sarah Ferguson's finances, underscoring the breadth of Epstein's network across business, politics, and royalty.",
      "category": "breaking",
      "importance": 8,
      "tags": [
        "Jeffrey Epstein",
        "DOJ files",
        "EMI Records",
        "Lord Mandelson",
        "David Stern",
        "Tommy Mottola"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/f4ab/live/e620b7e0-0cd4-11f1-a2e4-19f6f2c0e79a.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/czx41k51595o?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T12:47:53.602Z"
    },
    {
      "id": "ps-1771583560849-dkxx",
      "slug": "stanford-team-develops-universal-vaccine-targeting-all-respi",
      "headline": "Stanford Team Develops 'Universal Vaccine' Targeting All Respiratory Infections",
      "subheadline": "Nasal spray approach represents a 'radical departure' from 200 years of vaccine design, but human trials are still needed",
      "body": "Researchers at Stanford University have developed an experimental nasal spray vaccine that could protect against virtually all respiratory viruses, multiple bacterial infections, and even allergens — a fundamentally new approach to immunization that the team says breaks from over two centuries of vaccine design.\n\nPublished in the journal Science, the study demonstrated that the vaccine produced a 100- to 1,000-fold reduction in viruses penetrating the lungs of animal subjects. Unlike conventional vaccines, which train the immune system to recognize a specific pathogen, the Stanford approach works by placing immune cells called macrophages in the lungs on a state of heightened readiness — what the researchers describe as an \"amber alert\" — enabling them to respond rapidly to any invading pathogen. The effect persisted for approximately three months in animal experiments. Professor Bali Pulendran, a microbiologist and immunologist at Stanford who led the work, said the vaccine elicits \"a far broader response that is protective against not just the flu virus, not just the Covid virus, not just the common cold virus, but against virtually all viruses, and as many different bacteria as we've tested, and even allergens.\"\n\nThe research showed efficacy against two dangerous bacterial species — Staphylococcus aureus and Acinetobacter baumannii — and appeared to reduce immune responses to house dust mite allergens, a common trigger of allergic asthma. Professor Daniela Ferreira, a vaccinologist at the University of Oxford who was not involved in the study, called it \"a really exciting piece of research\" that \"could mark a major step forward\" in protecting people from the heavy burden of respiratory infections.\n\nSignificant hurdles remain before the technology reaches patients. No human clinical trials have been conducted, and researchers acknowledge key uncertainties: whether the same immune priming can be achieved in people, how long the protective state would last, and whether artificially elevating the immune system's baseline vigilance could trigger harmful side effects. Jonathan Ball, professor of molecular virology at the Liverpool School of Tropical Medicine, cautioned that keeping the body on \"high alert\" risks \"friendly fire, where a hyper-ready immune system accidentally triggers unwelcome side effects.\" The delivery method may also need to change — while tested as a nasal spray in animals, a nebulizer might be required to reach the deeper regions of human lungs.\n\nThe Stanford team envisions the universal vaccine as a complement to existing immunizations rather than a replacement. In a pandemic scenario similar to early 2020, such a vaccine could buy critical time while pathogen-specific vaccines are developed. More routinely, Pulendran suggested, a seasonal spray administered at the onset of winter could \"imprint broad immunity\" against the constellation of respiratory bugs that circulate each year. The researchers are now planning human challenge trials in which vaccinated volunteers would be deliberately exposed to infections to evaluate the approach's real-world potential.",
      "category": "science",
      "importance": 7,
      "tags": [
        "vaccines",
        "Stanford University",
        "respiratory infections",
        "immunology",
        "nasal spray vaccine"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/8700/live/6c2b5460-0e44-11f1-b7e1-afb6d0884c18.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/cx2g8rz7yedo?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T10:32:40.849Z"
    },
    {
      "id": "ps-1771578200437-ppyj",
      "slug": "venezuela-signs-amnesty-law-that-could-free-hundreds-of-poli",
      "headline": "Venezuela Signs Amnesty Law That Could Free Hundreds of Political Prisoners",
      "subheadline": "The landmark measure marks a dramatic reversal for a government that long denied holding anyone for political reasons",
      "body": "Venezuela's acting president Delcy Rodríguez signed an amnesty bill into law on Thursday that could lead to the release of hundreds of politicians, activists, journalists, and human rights defenders imprisoned under the now-deposed government of Nicolás Maduro — a sweeping acknowledgment that the state has for years jailed citizens on political grounds.\n\nThe legislation, approved by Venezuela's National Assembly just hours before Rodríguez signed it, grants \"general and full amnesty\" for politically motivated crimes and offenses committed during specific periods dating back to 1999. The law covers acts connected to political conflicts, including the contested 2024 presidential election and its aftermath, which triggered mass protests and the arrest of more than 2,000 people, among them minors. Rodríguez, who proposed the bill in late January, said during the signing ceremony that the measure showed the country's leaders were \"letting go of a little intolerance and opening new avenues for politics in Venezuela.\"\n\nThe amnesty represents the most significant policy shift yet in a country undergoing rapid transformation following last month's U.S. military raid on Caracas that resulted in Maduro's capture. Since then, Rodríguez's transitional government has moved quickly to comply with demands from the Trump administration, including an overhaul of Venezuela's oil industry law. The amnesty bill, however, did not come without friction. Debate was suspended last week after ruling-party loyalists clashed with other lawmakers over whether Venezuelans who fled the country to avoid detention should qualify for relief. The compromise reached Thursday allows exiles to have a lawyer petition for amnesty on their behalf without requiring them to return.\n\nPrisoners' rights organization Foro Penal estimates that more than 600 people remain in custody for political reasons. While the government pledged mass releases after Maduro's fall, only 448 prisoners have been freed so far, according to Foro Penal's tally. Families of the detained have been gathering outside prisons for days, with some launching a hunger strike on Saturday to pressure authorities. Opposition lawmaker Nora Bracho acknowledged the bill's limitations during the legislative debate but called it \"a great step forward\" that \"will alleviate the suffering of many Venezuelans.\"\n\nHuman rights groups and opposition figures have greeted the measure with cautious optimism, noting that amnesty has been a central demand for years. The law's real test will come in its implementation — whether the government follows through on releasing prisoners swiftly and whether eligibility criteria are applied fairly across the broad spectrum of those detained under Maduro's two-decade rule.",
      "category": "breaking",
      "importance": 8,
      "tags": [
        "Venezuela",
        "political prisoners",
        "amnesty",
        "Delcy Rodriguez",
        "Maduro",
        "human rights",
        "Latin America"
      ],
      "imageUrl": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5616x3159+0+231/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb3%2F3c%2F62cdbf764e66bfd196e613b20a92%2Fap26049664202062.jpg",
      "sourceUrl": "https://www.npr.org/2026/02/19/nx-s1-5720220/venezuela-approves-amnesty-that-may-release-of-hundreds-detained-for-political-reasons",
      "sourceName": "NPR News",
      "publishedAt": "2026-02-20T09:03:20.437Z"
    },
    {
      "id": "ps-1771577262343-oy8f",
      "slug": "a-remote-russian-village-has-lost-nearly-all-its-fighting-ag",
      "headline": "A Remote Russian Village Has Lost Nearly All Its Fighting-Age Men to War",
      "subheadline": "BBC analysis reveals indigenous communities and rural poor bear devastating, disproportionate burden of Russia's mounting casualties in Ukraine",
      "body": "In the remote fishing village of Sedanka on Russia's Kamchatka Peninsula — more than 7,000 kilometers from the front lines in Ukraine — nearly every man between the ages of 18 and 55 has left to fight in Moscow's war. Of the 39 who signed military contracts from a population of just 258, twelve have been confirmed killed and seven more are missing, leaving a community of women, children, and elderly struggling to survive winters that plunge to minus 10 degrees Celsius without anyone to chop firewood for their stoves.\n\nThe devastation visited upon Sedanka, home primarily to the indigenous Koryak and Itelmen peoples, is emblematic of a broader pattern revealed by an extensive BBC and Medizona casualty analysis. The investigation has now identified 186,102 Russian soldiers killed by name, with confirmed 2024 deaths reaching 69,362 — roughly equal to the combined totals for 2022 and 2023. The researchers estimate that 2025 is on pace to be the deadliest year yet for Russian forces, with total deaths projected to reach 80,000. Military experts believe the verified figures may represent only 45 to 65 percent of actual losses, placing the true Russian death toll somewhere between 286,000 and 413,500.\n\nThe burden of these casualties falls with stark inequality across Russian society. According to the analysis, 67 percent of confirmed dead came from rural areas and towns with populations under 100,000, despite such areas accounting for only 48 percent of Russia's population. Moscow, the nation's wealthiest city, has recorded the lowest per-capita death rate at just 0.05 percent of military-age males. By contrast, impoverished regions like Buryatia and Tuva in Siberia suffer death rates 27 to 33 times higher than the capital. Indigenous groups are hit hardest of all: confirmed losses include an estimated 2 percent of all Chukchi men aged 18 to 60, 1.4 percent of Russian Inuit men, and 1.32 percent of Koryak men.\n\nDemographers point to economic desperation as the primary driver. \"For many, the driver is not only poverty but a lack of prospects — the feeling that there is nothing to lose,\" one Russian demographer told the BBC. Anti-war activist Maria Vyushkova accused the Kremlin of exploiting indigenous cultural pride, noting that state television promotes stereotypes of indigenous peoples as \"born warriors\" to boost recruitment. In Sedanka, one such recruit was Vladimir Akeev, a 45-year-old hunter and fisherman who signed his army contract in the summer of 2024 and was killed in combat four months later. His coffin was carried to the cemetery on wooden sleds pulled by snowmobile.\n\nThe Russian government has offered Sedanka little beyond symbolism. A monument to war participants was unveiled in the village last autumn, and regional authorities pledged an honorary title of \"village of military valour\" along with a family support program — neither of which has materialized in full. The village's sole school has been declared in a state of emergency, with walls at risk of collapse, and one in five Soviet-era homes have been deemed unsafe. Ukraine has also sustained severe losses, with President Volodymyr Zelensky citing 55,000 official battlefield deaths and a large number of missing; independent estimates suggest the true Ukrainian toll may approach 200,000. As peace talks in Geneva struggle to produce a breakthrough, the human cost continues to mount — felt most acutely in places the world has barely heard of.",
      "category": "breaking",
      "importance": 8,
      "tags": [
        "Russia-Ukraine war",
        "Russian casualties",
        "indigenous peoples",
        "Kamchatka",
        "military recruitment",
        "rural Russia",
        "Sedanka"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/818f/live/9aa4fae0-0cea-11f1-b7e1-afb6d0884c18.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/ce8n4l8elpgo?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T08:47:42.343Z"
    },
    {
      "id": "ps-1771576373584-79th",
      "slug": "hamas-holds-internal-election-to-choose-new-interim-leader",
      "headline": "Hamas Holds Internal Election to Choose New Interim Leader",
      "subheadline": "The vote, conducted across Gaza, the West Bank, and abroad, pits veteran Khaled Meshaal against Gaza-aligned Khalil al-Hayya",
      "body": "Hamas is conducting an internal election to select a new interim leader, a senior Palestinian official with knowledge of the group's affairs told the BBC, marking the most significant leadership decision since Israeli forces killed the group's top figures over the past two years.\n\nVoting is underway across Gaza, the occupied West Bank, and among Hamas members based abroad, with ballots in Gaza reportedly already cast in secret. The winner will serve a one-year term. The contest is widely seen as a two-person race between Khaled Meshaal, the Qatar-based veteran who led Hamas for nearly two decades, and Khalil al-Hayya, the group's senior figure in Gaza who is considered ideologically close to the late Yahya Sinwar. Under Hamas's rules, the leader is chosen by an electoral college of roughly 86 members drawn from the General Shura Council, the movement's top decision-making body.\n\nThe election carries outsized significance for the trajectory of both Hamas and the broader Israeli-Palestinian conflict. Since the October 7, 2023 attacks on Israel — which killed approximately 1,200 people and saw 251 taken hostage — Israel has systematically dismantled Hamas's senior leadership. Sinwar, the group's overall head, was killed by Israeli forces in Gaza in October 2024. Political chief Ismail Haniyeh was assassinated in an Israeli strike in Tehran in July 2024. Military commander Mohammed Deif was killed in a Gaza airstrike that same month. Since then, an interim committee led by Qatar-based Mohammad Darwish has guided the organization, but the top post has remained formally vacant.\n\nThe outcome could signal which of Hamas's competing internal currents will dominate going forward. Meshaal represents what observers describe as the group's more pragmatic, Muslim Brotherhood-aligned wing, while al-Hayya is associated with the Iran-aligned faction that held sway during Sinwar's tenure. The devastating war in Gaza — which has killed more than 72,000 people according to the Hamas-run health ministry — has weakened the territory-based leadership and reopened space for the so-called \"old guard\" linked to Meshaal. Hamas's 18-member political leadership is evenly split among Gaza, the West Bank and prisoners, and the diaspora, giving external figures considerable weight in the current environment.\n\nThe leadership question also has direct implications for ceasefire negotiations and post-war governance. A U.S.-backed ceasefire took effect in October, with talks continuing over subsequent phases. Under Washington's proposed framework, Hamas would have no role in governing Gaza, with authority eventually transferring to a reformed Palestinian Authority. Yet recent reports indicate Hamas has already begun reasserting control over security, taxation, and government services in the territory — a reality that any new leader will need to navigate against mounting internal pressures and an uncertain geopolitical landscape.",
      "category": "breaking",
      "importance": 8,
      "tags": [
        "Hamas",
        "Gaza",
        "Middle East",
        "Israel",
        "Khaled Meshaal",
        "Khalil al-Hayya",
        "ceasefire"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/0638/live/db384d80-0dc3-11f1-b7e1-afb6d0884c18.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/c23z0kdypm3o?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T08:32:53.584Z"
    },
    {
      "id": "ps-1771573752665-q405",
      "slug": "google-launches-gemini-3-1-pro-with-doubled-reasoning-perfor",
      "headline": "Google Launches Gemini 3.1 Pro With Doubled Reasoning Performance",
      "subheadline": "The upgraded AI model scores 77.1% on ARC-AGI-2 benchmark, rolling out across developer, enterprise, and consumer platforms",
      "body": "Google unveiled Gemini 3.1 Pro on Wednesday, an upgraded AI model that the company says more than doubles the reasoning performance of its predecessor on key benchmarks. The release marks the latest salvo in an intensifying race among tech giants to build increasingly capable AI systems.\n\nThe new model achieved a verified score of 77.1% on ARC-AGI-2, a benchmark that tests a model's ability to solve novel logic patterns it has never encountered before. Google says this represents more than twice the reasoning capability of Gemini 3 Pro, which launched in November 2025. The improvement signals meaningful progress in the kind of abstract problem-solving that has historically challenged large language models, moving beyond pattern-matching on familiar tasks toward genuine logical inference.\n\nGemini 3.1 Pro is rolling out across Google's ecosystem simultaneously — available to developers in preview through the Gemini API in Google AI Studio, Gemini CLI, and Google's agentic development platform Antigravity, as well as Android Studio. Enterprise customers can access it through Vertex AI and Gemini Enterprise, while consumers will find it in the Gemini app and NotebookLM. The broad deployment underscores Google's strategy of threading its most advanced AI capabilities through every layer of its product stack, from cloud infrastructure to consumer applications.\n\nGoogle highlighted several practical demonstrations of the model's capabilities, emphasizing tasks that go well beyond simple question-and-answer interactions. In one example, 3.1 Pro built a live aerospace dashboard that configured a public telemetry stream to visualize the International Space Station's orbit. In another, it generated a complex 3D starling murmuration simulation complete with hand-tracking controls and a generative audio score that responds to the birds' movement. The company also showcased the model's ability to produce website-ready animated SVGs from text prompts and to translate literary themes into functional web design — tasks that require synthesizing reasoning, creativity, and code generation.\n\nThe release comes just one week after Google shipped a major update to Gemini 3 Deep Think, its specialized model for scientific and engineering challenges. Google described 3.1 Pro as the \"upgraded core intelligence\" underpinning those breakthroughs. The model is launching in preview, suggesting Google intends to gather user feedback before a full production release, a pattern the company has followed with previous Gemini iterations. With OpenAI, Anthropic, and Meta all pushing aggressive model release cadences, Google's rapid progression from 3 Pro in November to 3.1 Pro in February signals the company's determination to maintain competitive parity at the frontier of AI capability.",
      "category": "tech",
      "importance": 8,
      "tags": [
        "Google",
        "Gemini",
        "artificial intelligence",
        "AI models",
        "machine learning",
        "Google DeepMind"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1740393068187-becf4276f27a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw0fHxHb29nbGUlMjBHZW1pbml8ZW58MHwwfHx8MTc3MTU3Mzc1Mnww&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://blog.google/innovation-and-ai/models-and-research/gemini-models/gemini-3-1-pro/",
      "sourceName": "Hacker News",
      "publishedAt": "2026-02-20T07:49:12.665Z"
    }
  ]
}