{
  "lastUpdated": "2026-02-20T06:46:58.135Z",
  "count": 10,
  "articles": [
    {
      "id": "ps-1771569929842-ggr5fx",
      "headline": "General Catalyst Pledges $5B to India, Quintupling Previous Commitment",
      "subheadline": "The venture capital giant dramatically escalates its India strategy, up from an earlier $500M–$1B earmark",
      "body": "General Catalyst has committed $5 billion to investments in India over the next five years, a dramatic escalation that signals deepening Silicon Valley confidence in the country's startup ecosystem. The pledge represents at least a fivefold increase from the firm's previous India earmark of $500 million to $1 billion.\n\nThe move positions General Catalyst among the largest foreign venture investors in India at a time when the country's technology sector is benefiting from rapid digital adoption, a maturing founder ecosystem, and favorable government policies. India has become an increasingly critical market for global venture firms seeking growth outside of the United States and China.\n\nThe scale of the commitment suggests General Catalyst sees India not as a secondary market but as a core pillar of its global investment strategy. The five-year timeline indicates the firm expects sustained deal flow across sectors including artificial intelligence, fintech, enterprise software, and consumer technology — areas where Indian startups have demonstrated the ability to build at scale for both domestic and international markets.",
      "category": "business",
      "breaking": false,
      "importance": 6,
      "sourceUrl": "https://techcrunch.com/2026/02/19/general-catalyst-commits-5b-to-india-over-five-years/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-20T06:45:29.842Z"
    },
    {
      "id": "ps-1771569939935-wftrtn",
      "headline": "Neo Launches Residency Program With $750K Investment on Uncapped SAFE",
      "subheadline": "Ali Partovi's accelerator challenges Y Combinator model with founder-friendly terms and $40K student grants",
      "body": "Neo, the accelerator founded by tech investor Ali Partovi, is introducing a Residency program that aims to reshape how early-stage startups raise their first institutional capital. The program offers $750,000 invested through an uncapped SAFE — a notably founder-friendly structure that avoids setting a valuation cap, potentially reducing dilution for participating companies compared to traditional accelerator deals.\n\nThe move positions Neo as a direct challenge to established programs like Y Combinator, which typically take a fixed equity stake in exchange for funding and mentorship. By using uncapped SAFEs, Neo is betting that more attractive financial terms will help it compete for the strongest founders, who increasingly have leverage in a market flush with early-stage capital.\n\nAlongside the startup investment, Neo is also offering $40,000 no-strings-attached grants to college students — funding that comes with no equity requirements or repayment obligations. The dual approach reflects Partovi's long-standing focus on identifying talent early; he has previously backed founders of companies including Dropbox and Uber. The program signals a broader shift in the accelerator landscape, where top-tier founders are demanding better economics and established players face pressure to evolve their models accordingly.",
      "category": "tech",
      "breaking": false,
      "importance": 5,
      "sourceUrl": "https://techcrunch.com/2026/02/19/ali-partovis-neo-looks-to-upend-the-accelerator-model-with-low-dilution-terms/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-20T06:45:39.935Z"
    },
    {
      "id": "ps-1771569950131-0mx1tg",
      "headline": "Bitcoin Drops Near $68,000 as U.S.-Iran Tensions Rattle Markets",
      "subheadline": "Gold surges as geopolitical risk drives investors toward safe havens, with strategists warning of further downside ahead",
      "body": "Bitcoin fell toward $68,000 as escalating tensions between the United States and Iran sent ripples through global markets, dampening appetite for risk assets while propelling gold prices sharply higher.\n\nThe renewed geopolitical uncertainty has cast a cautious shadow over U.S. equities and digital assets alike. Some strategists are warning that the current downturn could deepen further, with a potential retest of 2024 lows before markets find footing for a more sustained recovery. The dynamic underscores bitcoin's continued sensitivity to macro-level risk events, despite longstanding arguments that the cryptocurrency should function as a geopolitical hedge alongside gold.\n\nGold's rally amid the turmoil reinforces its traditional role as the preferred safe-haven asset in times of global instability. The divergence between gold and bitcoin during this episode highlights an ongoing tension in how institutional and retail investors classify digital assets — as speculative instruments correlated with equities or as alternative stores of value. For now, the market appears to be treating bitcoin firmly in the former category, and traders will be watching closely to see whether the $68,000 level holds or gives way to further selling pressure.",
      "category": "markets",
      "breaking": false,
      "importance": 6,
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/bitcoin-nears-usd68-000-gold-jumps-as-us-iran-tensions-return",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T06:45:50.131Z"
    },
    {
      "id": "ps-1771569958334-5gl2wp",
      "headline": "Bitcoin Posts Worst 50-Day Start to Any Year on Record",
      "subheadline": "The cryptocurrency is set for its first consecutive January-February decline, rattling investor confidence in the 2026 outlook.",
      "body": "Bitcoin has recorded its weakest opening 50 days of any calendar year, marking an unprecedented back-to-back decline across January and February 2026. The downturn represents a sharp reversal from the bullish sentiment that characterized much of the previous year.\n\nThe consecutive monthly losses are a historical first for the cryptocurrency, which has typically seen strong early-year performance driven by renewed institutional interest and retail momentum. While Bitcoin has weathered difficult stretches before, the sustained selling pressure through the first seven weeks of 2026 has unsettled market participants who had positioned for continued gains.\n\nThe record-setting slump raises questions about whether broader macroeconomic headwinds — including persistent interest rate uncertainty and tightening liquidity conditions — are finally weighing on digital assets in a meaningful way. Analysts will be watching closely to see whether March brings a reversal or whether the poor start signals a more prolonged period of weakness for the world's largest cryptocurrency by market capitalization.",
      "category": "markets",
      "breaking": false,
      "importance": 6,
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/bitcoin-logs-worst-ever-start-to-a-year-through-first-50-days",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T06:45:58.334Z"
    },
    {
      "id": "ps-1771569967918-zu0etg",
      "headline": "Metaplanet CEO Defends Bitcoin Treasury Strategy Amid Transparency Concerns",
      "subheadline": "Simon Gerovich pushes back on critics questioning the Japanese firm's disclosure standards, options model, and core hotel business.",
      "body": "Metaplanet CEO Simon Gerovich has publicly responded to mounting criticism of the company's bitcoin-centric corporate strategy, defending its disclosure practices, options trading model, and underlying hotel operations.\n\nThe Tokyo-listed firm, which has drawn comparisons to MicroStrategy for its aggressive accumulation of bitcoin on its balance sheet, has faced scrutiny from analysts and investors who question whether its transparency standards meet the expectations that come with such an unconventional approach. Critics have raised concerns about the complexity of the company's bitcoin options trading activities and whether its legacy hotel business is being overshadowed or neglected in pursuit of cryptocurrency gains.\n\nGerovich argued that Metaplanet's disclosures are robust and that the options strategy is a disciplined method for enhancing returns on its bitcoin holdings rather than a source of hidden risk. He also maintained that the company's hotel operations remain a functioning part of the business. The defense comes as a growing number of publicly traded companies adopt bitcoin treasury strategies, inviting both enthusiasm from crypto advocates and wariness from traditional market participants who see elevated risk in tying corporate fortunes to a volatile digital asset.",
      "category": "markets",
      "breaking": false,
      "importance": 4,
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/metaplanet-ceo-rebuts-critics-over-bitcoin-strategy-and-transparency",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T06:46:07.918Z"
    },
    {
      "id": "ps-1771569978726-y9p5ke",
      "headline": "Developer Unlocks Hidden MEMS Accelerometer in Apple Silicon MacBooks",
      "subheadline": "Undocumented sensor accessed through reverse-engineering Apple's IOKit framework, revealing motion-sensing hardware Apple never publicized",
      "body": "A developer has successfully accessed a hidden MEMS accelerometer embedded in Apple Silicon MacBooks by reverse-engineering Apple's IOKit framework, bypassing the lack of any official documentation or public API for the sensor.\n\nThe project, published on GitHub by developer Olvvier, demonstrates how to read real-time accelerometer data from the undocumented motion sensor present in Apple's M-series laptops. While Apple has included accelerometers in MacBooks for years — primarily for the Sudden Motion Sensor that parks hard drive heads during a fall — the company has not publicly acknowledged or documented the sensor's continued presence in its newer solid-state-drive-equipped Apple Silicon machines. The developer's approach uses IOKit, Apple's low-level framework for communicating with hardware, to interface directly with the sensor and extract three-axis motion data.\n\nThe discovery raises intriguing questions about why Apple continues to ship accelerometer hardware in machines that no longer need drop protection for spinning hard drives. Possible explanations range from supply chain inertia to future software features Apple has yet to enable. For developers and researchers, the project opens the door to experimental applications including motion-based input, orientation detection, and environmental vibration monitoring on Mac hardware — capabilities that have long been available on iPhones and iPads but never officially supported on laptops.",
      "category": "tech",
      "breaking": false,
      "importance": 4,
      "sourceUrl": "https://github.com/olvvier/apple-silicon-accelerometer",
      "sourceName": "Hacker News",
      "publishedAt": "2026-02-20T06:46:18.726Z"
    },
    {
      "id": "ps-1771569988429-6y2wzw",
      "headline": "Scientists Model Antarctica's Climate Extremes, Quantifying What Can Still Be Saved",
      "subheadline": "New modeling reveals stark gap between best- and worst-case warming scenarios for the continent",
      "body": "Scientists have produced comprehensive models of best- and worst-case climate scenarios for Antarctica, offering the clearest picture yet of the continent's future under varying levels of global action. The research underscores that while the trajectory is alarming, significant harm remains preventable if emissions are curbed aggressively.\n\nAntarctica is warming at an accelerating rate, raising urgent concerns about ice sheet collapse, catastrophic sea-level rise, and cascading disruptions to ocean circulation patterns that regulate global climate. The new modeling work maps out the divergent futures the continent faces depending on policy choices made in the coming decades. Under worst-case projections, the consequences extend far beyond the Southern Ocean, threatening coastal populations worldwide.\n\nCritically, the researchers emphasize that the gap between the best and worst outcomes is substantial — a finding that reframes the climate conversation around agency rather than inevitability. The modeling suggests that decisive intervention can still preserve large portions of Antarctic ice and avert the most catastrophic sea-level scenarios. The work arrives as policymakers face mounting pressure to translate climate science into binding commitments, with Antarctica increasingly recognized as a bellwether for the planet's long-term habitability.",
      "category": "science",
      "breaking": false,
      "importance": 7,
      "sourceUrl": "https://phys.org/news/2026-02-scientists-reveal-worst-case-scenarios.html",
      "sourceName": "Phys.org",
      "publishedAt": "2026-02-20T06:46:28.429Z"
    },
    {
      "id": "ps-1771569998242-z2j2x7",
      "headline": "New Math Model Captures How Angled EM Beams Heat Human Skin",
      "subheadline": "Closed-form solution accounts for both beam angle and lateral heat conduction, improving accuracy at realistic scales",
      "body": "Researchers have derived a more complete analytical solution for predicting how electromagnetic beams heat skin tissue at arbitrary angles of incidence, addressing a significant gap in existing models that neglected sideways heat conduction.\n\nThe work builds on a previous asymptotic approach that exploits a natural feature of EM skin heating: the beam penetrates only a thin layer compared to its overall width. By expanding the temperature distribution as a power series in the ratio of penetration depth to beam width, the team had previously captured only the leading-order effect of incident angle. The new study derives closed-form expressions for the first- and second-order correction terms, revealing that lateral heat conduction — the sideways spread of thermal energy through tissue — enters at second order. While mathematically negligible in the strict asymptotic limit, this lateral conduction term proves surprisingly important at realistic depth-to-width ratios around 0.1, making it essential for practical accuracy.\n\nThe expanded solution offers a computationally efficient alternative to full numerical simulations for applications ranging from directed-energy safety assessments to therapeutic uses of EM radiation. By retaining terms through second order, the model now accurately predicts temperature distributions across a wider range of beam geometries and incident angles, giving engineers and medical researchers a more reliable analytical tool for understanding how electromagnetic energy deposits heat in biological tissue.",
      "category": "physics",
      "breaking": false,
      "importance": 4,
      "sourceUrl": "https://arxiv.org/abs/2602.16751",
      "sourceName": "arXiv Physics",
      "publishedAt": "2026-02-20T06:46:38.242Z"
    },
    {
      "id": "ps-1771570008548-bo7pk5",
      "headline": "New Method Reads Relativistic Temperature Directly From Electromagnetic Noise",
      "subheadline": "Physicists show that a medium's covariant thermal state can be fully reconstructed from passive stochastic fields alone — no probes or calibration needed.",
      "body": "A new theoretical framework demonstrates that the full relativistic thermal state of a moving medium can be measured using nothing but the electromagnetic noise it naturally emits, eliminating the need for external probes, spectral lines, or absolute intensity calibration.\n\nIn special relativity, temperature is not a simple number — it depends on the observer's frame of motion. The proper description requires an inverse-temperature four-vector, β^μ, which encodes both the medium's rest-frame temperature and its velocity relative to the observer. Reconstructing this quantity has traditionally required active measurement techniques. The new work, posted to the arXiv, shows that when a thermal medium moves at relativistic speeds, a Lorentz boost transforms its isotropic thermal noise into correlated electric and magnetic field fluctuations. These correlations form a gain-independent observable from which the drift velocity can be extracted purely from stochastic data. By combining this with angle-resolved noise spectra — governed by the covariant fluctuation-dissipation theorem — the authors show that the complete four-vector β^μ can be reconstructed from passive electromagnetic measurements alone.\n\nMonte Carlo simulations indicate the method achieves percent-level accuracy at realistic signal-to-noise ratios, with feasibility estimates suggesting sub-microsecond integration times for laboratory plasmas. The authors describe it as the first technique capable of operationally reconstructing a relativistic medium's covariant thermal state from vacuum electromagnetic fluctuations, potentially opening a new channel for diagnosing high-energy plasmas in both laboratory and astrophysical settings.",
      "category": "physics",
      "breaking": false,
      "importance": 6,
      "sourceUrl": "https://arxiv.org/abs/2602.16765",
      "sourceName": "arXiv Physics",
      "publishedAt": "2026-02-20T06:46:48.548Z"
    },
    {
      "id": "ps-1771570018135-ir432h",
      "headline": "STAR Experiment's Endcap Detector Hits Design Goals for Nuclear Physics Scan",
      "subheadline": "The eTOF subsystem achieved 70-picosecond time resolution, enabling particle identification at previously inaccessible energies.",
      "body": "The STAR experiment at Brookhaven National Laboratory's Relativistic Heavy Ion Collider has confirmed that its endcap time-of-flight detector met all design targets during a critical phase of research into the fundamental behavior of nuclear matter.\n\nThe detector subsystem, known as eTOF, was installed in February 2019 to support the second phase of RHIC's beam energy scan (BES II) — a systematic program exploring how nuclear matter behaves across a range of collision energies. The eTOF was specifically essential for the fixed-target portion of BES II, which probed center-of-mass energies between 3.0 and 7.7 GeV per nucleon pair, a regime unreachable with colliding beams alone. These low-energy collisions are key to mapping the phase diagram of quantum chromodynamics, the theory governing the strong nuclear force.\n\nAccording to a new paper detailing the system's performance, the eTOF achieved a time resolution of approximately 70 picoseconds and a particle identification efficiency of about 70%, both in line with the project's design specifications. The detector hardware and readout electronics were originally developed for the CBM experiment at Germany's Facility for Antiproton and Ion Research (FAIR) and were adapted for use at STAR. The paper provides a comprehensive account of the system's geometrical layout, acceptance, calibration procedures, hit reconstruction methods, and particle identification capabilities — offering a technical benchmark for future detector projects in heavy-ion physics.",
      "category": "physics",
      "breaking": false,
      "importance": 4,
      "sourceUrl": "https://arxiv.org/abs/2602.16828",
      "sourceName": "arXiv Physics",
      "publishedAt": "2026-02-20T06:46:58.135Z"
    }
  ]
}