{
  "lastUpdated": "2026-02-20T07:09:05.233Z",
  "count": 8,
  "articles": [
    {
      "id": "ps-1771571278560-0toeb0",
      "headline": "Bitcoin Mining Difficulty Surges 15%, Largest Jump in Four Years",
      "subheadline": "Network difficulty reaches 144.4T as hashrate recovers to 1 ZH/s, even as miners face multi-year low revenues",
      "body": "Bitcoin's mining difficulty has spiked 15% in a single adjustment — the largest increase since 2021 — climbing to 144.4 trillion as the network's total hashrate recovered to approximately 1 zettahash per second. The surge comes despite a prolonged slump in bitcoin's price that has pushed miner revenue per unit of computing power, known as hashprice, to multi-year lows.\n\nThe difficulty adjustment, a built-in mechanism that recalibrates roughly every two weeks to maintain consistent block times, signals that significant new mining capacity has come online in recent weeks. The recovery to the 1 ZH/s threshold represents a remarkable commitment of computational resources at a time when profit margins across the industry are under severe pressure.\n\nThe divergence between surging hashrate and depressed hashprice underscores a deepening squeeze on smaller and less efficient mining operations. While large-scale miners with access to cheap energy and next-generation hardware can weather thin margins, the economic environment may accelerate industry consolidation. The jump also suggests that miners are betting on a future price recovery, choosing to expand capacity now rather than retreat — a pattern consistent with previous market cycles where hashrate growth has preceded, rather than followed, sustained price rallies.",
      "category": "markets",
      "breaking": false,
      "importance": 5,
      "imageUrl": "https://picsum.photos/seed/539/1200/630",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/bitcoin-difficulty-jumps-15-largest-increase-since-2021-despite-price-slump",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T07:07:58.560Z"
    },
    {
      "id": "ps-1771571286975-6bs05q",
      "headline": "General Catalyst Pledges $5B to India, Quintupling Its Prior Commitment",
      "subheadline": "The venture giant's five-year investment plan marks a dramatic escalation from its earlier $500M–$1B earmark for the country.",
      "body": "General Catalyst has announced a $5 billion investment commitment to India over the next five years, representing a fivefold to tenfold increase over its previous allocation of $500 million to $1 billion for the market.\n\nThe pledge signals deepening confidence among top-tier Silicon Valley firms in India's startup ecosystem, which has matured rapidly as a destination for global venture capital. India's combination of a massive consumer base, growing digital infrastructure, and an expanding pool of technical talent has made it one of the most competitive venture markets outside the United States and China.\n\nThe scale of General Catalyst's commitment places it among the largest single-firm pledges to the Indian market and is likely to intensify competition among global venture firms jockeying for access to the country's most promising startups. The move comes as India's technology sector continues to produce companies with significant scale across fintech, enterprise software, consumer internet, and artificial intelligence — sectors where General Catalyst has deep portfolio expertise globally.",
      "category": "business",
      "breaking": false,
      "importance": 6,
      "imageUrl": "https://picsum.photos/seed/407/1200/630",
      "sourceUrl": "https://techcrunch.com/2026/02/19/general-catalyst-commits-5b-to-india-over-five-years/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-20T07:08:06.975Z"
    },
    {
      "id": "ps-1771571296644-7zwou6",
      "headline": "Fostrom Launches IoT Cloud Platform to Simplify Device Fleet Management",
      "subheadline": "Founded by vertical farming veterans, the platform offers typed schemas, WASM-based actions, and a novel DuckDB data layer",
      "body": "Fostrom, a new IoT cloud platform built by developers Arjun and Sid, has launched in technical preview with the goal of eliminating the infrastructure burden that slows down connected device projects.\n\nThe platform emerged from direct experience. While building a fully automated indoor vertical farm at a previous startup, the founders found themselves spending more time wrestling with IoT infrastructure than writing actual automation logic. Fostrom is their answer: a managed platform offering device SDKs in Python, JavaScript, and Elixir, along with typed schemas, per-device mailboxes, programmable actions, and deployment across four global regions for reduced latency.\n\nThe technical architecture reflects years of iteration. Fostrom uses a Go-to-Elixir bridge that executes JavaScript code in WebAssembly for programmable actions, and a Rust-based device agent that runs locally alongside their SDKs. But the team's most significant design decision involved data. After years of experimenting with distributed databases, they concluded that fleet data fundamentally requires a SQL database to achieve the consistency, queryability, and operational correctness IoT systems demand. They built a replicated multi-tenant data layer on DuckDB, which they say dramatically simplified the broader codebase while concentrating operational complexity in manageable areas. The device agent, called DeviceKit, is open source on GitHub. A CLI tool and automatic device monitoring are next on the roadmap.",
      "category": "tech",
      "breaking": false,
      "importance": 4,
      "imageUrl": "https://picsum.photos/seed/346/1200/630",
      "sourceUrl": "https://fostrom.io/",
      "sourceName": "Hacker News",
      "publishedAt": "2026-02-20T07:08:16.644Z"
    },
    {
      "id": "ps-1771571306077-5kyudi",
      "headline": "Neo Launches Residency Program With $750K Investment on Uncapped SAFE Terms",
      "subheadline": "Ali Partovi's accelerator challenges Y Combinator model with founder-friendly deal structure and $40K student grants",
      "body": "Neo, the accelerator founded by tech investor Ali Partovi, is introducing a Residency program that aims to reshape how early-stage startups raise their first institutional capital. The program offers $750,000 through an uncapped SAFE — a notably founder-friendly structure that avoids setting a valuation cap, potentially preserving significantly more equity for founders compared to traditional accelerator deals.\n\nThe move positions Neo as a direct challenge to established programs like Y Combinator, which typically take a fixed equity stake in exchange for funding and mentorship. By using uncapped SAFEs, Neo is betting that more favorable terms will attract top-tier founders who might otherwise bootstrap or seek alternative funding paths.\n\nAlongside the startup investment, Neo is also offering $40,000 no-strings-attached grants to college students — funding that requires no equity surrender or repayment. The dual approach signals Partovi's broader ambition to build a pipeline from campus to company, identifying promising technical talent before they enter the traditional venture ecosystem. For a startup landscape increasingly defined by debates over dilution and founder leverage, Neo's terms represent a meaningful shift in how accelerators compete for the best deals.",
      "category": "business",
      "breaking": false,
      "importance": 5,
      "imageUrl": "https://picsum.photos/seed/402/1200/630",
      "sourceUrl": "https://techcrunch.com/2026/02/19/ali-partovis-neo-looks-to-upend-the-accelerator-model-with-low-dilution-terms/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-20T07:08:26.077Z"
    },
    {
      "id": "ps-1771571315702-c6qw4e",
      "headline": "Bitcoin Slides Toward $68,000 as U.S.-Iran Tensions Rattle Markets",
      "subheadline": "Gold surges as geopolitical risk drives investors toward safe havens; strategists warn of potential retest of 2024 lows",
      "body": "Bitcoin fell near the $68,000 mark on Thursday as escalating tensions between the United States and Iran dampened risk appetite across global markets. Gold prices jumped sharply as investors rotated into traditional safe-haven assets, underscoring a broad retreat from speculative positions.\n\nU.S. equities traded with a cautious tone as the geopolitical landscape darkened, with market participants reassessing exposure to risk assets. Several strategists have warned that the current environment could trigger a retest of 2024 lows for both crypto and equities before any sustained recovery takes hold. The combination of geopolitical uncertainty and fragile market sentiment has left traders reluctant to take on new positions.\n\nThe divergence between gold and bitcoin challenges the long-standing narrative that the cryptocurrency functions as a reliable store of value during periods of global instability. While gold has reasserted its role as the premier crisis hedge, bitcoin continues to trade more in line with risk assets like technology stocks. For crypto investors hoping for a decoupling from traditional markets, the current selloff serves as a reminder that in moments of genuine geopolitical stress, institutional capital still overwhelmingly favors established safe havens.",
      "category": "markets",
      "breaking": false,
      "importance": 6,
      "imageUrl": "https://picsum.photos/seed/526/1200/630",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/bitcoin-nears-usd68-000-gold-jumps-as-us-iran-tensions-return",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T07:08:35.702Z"
    },
    {
      "id": "ps-1771571323902-6dko90",
      "headline": "Bitcoin Posts Worst 50-Day Start to a Year on Record",
      "subheadline": "The cryptocurrency is on track for its first-ever consecutive monthly declines in January and February.",
      "body": "Bitcoin has recorded its weakest opening stretch to any calendar year, with the first 50 days of 2026 marking an unprecedented losing streak for the world's largest cryptocurrency.\n\nThe downturn puts Bitcoin on course for back-to-back monthly declines in January and February — a combination that has never occurred in the asset's history. The milestone underscores a sharp reversal in sentiment after a period of bullish momentum that characterized much of 2025, when institutional adoption and favorable regulatory signals had propelled prices higher.\n\nThe record-setting slump raises questions about whether the broader crypto rally has stalled or whether the decline represents a temporary pullback within a longer uptrend. Analysts will be watching closely to see if Bitcoin can recover in the weeks ahead or if the selling pressure signals a more sustained shift in market dynamics. For investors who entered positions during last year's rally, the historic weakness serves as a stark reminder of the asset's persistent volatility despite its growing mainstream acceptance.",
      "category": "markets",
      "breaking": false,
      "importance": 5,
      "imageUrl": "https://picsum.photos/seed/505/1200/630",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/bitcoin-logs-worst-ever-start-to-a-year-through-first-50-days",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T07:08:43.902Z"
    },
    {
      "id": "ps-1771571333651-fuicr9",
      "headline": "Metaplanet CEO Defends Firm's Bitcoin Strategy Amid Growing Scrutiny",
      "subheadline": "Simon Gerovich pushes back on critics questioning the Japanese firm's disclosure standards, options model, and core hotel business.",
      "body": "Metaplanet CEO Simon Gerovich has publicly addressed mounting criticism of the company's bitcoin-centric corporate strategy, defending its transparency practices, options trading model, and the viability of its underlying hotel operations.\n\nThe Tokyo-listed firm, which has drawn frequent comparisons to MicroStrategy for its aggressive bitcoin accumulation, has faced questions from skeptics who argue its disclosure standards fall short and that its use of options trading to fund bitcoin purchases introduces poorly understood risk. Gerovich countered that the company meets or exceeds regulatory requirements and that its options strategy is a disciplined approach to building bitcoin reserves without excessive dilution of existing shareholders.\n\nGerovich also addressed concerns about Metaplanet's hotel business, which some critics have characterized as a shell operation overshadowed by the firm's bitcoin treasury focus. He maintained that hotel operations remain a functioning part of the company's portfolio, even as bitcoin has become the primary driver of investor interest and share price performance. The defense comes as a growing number of publicly traded companies worldwide adopt bitcoin treasury strategies, raising broader questions about corporate governance, risk disclosure, and whether traditional valuation frameworks apply to firms whose market capitalizations are increasingly tied to cryptocurrency holdings rather than operating fundamentals.",
      "category": "markets",
      "breaking": false,
      "importance": 4,
      "imageUrl": "https://picsum.photos/seed/524/1200/630",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/metaplanet-ceo-rebuts-critics-over-bitcoin-strategy-and-transparency",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T07:08:53.651Z"
    },
    {
      "id": "ps-1771571345233-yas6pz",
      "headline": "Developer Unlocks Hidden MEMS Accelerometer in Apple Silicon MacBooks",
      "subheadline": "Undocumented motion sensor accessed through IOKit, revealing hardware Apple never publicly exposed to developers",
      "body": "A developer has found a way to read data from an undocumented MEMS accelerometer embedded in Apple Silicon MacBooks, using Apple's IOKit framework to access hardware the company never officially made available to third-party software.\n\nThe project, published on GitHub by developer Olvvier, demonstrates how to interface directly with the motion sensor that Apple includes in its M-series laptops but has kept hidden from its public developer APIs. MEMS (Micro-Electro-Mechanical Systems) accelerometers detect orientation and movement, and were famously accessible on older Intel-based MacBooks — enabling features like the Sudden Motion Sensor that parked hard drive heads during a fall. Apple quietly removed public access to these sensors in the transition to Apple Silicon, even as the hardware remained present.\n\nThe discovery highlights a recurring theme in Apple's hardware ecosystem: the gap between what the silicon can do and what Apple chooses to expose. By probing IOKit — the low-level framework that manages hardware communication in macOS — the developer was able to locate and read accelerometer data without any official documentation or supported API. The approach could enable applications ranging from screen rotation utilities to motion-based input, though relying on undocumented interfaces means Apple could break compatibility at any time. The project underscores the ingenuity of the reverse-engineering community in surfacing capabilities that hardware manufacturers leave on the table.",
      "category": "tech",
      "breaking": false,
      "importance": 4,
      "imageUrl": "https://picsum.photos/seed/326/1200/630",
      "sourceUrl": "https://github.com/olvvier/apple-silicon-accelerometer",
      "sourceName": "Hacker News",
      "publishedAt": "2026-02-20T07:09:05.233Z"
    }
  ]
}