{
  "lastUpdated": "2026-02-21T16:33:21.627Z",
  "count": 50,
  "articles": [
    {
      "id": "ps-1771691519588-b7vi",
      "slug": "trump-raises-global-tariffs-to-15-one-day-after-supreme-cour",
      "headline": "Trump Raises Global Tariffs to 15% One Day After Supreme Court Setback",
      "subheadline": "The president escalated his trade offensive within 24 hours of the court striking down his previous import levies",
      "body": "President Donald Trump announced Saturday that he would impose a 15% tariff on all goods entering the United States, escalating a trade offensive just one day after the Supreme Court struck down his earlier import taxes as unconstitutional.\n\nThe move marked a rapid intensification even by Trump's own standards. On Friday, the president had responded to the high court's ruling by announcing a replacement 10% levy on all global imports. By Saturday, he had already revised that figure upward to 15%, posting the announcement on his Truth Social platform. The new tariffs are set to take effect on Tuesday, February 24.\n\nThe Supreme Court's decision to invalidate Trump's previous tariff regime represented a rare institutional check on the president's trade authority. But the administration moved swiftly to reassert its position, leveraging what appears to be an alternative legal mechanism to reimpose broad import duties. Under the current framework, the 15% tariffs can remain in place for approximately five months before the White House must seek formal approval from Congress — a timeline that could set up a significant legislative battle later this year.\n\nThe announcement injects fresh uncertainty into global trade at a moment when businesses and trading partners were already recalibrating in response to the court's ruling. A blanket 15% levy on all imports would affect virtually every sector of the American economy, from consumer electronics and automobiles to agricultural products and raw materials. Economists have repeatedly warned that broad-based tariffs of this magnitude tend to raise costs for domestic consumers and businesses, even as they aim to pressure foreign exporters.\n\nThe rapid escalation — from court defeat to a higher tariff rate in roughly 24 hours — underscores the degree to which trade policy remains the administration's preferred instrument of economic leverage. With the five-month clock now ticking, attention will turn to whether congressional Republicans are willing to codify the president's tariffs into law or whether the levies will face another legal or legislative challenge before summer's end.",
      "category": "breaking",
      "importance": 9,
      "tags": [
        "Trump",
        "tariffs",
        "Supreme Court",
        "trade policy",
        "US economy"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/1a2d/live/537ff930-6139-11ee-b101-6f93d6dfbcc2.png",
      "sourceUrl": "https://www.bbc.com/news/articles/cn8z48xwqn3o?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-21T16:31:59.588Z"
    },
    {
      "id": "ps-1771691535783-8cj8",
      "slug": "greenland-ice-sheet-extreme-melt-events-accelerating-at-reco",
      "headline": "Greenland Ice Sheet Extreme Melt Events Accelerating at Record Pace",
      "subheadline": "Meltwater production has surged more than sixfold since 1990, with affected area growing by 2.8 million km² per decade",
      "body": "Extreme melting episodes across the Greenland ice sheet have grown dramatically more frequent, expansive, and intense over the past three decades, according to new research published in Nature Communications. The study, led by scientists at the University of Barcelona, quantifies for the first time the compounding acceleration of Greenland's most severe melt events — a trend with significant implications for global sea level rise.\n\nSince 1990, the area affected by extreme melting episodes has expanded at a rate of 2.8 million square kilometers per decade, the researchers found. Even more striking, the volume of meltwater generated during these events has increased more than sixfold, climbing from 12.7 gigatons per decade to 82.4 gigatons per decade. A single gigaton of water is roughly equivalent to 400,000 Olympic swimming pools, meaning the additional meltwater now produced during extreme episodes represents an enormous transfer of mass from ice to ocean.\n\nThe findings underscore that climate change is not simply raising average melt rates on the ice sheet but is fundamentally reshaping the character of its most destructive episodes. Extreme melt events — driven by atmospheric heat domes, warm air intrusions, and increasingly common summer temperature spikes over the Arctic — now cover vastly more of the ice sheet's surface and liberate far greater quantities of water when they occur. This matters because extreme events contribute disproportionately to total ice loss; a handful of intense melt days can account for a significant share of an entire season's runoff.\n\nGreenland's ice sheet contains enough frozen water to raise global sea levels by approximately 7.4 meters if it were to melt entirely. While that scenario remains distant, the accelerating trend documented in this study suggests that projections of Greenland's contribution to sea level rise over the coming century may need to be revised upward. Current estimates from the Intergovernmental Panel on Climate Change attribute roughly 0.7 millimeters of annual sea level rise to Greenland, but the intensification of extreme melt episodes could push that figure higher in coming decades.\n\nThe University of Barcelona team's work adds to a growing body of evidence that the Arctic is responding to warming in nonlinear ways, with feedback loops — such as reduced surface reflectivity from meltwater pooling on ice — amplifying the effects of rising temperatures. As the planet continues to warm, the frequency and magnitude of these extreme melt events are expected to increase further, compounding risks for coastal communities worldwide.",
      "category": "science",
      "importance": 7,
      "tags": [
        "Greenland",
        "ice sheet",
        "climate change",
        "sea level rise",
        "Arctic",
        "extreme melt events"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1510254497705-baa8e93b6a79?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw2fHxHcmVlbmxhbmQlMjBpY2UlMjBzaGVldHxlbnwwfDB8fHwxNzcxNjg5NzUwfDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://phys.org/news/2026-02-greenland-ice-surges-unprecedentedly.html",
      "sourceName": "Phys.org",
      "publishedAt": "2026-02-21T16:32:15.783Z"
    },
    {
      "id": "ps-1771691550147-nr14",
      "slug": "niobium-rhenium-alloy-shows-signs-of-elusive-triplet-superco",
      "headline": "Niobium-Rhenium Alloy Shows Signs of Elusive Triplet Superconductivity",
      "subheadline": "If confirmed, the material could carry both electricity and spin with zero resistance — a potential game-changer for quantum computing",
      "body": "Physicists at the Norwegian University of Science and Technology (NTNU) and collaborators in Italy report that a niobium-rhenium alloy, NbRe, exhibits behavior consistent with triplet superconductivity — a long-sought state of matter that could dramatically improve the stability and energy efficiency of quantum computers. The findings, published in Physical Review Letters and selected as an editor's recommendation, represent what researchers describe as a potential breakthrough in quantum materials science.\n\nUnlike conventional \"singlet\" superconductors, which transmit electrical current with zero resistance but cannot carry electron spin, a triplet superconductor would transport both charge and spin without energy loss. That distinction matters enormously for quantum computing and spintronics, where spin serves as the fundamental carrier of information. \"The fact that triplet superconductors have spin has an important consequence. We can now transport not only electrical currents but also spin currents with absolutely zero resistance,\" said Professor Jacob Linder of NTNU's Department of Physics, who co-authored the study.\n\nThe research team, which included experimental physicists from Italian institutions, detected that NbRe behaves in ways that diverge sharply from conventional superconductors, specifically through inverse spin-valve effects in the noncentrosymmetric crystal structure of the alloy. Both niobium and rhenium are rare metals, but the alloy offers a practical advantage over other triplet superconductor candidates: it superconducts at approximately 7 Kelvin, compared to temperatures near 1 Kelvin required by competing materials. While still far below room temperature, 7 Kelvin is significantly easier to achieve and maintain in laboratory and commercial settings.\n\nLinder cautioned that the result requires independent verification. \"It is still too early to conclude once and for all whether the material is a triplet superconductor. Among other things, the finding must be verified by other experimental groups,\" he said. Nonetheless, the data are striking enough that the team is confident the anomalous behavior cannot be explained by singlet superconductivity alone.\n\nThe implications extend well beyond the laboratory. Quantum computers today face a critical bottleneck: computational errors caused by instability in quantum states. Triplet superconductors could provide a more robust platform for quantum operations by leveraging spin-based information transfer that is inherently protected from certain types of noise. If future experiments confirm the NTNU findings, NbRe could become a foundational material for next-generation quantum processors and ultra-low-power spintronic devices — technologies that have remained largely theoretical for decades.",
      "category": "physics",
      "importance": 7,
      "tags": [
        "triplet superconductor",
        "quantum computing",
        "spintronics",
        "NbRe alloy",
        "NTNU",
        "superconductivity"
      ],
      "imageUrl": "https://www.sciencedaily.com/images/1920/golden-quantum-computer-machine.webp",
      "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000252.htm",
      "sourceName": "Science Daily",
      "publishedAt": "2026-02-21T16:32:30.147Z"
    },
    {
      "id": "ps-1771691565106-yo1a",
      "slug": "openai-flagged-suspected-shooter-s-chats-but-chose-not-to-al",
      "headline": "OpenAI Flagged Suspected Shooter's Chats but Chose Not to Alert Police",
      "subheadline": "Internal debate at the AI company preceded a mass shooting in Canada that left eight dead, raising urgent questions about tech firms' duty to warn",
      "body": "OpenAI's internal monitoring systems flagged disturbing conversations about gun violence by the teenager who allegedly carried out a mass shooting in Tumbler Ridge, Canada, but the company ultimately decided against contacting law enforcement, according to a Wall Street Journal report.\n\nJesse Van Rootselaar, 18, who is accused of killing eight people in the attack, had used ChatGPT in ways that triggered the company's misuse detection tools. Her account was banned in June 2025, and OpenAI staff debated whether to escalate the matter to Canadian police. The company concluded that Van Rootselaar's activity did not meet its internal threshold for law enforcement referral. OpenAI contacted Canadian authorities only after the shooting occurred.\n\nThe revelation intensifies scrutiny over what obligations AI companies bear when their platforms surface potentially dangerous behavior. Unlike regulated sectors such as healthcare or education, where professionals face mandatory reporting requirements, AI firms currently operate without clear legal frameworks governing when — or whether — they must alert authorities to threats discovered in user interactions. The case is likely to fuel calls from lawmakers and safety advocates for explicit duty-to-warn standards in the AI industry.\n\nVan Rootselaar's online activity extended well beyond ChatGPT. She reportedly built a game on Roblox — a platform popular with children — that simulated a mass shooting at a mall, and she posted about firearms on Reddit. Local police were also aware of her instability, having previously responded to her family's home after she started a fire while under the influence of drugs. The breadth of warning signs across multiple platforms underscores the fragmented nature of threat detection online, where no single company or agency holds a complete picture of a user's behavior.\n\nOpenAI and its competitors already face mounting legal pressure over the influence of large language model chatbots on vulnerable users. Multiple lawsuits allege that AI chat transcripts have encouraged self-harm or suicide, and the Tumbler Ridge case adds a new dimension: whether companies can be held responsible not for what their models said, but for what they knew and chose not to report. As AI systems become more deeply embedded in daily life, the gap between technological capability to detect threats and institutional willingness to act on them is emerging as one of the industry's most consequential policy challenges.",
      "category": "tech",
      "importance": 8,
      "tags": [
        "OpenAI",
        "ChatGPT",
        "mass shooting",
        "AI safety",
        "Canada",
        "law enforcement",
        "content moderation",
        "duty to warn"
      ],
      "imageUrl": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=1024",
      "sourceUrl": "https://techcrunch.com/2026/02/21/openai-debated-calling-police-about-suspected-canadian-shooters-chats/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-21T16:32:45.106Z"
    },
    {
      "id": "ps-1771691579918-kce1",
      "slug": "mexico-canada-dodge-10-us-tariff-after-supreme-court-ruling",
      "headline": "Mexico, Canada Dodge 10% US Tariff After Supreme Court Ruling",
      "subheadline": "USMCA trade agreement review poses larger threat to North American economic integration than struck-down levies",
      "body": "Mexico and Canada have secured exemptions from the 10% U.S. tariff levy following the Supreme Court's landmark decision to strike down a broad swath of tariffs imposed under the Trump administration, but trade analysts warn that a far more consequential threat to North American commerce lies ahead.\n\nThe court's ruling offers immediate relief to America's two largest trading partners, whose economies are deeply intertwined with the United States through complex cross-border supply chains in automotive manufacturing, agriculture, and energy. The three nations collectively account for roughly $1.6 trillion in annual trade, making the North American corridor one of the most economically significant in the world.\n\nYet the exemption may prove to be a temporary reprieve. The United States-Mexico-Canada Agreement, the trilateral trade pact that replaced NAFTA in 2020, faces a mandatory joint review that could reshape the terms of continental commerce. The review process gives all three governments an opportunity to renegotiate or potentially withdraw from the agreement, raising the specter of far more disruptive changes than any single tariff action. Trade experts have flagged the review as a pivotal moment that could either reinforce or fundamentally alter the integrated supply chains that North American manufacturers have built over three decades.\n\nFor Mexico, the stakes are particularly acute. The country has become a linchpin of nearshoring strategies as multinational companies have sought to diversify away from Asian manufacturing. Canada, meanwhile, remains the single largest supplier of energy to the United States, a relationship that tariff uncertainty has repeatedly threatened to destabilize. Business groups in both countries had lobbied intensively for the exemptions, arguing that tariffs on USMCA partners would effectively function as a tax on American consumers and manufacturers who depend on cross-border inputs.\n\nThe Supreme Court's broader tariff decision has redrawn the boundaries of executive trade authority, but the fate of North American economic integration now rests on the political dynamics surrounding the USMCA review. How the three governments approach those negotiations will likely determine whether the continent's trade architecture remains intact or enters a period of prolonged uncertainty that could ripple through global markets.",
      "category": "business",
      "importance": 7,
      "tags": [
        "USMCA",
        "tariffs",
        "Supreme Court",
        "trade policy",
        "Mexico",
        "Canada",
        "North American trade"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1486406146926-c627a92ad1ab?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwyfHxidXNpbmVzc3xlbnwwfDB8fHwxNzcxNjI4NTg2fDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-21/mexico-canada-get-exemption-to-10-us-levy-but-usmca-risk-looms",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-21T16:32:59.918Z"
    },
    {
      "id": "ps-1771691601543-3u0i",
      "slug": "ai-powered-bot-nets-150k-exploiting-prediction-market-pricin",
      "headline": "AI-Powered Bot Nets $150K Exploiting Prediction Market Pricing Gaps",
      "subheadline": "Automated system executed nearly 9,000 trades on short-term crypto contracts, raising questions about the future of crowd-sourced probability markets",
      "body": "An automated trading bot has reportedly generated nearly $150,000 by exploiting fleeting pricing inefficiencies in short-term cryptocurrency prediction markets — executing 8,894 trades without human intervention and highlighting the growing role of AI-driven strategies in reshaping these nascent venues.\n\nThe strategy, which circulated widely on social media this week, targeted a deceptively simple flaw in five-minute bitcoin and ether prediction contracts on platforms like Polymarket. In a properly functioning market, the price of a \"Yes\" contract and a \"No\" contract on a binary outcome should always sum to exactly $1.00. But thin liquidity, rapid price swings in the underlying asset, and order-book imbalances can briefly push that combined price below $1.00 — sometimes to $0.97 or less. By purchasing both sides simultaneously during these dislocations, the bot locked in a guaranteed profit of roughly 1.5% to 3% per trade when the contract settled. At an estimated $1,000 deployed per round-trip, that translated to approximately $16.80 in profit per execution — trivial in isolation, but compounding to a six-figure return across thousands of repetitions.\n\nThe opportunity persists in part because prediction markets remain too shallow for institutional players to exploit at scale. Typical five-minute bitcoin contracts on Polymarket carry order-book depth of just $5,000 to $15,000 per side during active sessions — orders of magnitude thinner than perpetual swap books on exchanges like Binance or Bybit. A firm attempting to deploy $100,000 per trade would obliterate the available liquidity and erase any edge. Blockchain-based settlement mechanics, transaction costs, and operational complexity further deter large desks, leaving the field to nimble retail traders comfortable sizing positions in the low four figures.\n\nMore sophisticated variants of the strategy are already emerging. Some AI-driven systems now compare implied probability distributions from options markets — which encode collective expectations about where an asset will trade — against prediction market pricing on the same outcome. When discrepancies appear, even of just a few percentage points, automated systems can buy the underpriced side. Machine learning tools have lowered the barrier to building such strategies, enabling traders to test variations, optimize execution thresholds, and adapt to shifting volatility regimes without hand-coding every parameter.\n\nThe trend raises a structural question for prediction markets, which were designed to aggregate human beliefs into crowd-sourced probabilities about real-world events. As a growing share of volume shifts toward cross-market arbitrage bots that hold no view on actual outcomes, these platforms risk becoming mirrors of the broader derivatives market rather than independent probability signals. Arbitrageurs may improve pricing efficiency in the short term by closing gaps across venues, but the phenomenon echoes a familiar pattern in crypto markets: inefficiencies are discovered, exploited, and competed away with remarkable speed. The $150,000 windfall may already represent a closing window.",
      "category": "markets",
      "importance": 6,
      "tags": [
        "prediction markets",
        "AI trading",
        "Polymarket",
        "algorithmic trading",
        "crypto arbitrage",
        "automated bots"
      ],
      "imageUrl": "https://cdn.sanity.io/images/s3y3vcno/production/fb1924e8b59d60f24b3f5e9b52c6f301394aace4-1920x1080.jpg?auto=format&amp;w=960&amp;h=540&amp;crop=focalpoint&amp;fit=clip&amp;q=75&amp;fm=jpg",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/21/how-ai-is-helping-retail-traders-exploit-prediction-market-glitches-to-make-easy-money",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-21T16:33:21.543Z"
    },
    {
      "id": "ps-1771690631972-1gz3",
      "slug": "supreme-court-strikes-down-trump-tariffs-president-fires-bac",
      "headline": "Supreme Court Strikes Down Trump Tariffs; President Fires Back With New 10% Levy",
      "subheadline": "In a 6-3 ruling, justices held Trump exceeded his authority — but the president moved within hours to reimpose duties under a different law",
      "body": "The U.S. Supreme Court ruled Friday that President Donald Trump overstepped his constitutional authority by imposing sweeping global tariffs under a 1977 emergency powers law, delivering a landmark rebuke of his trade agenda — only for Trump to immediately sign a proclamation establishing a new 10% tariff under a separate, never-before-used statute.\n\nThe 6-3 decision, authored by Chief Justice John Roberts, held that the International Emergency Economic Powers Act (IEEPA) did not grant the president the power to levy tariffs. \"Had Congress intended to convey the distinct and extraordinary power to impose tariffs, it would have done so expressly,\" Roberts wrote. Two Trump-appointed justices — Amy Coney Barrett and Neil Gorsuch — joined the majority alongside the court's three liberal members, while Clarence Thomas, Brett Kavanaugh, and Samuel Alito dissented. Trump responded with fury, calling the Republican appointees who ruled against him \"fools and lap dogs\" and declaring himself \"absolutely ashamed\" of their votes.\n\nThe ruling potentially opens the door to billions of dollars in refunds. The government has collected at least $130 billion in IEEPA-based tariffs, according to federal data, and hundreds of companies — from Costco to Bumble Bee — have already filed lawsuits seeking reimbursement. Illinois Governor JB Pritzker sent Trump an invoice for nearly $9 billion, estimating the tariffs cost each family in his state $1,700. However, experts cautioned that refunds could take years, with the logistics likely falling to the Court of International Trade. \"Curb your enthusiasm,\" warned Diane Swonk, chief economist at KPMG US, noting that litigation costs could prove prohibitive for smaller businesses.\n\nTrump's countermove came swiftly. Within hours of the ruling, he signed a proclamation invoking Section 122 of the Trade Act of 1974, which permits tariffs of up to 15% for 150 days before requiring congressional approval. The new 10% levy takes effect February 24 and includes exemptions for certain minerals, agricultural products, pharmaceuticals, and some electronics. Canada and Mexico will retain their exemptions under the USMCA free trade agreement. Notably, countries that had previously negotiated trade deals with the U.S. — including the United Kingdom, India, and the European Union — will now face the blanket 10% rate instead of their individually negotiated terms, though the administration expects them to honor existing concessions.\n\nWall Street responded positively to the Supreme Court decision, with the S&P 500 closing up roughly 0.7%. But analysts warned the trade landscape has grown more uncertain, not less. The administration is expected to explore additional legal tools, including Section 232 and Section 301, which authorize tariffs on national security and unfair trade grounds. Existing tariffs on steel, aluminum, and automobiles imposed under those authorities were unaffected by Friday's ruling. \"Things have only gotten more complicated and more messy today,\" said Geoffrey Gertz, a senior fellow at the Center for a New American Security. International reaction was measured, with the European Commission saying it was \"analysing carefully\" and French President Emmanuel Macron praising the American system of checks and balances while signaling France would assess the implications of the new levy.",
      "category": "breaking",
      "importance": 9,
      "tags": [
        "Supreme Court",
        "tariffs",
        "Trump",
        "trade policy",
        "IEEPA",
        "Section 122",
        "US economy"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/c962/live/48a8efe0-0eb0-11f1-801d-ed3cff6bf876.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/cn8146l0n55o?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-21T16:17:11.972Z"
    },
    {
      "id": "ps-1771688839329-fjl4",
      "slug": "new-microscopy-method-reveals-cellular-detail-in-vivid-color",
      "headline": "New Microscopy Method Reveals Cellular Detail in Vivid Color at Nanoscale",
      "subheadline": "Hybrid imaging technique merges two powerful microscopy approaches to map both cell architecture and protein locations simultaneously",
      "body": "A team of scientists has unveiled a novel microscopy technique that combines the strengths of two established imaging methods, enabling researchers to visualize the internal structure of cells and pinpoint the locations of individual proteins — all in vivid color and at nanometer-scale resolution.\n\nThe approach introduces a new contrast mechanism for biological imaging that bridges a longstanding gap in microscopy. Traditional methods have generally forced researchers to choose between techniques that reveal fine structural detail and those that identify specific molecular components. The new hybrid method eliminates that trade-off, delivering both architectural and molecular information in a single imaging session. The result is an unprecedented view of cellular interiors, with proteins mapped against the backdrop of organelles and membranes at resolutions previously achievable only by sacrificing one form of information for the other.\n\nAt the heart of the technique is a contrast mechanism that allows nanometer-resolution imaging without the conventional compromises between structural and functional data. While electron microscopy has long offered extraordinary spatial resolution, it typically renders cells in grayscale and struggles to distinguish specific biomolecules. Fluorescence microscopy, by contrast, excels at tagging and locating proteins but lacks the resolution to capture surrounding ultrastructure in fine detail. By merging elements of both paradigms, the new method produces richly colored, high-resolution maps of cellular landscapes.\n\nThe implications extend across cell biology, neuroscience, and biomedical research. Researchers studying how proteins organize within cellular compartments — or how that organization goes awry in disease — stand to benefit from a tool that simultaneously answers \"what is here?\" and \"what does it look like?\" at the nanoscale. The ability to co-register structural and molecular data in a single experiment could accelerate discoveries in areas ranging from cancer biology to neurodegeneration, where the spatial relationships between proteins and cellular structures are thought to play critical roles.\n\nThe technique represents a meaningful advance in the broader push toward multimodal imaging, a field that has gained momentum as researchers seek ever more complete pictures of biological systems. Further development could expand the palette of detectable molecules and push resolution limits even further, potentially opening new windows into the molecular machinery of life.",
      "category": "science",
      "importance": 6,
      "tags": [
        "microscopy",
        "bioimaging",
        "cell biology",
        "nanoscale imaging",
        "protein mapping"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1531837404483-bdbd0d209ec1?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxN3x8bWljcm9zY29weSUyMGJpb2ltYWdpbmd8ZW58MHwwfHx8MTc3MTY4MTY0Mnww&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://phys.org/news/2026-02-microscopy-technique-scientists-cells-unprecedented.html",
      "sourceName": "Phys.org",
      "publishedAt": "2026-02-21T15:47:19.329Z"
    },
    {
      "id": "ps-1771688884008-ig89",
      "slug": "u-s-reportedly-accepts-iran-s-demand-to-continue-uranium-enr",
      "headline": "U.S. Reportedly Accepts Iran's Demand to Continue Uranium Enrichment",
      "subheadline": "Iranian state-linked news agency cites diplomat, signaling potential breakthrough in stalled nuclear negotiations",
      "body": "American negotiators have agreed to allow Iran to maintain its uranium enrichment program, according to a report from Iran's semi-official Iranian Students' News Agency (ISNA), citing an unnamed Iranian diplomat. If confirmed, the concession would represent a significant shift in Washington's longstanding posture toward Tehran's nuclear activities and could reshape the trajectory of diplomatic talks between the two nations.\n\nThe claim, reported by Bloomberg on February 21, suggests that U.S. officials accepted what Iran has long described as a non-negotiable red line: the right to enrich uranium on its own soil. Previous rounds of diplomacy, including the 2015 Joint Comprehensive Plan of Action, permitted limited enrichment under strict international monitoring, but the Trump administration's withdrawal from that deal in 2018 and subsequent \"maximum pressure\" campaign sought to curtail Iran's nuclear capabilities far more aggressively. Iran responded by steadily expanding its enrichment levels and stockpiles.\n\nThe reported development comes amid renewed diplomatic engagement between Washington and Tehran, though the precise framework and terms of any emerging agreement remain unclear. Western governments and nonproliferation experts have long warned that Iran's enrichment advances — which have reached 60 percent purity, a short technical step from weapons-grade material — make the diplomatic calculus increasingly urgent. Accepting continued enrichment, even with safeguards, would likely draw sharp criticism from Israel and hawkish lawmakers in Congress who have pushed for a complete dismantlement of Iran's enrichment infrastructure.\n\nNeither the U.S. State Department nor Iranian government officials have publicly confirmed the ISNA report. Semi-official Iranian media outlets have historically been used to float diplomatic trial balloons, and analysts caution that such claims can serve domestic political purposes in Tehran as much as they reflect the actual state of negotiations. The lack of independent verification means the report should be treated with considerable caution.\n\nStill, the claim underscores the difficult tradeoffs facing U.S. policymakers as they weigh the risks of a rapidly advancing Iranian nuclear program against the political costs of compromise. Any formal agreement that permits enrichment would likely need to include robust inspection regimes and limits on stockpile size and purity levels to win broader international support.",
      "category": "breaking",
      "importance": 8,
      "tags": [
        "Iran",
        "uranium enrichment",
        "nuclear diplomacy",
        "United States",
        "nonproliferation"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1652367235186-14566ce77705?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxOHx8SXJhbiUyMHVyYW5pdW0lMjBlbnJpY2htZW50fGVufDB8MHx8fDE3NzE2ODM0ODV8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-21/us-accepted-iran-s-bid-to-maintain-uranium-enrichment-isna-says",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-21T15:48:04.008Z"
    },
    {
      "id": "ps-1771687079490-wazj",
      "slug": "anthropic-and-openai-backers-clash-in-ai-fueled-congressiona",
      "headline": "Anthropic and OpenAI Backers Clash in AI-Fueled Congressional Race",
      "subheadline": "Dueling super PACs, funded by rival AI giants, are pouring millions into a New York district race over the future of AI regulation.",
      "body": "A New York congressional race has become the unlikely battleground for a proxy war between two factions of the artificial intelligence industry, with super PACs funded by Anthropic and OpenAI backers spending millions to shape the political future of AI regulation in the United States.\n\nPublic First Action, a political action committee that received a $20 million donation from Anthropic, announced it is spending $450,000 to support Alex Bores, a New York Assembly member running for the state's 12th congressional district, according to Bloomberg. Bores has been under sustained attack from Leading the Future, a rival super PAC armed with more than $100 million from donors including venture capital firm Andreessen Horowitz, OpenAI President Greg Brockman, AI search company Perplexity, and Palantir co-founder Joe Lonsdale. That group has already spent $1.1 million on ads targeting Bores.\n\nThe conflict centers on Bores' sponsorship of New York's RAISE Act, legislation that would require major AI developers to disclose their safety protocols and report serious incidents of misuse. Leading the Future, which opposes such regulatory measures, launched its campaign against Bores late last year as he announced his congressional bid. Public First Action, while also pro-AI, advocates for a regulatory framework built around transparency, safety standards, and public oversight — a philosophy more closely aligned with Anthropic's public positioning as a safety-focused AI lab.\n\nThe race offers a striking illustration of how the AI industry's internal divisions over regulation are spilling into electoral politics. Anthropic, which has generally positioned itself as more receptive to government oversight than some competitors, is now directly funding political infrastructure to counter lobbying from firms that favor a lighter regulatory touch. The spending gap remains significant — Leading the Future's war chest dwarfs Public First Action's current outlay — but the escalation signals that AI policy disputes are no longer confined to congressional hearings and think tank white papers.\n\nFor voters in New York's 12th district, the contest presents an unusual dynamic: both sides of the campaign are bankrolled by companies building the very technology at issue. The outcome could send an early signal about whether candidates who support AI safety legislation can survive well-funded industry opposition — or whether the sector's deepest pockets will set the terms of the debate heading into the 2026 midterms.",
      "category": "tech",
      "importance": 7,
      "tags": [
        "Anthropic",
        "OpenAI",
        "AI regulation",
        "super PAC",
        "RAISE Act",
        "2026 elections",
        "AI policy"
      ],
      "imageUrl": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2259873774.jpg?w=1024",
      "sourceUrl": "https://techcrunch.com/2026/02/20/anthropic-funded-group-backs-candidate-attacked-by-rival-ai-super-pac/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-21T15:17:59.490Z"
    },
    {
      "id": "ps-1771686163820-xtfv",
      "slug": "massive-medicare-study-ties-air-pollution-directly-to-alzhei",
      "headline": "Massive Medicare Study Ties Air Pollution Directly to Alzheimer's Risk",
      "subheadline": "Emory University researchers analyzed 27.8 million older Americans and found fine particulate matter harms the brain directly",
      "body": "Long-term exposure to fine particulate air pollution is associated with a significantly higher risk of developing Alzheimer's disease — and the danger appears to stem from pollution's direct effects on the brain rather than through intermediate chronic conditions, according to one of the largest studies ever conducted on the subject.\n\nResearchers led by Yanling Deng at Emory University examined Medicare records from more than 27.8 million Americans aged 65 and older, spanning nearly two decades from 2000 to 2018. Published February 17 in the open-access journal PLOS Medicine, the study tracked new Alzheimer's diagnoses against estimated air pollution exposure levels while controlling for co-occurring health conditions such as hypertension, stroke, and depression. The central finding: polluted air raises Alzheimer's risk largely by acting on the brain itself, not by first triggering cardiovascular or psychiatric illness that then leads to cognitive decline.\n\nThe distinction matters because scientists have long debated the mechanism linking air pollution to dementia. Fine particulate matter, known as PM2.5, is already established as a risk factor for stroke, high blood pressure, and depression — all of which are themselves associated with heightened dementia risk. The Emory team's analysis found that neither hypertension nor depression meaningfully amplified the pollution-Alzheimer's connection, suggesting those conditions are not the primary pathway. One notable exception emerged: individuals with a prior history of stroke did show heightened vulnerability to pollution's cognitive effects, pointing to an important intersection between environmental and vascular risk factors.\n\nWith roughly 57 million people living with Alzheimer's worldwide, the implications extend well beyond academic debate. The findings bolster the case that improving air quality could serve as a population-level strategy for reducing dementia rates, particularly among aging communities in polluted urban areas. The study was funded by the National Institutes of Health and adds to a growing body of evidence — including a 2025 review covering nearly 30 million people — that positions air pollution as a modifiable environmental driver of neurodegeneration.\n\nFor policymakers weighing the costs and benefits of emissions regulation, the research offers a stark new data point: the price of dirty air may include not just respiratory and cardiovascular disease, but the erosion of cognitive health across tens of millions of older adults.",
      "category": "science",
      "importance": 7,
      "tags": [
        "Alzheimer's disease",
        "air pollution",
        "PM2.5",
        "dementia",
        "Medicare",
        "public health",
        "Emory University"
      ],
      "imageUrl": "https://www.sciencedaily.com/images/1920/industrial-pollution-woman-children-future.webp",
      "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260220010836.htm",
      "sourceName": "Science Daily",
      "publishedAt": "2026-02-21T15:02:43.820Z"
    },
    {
      "id": "ps-1771686176751-ay6a",
      "slug": "ukrainian-sentenced-to-five-years-for-helping-north-koreans-",
      "headline": "Ukrainian Sentenced to Five Years for Helping North Koreans Infiltrate U.S. Firms",
      "subheadline": "Oleksandr Didenko managed over 870 stolen identities and ran 'laptop farms' to disguise workers' true locations",
      "body": "A federal court has sentenced 29-year-old Ukrainian national Oleksandr Didenko to five years in prison for orchestrating an identity theft operation that enabled North Korean workers to fraudulently obtain jobs at dozens of American companies — funneling wages back to Pyongyang's sanctioned nuclear weapons program.\n\nDidenko, a Kyiv resident, operated a website called Upworksell that served as a marketplace where overseas workers, including North Koreans, could purchase or rent stolen identities belonging to U.S. citizens. According to the Department of Justice, Didenko handled more than 870 stolen identities through the platform before the FBI seized it in 2024 and redirected its traffic to government servers. Polish authorities arrested Didenko, who was subsequently extradited to the United States, where he pleaded guilty to the charges.\n\nBeyond the identity marketplace, prosecutors said Didenko maintained so-called \"laptop farms\" — rooms filled with open laptops hosted at the homes of paid accomplices in California, Tennessee, and Virginia. The setup allowed North Korean operatives to remotely access the machines and perform their work as though they were physically present in the United States, evading geographic detection by employers.\n\nThe conviction is the latest in a growing series of prosecutions targeting what cybersecurity researchers have called North Korea's \"IT worker\" schemes. CrowdStrike reported a sharp increase last year in North Korean operatives infiltrating Western companies, typically in remote software development and engineering roles. Security experts have characterized these workers as a \"triple threat\": they violate U.S. sanctions, steal sensitive corporate data, and later extort victim companies by threatening to release proprietary information.\n\nThe schemes represent one of several revenue streams the North Korean regime relies on to circumvent international sanctions that have largely cut it off from the global financial system. Pyongyang-linked actors have also been known to impersonate recruiters and venture capitalists in social engineering campaigns targeting high-net-worth individuals, particularly in the cryptocurrency sector. The Justice Department's statement this week underscored the U.S. government's commitment to disrupting what officials describe as an escalating national security threat operating at the intersection of cybercrime and state-sponsored sanctions evasion.",
      "category": "breaking",
      "importance": 7,
      "tags": [
        "North Korea",
        "cybersecurity",
        "identity theft",
        "sanctions",
        "FBI",
        "IT worker schemes"
      ],
      "imageUrl": "https://techcrunch.com/wp-content/uploads/2026/02/laptop-farm-upscale.jpeg?resize=1200,802",
      "sourceUrl": "https://techcrunch.com/2026/02/20/ukrainian-man-jailed-for-identity-theft-that-helped-north-koreans-get-jobs-at-us-companies/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-21T15:02:56.751Z"
    },
    {
      "id": "ps-1771685310276-awnr",
      "slug": "blue-owl-s-1-4b-liquidation-sparks-2008-crisis-comparisons",
      "headline": "Blue Owl's $1.4B Liquidation Sparks 2008 Crisis Comparisons",
      "subheadline": "Private-equity firm's forced asset sale rattles markets; analysts debate whether private credit stress could trigger Fed intervention bullish for bitcoin",
      "body": "Blue Owl Capital was forced to liquidate $1.4 billion in assets this week to meet redemption demands from investors in a retail-focused private credit fund, sending its shares tumbling roughly 14% and dragging down major private-equity peers including Blackstone, Apollo Global, and Ares Management. The selloff has prompted prominent figures in finance to openly question whether the episode marks the opening act of a broader credit unraveling.\n\nFormer Pimco CEO Mohamed El-Erian described the situation as a potential \"canary-in-the-coalmine\" moment, drawing a direct parallel to August 2007, when two Bear Stearns hedge funds collapsed under the weight of subprime mortgage losses — an event widely regarded as the first tremor before the global financial crisis. El-Erian cautioned that while the risks could prove systemic, they do not yet appear to approach the magnitude of 2008. Still, he flagged artificial intelligence market excesses as a potential amplifier worth watching. Former Peter Lynch associate George Noble went further, suggesting Blue Owl could represent a \"first domino\" in a chain that substitutes private credit for subprime mortgages as the catalyst.\n\nBlue Owl shares have now fallen more than 50% year-over-year, though the broader stock market averages have so far absorbed the shock without significant damage. The private credit market, which has ballooned in recent years as banks retreated from certain lending activities, faces a structural vulnerability: many of its funds promised periodic liquidity to retail investors while holding inherently illiquid loan portfolios. When redemption requests spike, managers may be forced into fire sales — precisely the dynamic that played out this week.\n\nFor bitcoin, currently trading near $68,500, the implications cut in two directions. In the near term, tightening credit conditions tend to punish risk assets broadly. Bitcoin's 70% plunge during the early weeks of the Covid crisis in March 2020 offers a cautionary precedent. But the policy response that followed — trillions of dollars in Federal Reserve liquidity injections and near-zero interest rates — propelled bitcoin from below $4,000 to above $65,000 within roughly a year. The 2008 crisis itself birthed the cryptocurrency entirely; Satoshi Nakamoto embedded a headline about bank bailouts into Bitcoin's genesis block on January 3, 2009.\n\nWhether Blue Owl's troubles remain an isolated liquidity event or metastasize into something larger will likely depend on how concentrated the stress is within private credit and whether other funds face similar redemption pressures. If the 2007-2008 playbook repeats — initial credit stress, market denial, contagion, then massive central bank intervention — bitcoin's role as a perceived hedge against monetary debasement could once again come into sharp focus, even as the asset has evolved far beyond its anti-establishment origins into a trillion-dollar fixture of the institutional financial landscape.",
      "category": "markets",
      "importance": 7,
      "tags": [
        "Blue Owl Capital",
        "private credit",
        "bitcoin",
        "financial crisis",
        "Federal Reserve",
        "liquidity"
      ],
      "imageUrl": "https://cdn.sanity.io/images/s3y3vcno/production/55a653914fe42ded965f2d4bc255f5d6c7ebf699-3000x2000.jpg?auto=format&amp;w=960&amp;h=540&amp;crop=focalpoint&amp;fit=clip&amp;q=75&amp;fm=jpg",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/how-this-week-s-sign-of-private-credit-stress-could-set-stage-for-next-bitcoin-bull-run",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-21T14:48:30.276Z"
    },
    {
      "id": "ps-1771682588438-db8a",
      "slug": "oil-traders-scramble-to-hedge-iran-risk-amid-strongest-start",
      "headline": "Oil Traders Scramble to Hedge Iran Risk Amid Strongest Start Since 2022",
      "subheadline": "Supply disruptions and sanctions have upended expectations of an oversupplied market, sending traders rushing for protection",
      "body": "Oil markets are experiencing their most robust start to a year since 2022, driven by a combination of supply shocks and sanctions that have shattered earlier forecasts of a global glut — and traders are now racing to hedge against the possibility of renewed U.S. military action against Iran.\n\nThe scramble for downside and upside protection reflects growing anxiety across energy markets that geopolitical risk premiums, which many analysts had expected to fade in early 2026, are instead intensifying. The prospect of U.S. strikes on Iranian targets has emerged as a central concern, prompting a surge in options activity as market participants seek to insulate portfolios from a potential spike in crude prices. The hedging rush underscores how quickly sentiment has shifted from fears of oversupply to fears of supply disruption.\n\nAt the start of the year, the prevailing consensus among oil analysts pointed toward a well-supplied market weighed down by tepid demand growth and expanding production from non-OPEC sources. That thesis has been upended by a series of unexpected supply interruptions and the tightening effect of sanctions enforcement, which have constrained the flow of barrels onto the global market. The result has been a sustained rally that caught many traders off guard and forced a rapid repricing of risk.\n\nIran remains the focal point of the market's anxiety. Any escalation in U.S.-Iran tensions — particularly involving direct military strikes — could threaten the passage of crude through the Strait of Hormuz, one of the world's most critical oil chokepoints through which roughly a fifth of global petroleum consumption flows daily. Even a temporary disruption to transit through the strait could send prices sharply higher and ripple through global energy supply chains.\n\nThe combination of a tightening physical market and elevated geopolitical uncertainty has created a volatile trading environment that shows few signs of calming. For energy desks and commodity funds, the message is clear: the risks that defined oil trading in 2022 — war, sanctions, and supply fragility — have returned with force, demanding active risk management rather than passive positioning.",
      "category": "markets",
      "importance": 7,
      "tags": [
        "oil",
        "Iran",
        "commodities",
        "geopolitical risk",
        "energy markets",
        "sanctions",
        "hedging"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1661192422882-00ae1c92105f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxfHxvaWwlMjBJcmFufGVufDB8MHx8fDE3NzE2NzcxNzl8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-21/oil-traders-rush-to-hedge-iran-risk-after-wild-start-to-year",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-21T14:03:08.438Z"
    },
    {
      "id": "ps-1771681702089-4bj1",
      "slug": "bitcoin-briefly-surges-past-68k-after-supreme-court-strikes-",
      "headline": "Bitcoin Briefly Surges Past $68K After Supreme Court Strikes Down Trump Tariffs",
      "subheadline": "Crypto's fleeting rally contrasts with sustained equity gains as stagflationary economic data clouds the outlook",
      "body": "Bitcoin jumped roughly 2% to above $68,000 on Friday after the U.S. Supreme Court struck down President Donald Trump's tariff regime in a landmark 6-3 ruling, but the cryptocurrency surrendered its gains within minutes, settling back near the $67,000 level in a pattern that has become frustratingly familiar to digital asset traders.\n\nThe high court's decision declared that Trump had exceeded his constitutional authority in imposing sweeping import tariffs, noting in its opinion that no president has ever \"invoked the statute to impose any tariffs, let alone tariffs of this magnitude and scope.\" The ruling cited a \"lack of historical precedent\" combined with the \"breadth of authority\" claimed by the executive branch as evidence that the tariffs extended beyond legitimate presidential power. While the decision was widely anticipated to be market-positive — removing a source of significant economic uncertainty — crypto markets proved unable to hold onto the initial enthusiasm.\n\nThe rapid fade in bitcoin stood in sharp contrast to equities, where the Nasdaq Composite climbed 0.6% to a session high and appeared to sustain its advance. The divergence underscores a persistent dynamic in cryptocurrency markets: modest rallies are being met with immediate selling pressure. On-chain data from analytics firm Santiment has shown that larger bitcoin holders — wallets containing between 10 and 10,000 BTC — have been reducing their positions since bitcoin's all-time high in October, while smaller retail wallets have been accumulating. Analysts say this imbalance helps explain why recoveries have been shallow and short-lived.\n\nCompounding the uncertain mood, a batch of U.S. economic data released earlier Friday painted a stagflationary picture. The Commerce Department reported that GDP grew just 1.4% in the fourth quarter of 2025, while core personal consumption expenditure prices rose 3% year-over-year, exceeding the consensus estimate of 2.9%. For the full year, the economy expanded only 2.2% — its weakest pace since the pandemic year of 2020. Art Hogan, chief market strategist at B. Riley Wealth, called the data a \"messy message\" that confirms the Federal Reserve's inclination to move cautiously on monetary policy.\n\nBitcoin has logged its worst first 50-day performance to start a year on record, and the combination of persistent inflation, slowing growth, and whale-driven selling pressure suggests the path forward remains choppy. Whether the removal of tariff uncertainty eventually provides a more durable tailwind for risk assets — including crypto — may depend on how quickly the economic data begins to improve.",
      "category": "markets",
      "importance": 8,
      "tags": [
        "bitcoin",
        "Supreme Court",
        "Trump tariffs",
        "stagflation",
        "cryptocurrency",
        "GDP",
        "Federal Reserve"
      ],
      "imageUrl": "https://cdn.sanity.io/images/s3y3vcno/production/31baab3948c5b1f8a4e57e1789ccfd534d92a939-1920x1080.jpg?auto=format&amp;w=960&amp;h=540&amp;crop=focalpoint&amp;fit=clip&amp;q=75&amp;fm=jpg",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/bitcoin-pops-then-drops-as-supreme-court-strikes-down-trump-tariffs",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-21T13:48:22.089Z"
    },
    {
      "id": "ps-1771679890986-8dyp",
      "slug": "sec-lets-broker-dealers-count-stablecoins-as-capital-in-majo",
      "headline": "SEC Lets Broker-Dealers Count Stablecoins as Capital in Major Policy Shift",
      "subheadline": "A quiet FAQ update applies just a 2% haircut to stablecoin holdings, putting them on par with money market funds",
      "body": "The U.S. Securities and Exchange Commission has made a potentially transformative change to how broker-dealers account for stablecoin holdings, allowing firms from Robinhood to Goldman Sachs to treat dollar-pegged tokens as regulatory capital with only a 2% haircut — a dramatic departure from previous guidance that effectively zeroed them out.\n\nThe change, published this week as a new entry on the SEC's \"Broker Dealer Financial Responsibilities\" FAQ page, means that firms can now count 98% of their stablecoin holdings — including major tokens like Circle's USDC and Tether's USDT — toward their capital requirements. Previously, the prevailing interpretation imposed what amounted to a 100% haircut, treating stablecoins as unmeasurable against a broker-dealer's capital tally and effectively penalizing firms for holding them. The update places stablecoins on essentially the same regulatory footing as money market funds on a firm's balance sheet.\n\nThe practical implications are substantial. Broker-dealers, which are registered with the SEC to handle customer securities transactions and trade on their own behalf, will now find it far easier to custody tokenized securities, provide liquidity, facilitate settlement, and participate in the growing tokenized finance ecosystem. \"Stablecoins are now working capital,\" wrote Larry Florio, deputy general counsel at Ethena Labs, in an analysis posted on LinkedIn. Tonya Evans, a crypto education executive and board member at Digital Currency Group, noted that the financial penalty for holding stablecoins \"is over.\"\n\nSEC Commissioner Hester Peirce, who leads the agency's Crypto Task Force, issued a statement saying the change \"will make it feasible for broker-dealers to engage in a broader range of business activities relating to tokenized securities and other crypto assets.\" Peirce also signaled appetite for going further, saying she wants to explore how existing SEC rules \"could be amended to account for payment stablecoins.\" Cody Carbone, CEO of the Digital Chamber, called the guidance a step toward reducing uncertainty for compliant firms.\n\nHowever, the informal nature of the change underscores its fragility. Staff guidance can be reversed as easily as it is issued, lacking the legal protections of formal rulemaking. The SEC has been working on crypto-specific rules in recent months, but the rulemaking process typically takes months or years. This reality continues to drive industry calls for congressional legislation — such as the GENIUS Act passed last year — to enshrine digital asset policy in law rather than leave it subject to shifting agency leadership.",
      "category": "markets",
      "importance": 7,
      "tags": [
        "SEC",
        "stablecoins",
        "broker-dealers",
        "crypto regulation",
        "tokenized finance",
        "capital requirements"
      ],
      "imageUrl": "https://cdn.sanity.io/images/s3y3vcno/production/a0b9c77ef2096d8c4905fefac8edbe280eb49ff3-1920x1080.jpg?auto=format&amp;w=960&amp;h=540&amp;crop=focalpoint&amp;fit=clip&amp;q=75&amp;fm=jpg",
      "sourceUrl": "https://www.coindesk.com/policy/2026/02/20/sec-makes-quiet-shift-to-brokers-stablecoin-holdings-that-may-pack-big-results",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-21T13:18:10.986Z"
    },
    {
      "id": "ps-1771678033894-eewu",
      "slug": "ai-generated-fake-news-more-believable-than-human-written-li",
      "headline": "AI-Generated Fake News More Believable Than Human-Written, Linguist Warns",
      "subheadline": "New multilingual research project identifies linguistic traits that make machine-crafted disinformation harder to detect",
      "body": "Artificial intelligence is producing fake news that people consistently perceive as more credible than disinformation written by humans, according to findings from a multilingual linguistics research project that underscores growing concerns about AI's role in the information ecosystem.\n\nSilje Susanne Alvestad, a linguist leading the \"Fakespeak—the language of fake news\" project, has been investigating the specific linguistic features that distinguish fabricated news content from legitimate reporting. Working with research colleagues across three languages — English, Russian, and Norwegian — Alvestad's team has found that AI-generated false content tends to lack the telltale stylistic markers that might otherwise alert readers to deception. The finding suggests that as large language models grow more sophisticated, the traditional linguistic red flags associated with disinformation are being smoothed away.\n\nThe research builds on nearly a decade of heightened attention to fake news as a societal threat. Norway's Language Council selected \"fake news\" as its word of the year back in 2017, reflecting the term's rapid entry into public consciousness. But while awareness of the problem has grown, Alvestad's work indicates the challenge has evolved significantly. Where human-authored fake news often betrays itself through exaggerated language, emotional manipulation, or structural irregularities, AI-produced content can mimic the measured, authoritative tone of professional journalism with unsettling fidelity.\n\nThe multilingual dimension of the Fakespeak project is particularly notable. By examining disinformation across English, Russian, and Norwegian, the researchers are mapping whether the linguistic signatures of fake news vary by language and cultural context, or whether universal patterns exist that could form the basis of detection tools. The cross-linguistic approach may prove critical as AI-generated disinformation increasingly targets audiences across borders and language barriers simultaneously.\n\nThe findings arrive at a moment when policymakers, technology companies, and media organizations are struggling to keep pace with the volume and quality of machine-generated content flooding online platforms. If AI text lacks the linguistic fingerprints that have historically helped both human readers and automated systems flag suspicious content, new detection frameworks — potentially drawing on insights from projects like Fakespeak — will be essential to maintaining the integrity of public discourse.",
      "category": "tech",
      "importance": 6,
      "tags": [
        "artificial-intelligence",
        "disinformation",
        "linguistics",
        "fake-news",
        "AI-detection"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1553368561-5ccfe639f28b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxNXx8YXJ0aWZpY2lhbC1pbnRlbGxpZ2VuY2UlMjBkaXNpbmZvcm1hdGlvbnxlbnwwfDB8fHwxNzcxNjc4MDMzfDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://phys.org/news/2026-02-linguist-ai-fake-news-credible.html",
      "sourceName": "Phys.org",
      "publishedAt": "2026-02-21T12:47:13.894Z"
    },
    {
      "id": "ps-1771677135754-h6bb",
      "slug": "bird-flu-outbreak-kills-over-1-100-geese-across-new-jersey",
      "headline": "Bird Flu Outbreak Kills Over 1,100 Geese Across New Jersey",
      "subheadline": "Mass die-off of Canada geese prompts lake closures and public health warnings as avian influenza spreads",
      "body": "A significant avian influenza outbreak in New Jersey has left at least 1,100 birds dead or sickened, predominantly Canada geese, since the first cases were reported on February 14, according to state officials. The scale of the die-off has prompted authorities to close affected lakes and issue public health advisories.\n\nThe outbreak, which began on Valentine's Day and has rapidly escalated, represents one of the larger regional bird flu events in recent memory. State wildlife and public health agencies have moved to restrict access to water bodies where infected birds have been found, aiming to limit potential exposure to both humans and other animal populations. Canada geese, which congregate in large flocks near lakes and ponds throughout the state, appear to be the primary species affected.\n\nBird flu, caused by highly pathogenic avian influenza (HPAI) viruses, has been a persistent concern across the United States in recent years, devastating poultry operations and wild bird populations alike. While human infections remain rare, health authorities have urged New Jersey residents to avoid contact with sick or dead birds and to keep pets away from affected areas. The virus can spread through direct contact with infected animals or contaminated surfaces, and authorities have emphasized that proper reporting of dead wildlife is essential to tracking the outbreak's trajectory.\n\nThe closure of recreational lakes adds an economic and social dimension to the crisis, particularly as communities prepare for the transition into spring. Local officials are coordinating with state wildlife agencies and the U.S. Department of Agriculture to monitor the situation, conduct testing, and manage carcass removal. The speed at which the outbreak has grown — more than a thousand birds in a matter of weeks — underscores the challenge of containing highly pathogenic strains once they take hold in wild bird populations.\n\nPublic health experts note that while the immediate risk to humans remains low, continued surveillance is critical. The ongoing national HPAI outbreak, which has affected dozens of states and led to the culling of millions of domestic poultry since 2022, shows no signs of abating. New Jersey's mass geese die-off serves as a stark reminder that wild birds remain a key vector for the virus's spread.",
      "category": "science",
      "importance": 6,
      "tags": [
        "bird flu",
        "avian influenza",
        "New Jersey",
        "Canada geese",
        "wildlife",
        "public health"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1667503034321-b8f19df10377?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw3fHxiaXJkJTIwZmx1JTIwYXZpYW4lMjBpbmZsdWVuemF8ZW58MHwwfHx8MTc3MTY1MTAzMXww&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://phys.org/news/2026-02-dead-sick-geese-nj-bird.html",
      "sourceName": "Phys.org",
      "publishedAt": "2026-02-21T12:32:15.754Z"
    },
    {
      "id": "ps-1771676283097-igcn",
      "slug": "ecb-staff-rattled-as-lagarde-early-departure-reports-spark-l",
      "headline": "ECB Staff Rattled as Lagarde Early Departure Reports Spark Leadership Crisis",
      "subheadline": "Growing internal frustration over president's handling of potential exit raises questions about institutional authority",
      "body": "Reports that European Central Bank President Christine Lagarde may step down before her term expires have triggered a wave of confusion and frustration inside the Frankfurt-based institution, with staff questioning her authority and the bank's near-term policy direction.\n\nAccording to Bloomberg, ECB personnel have been left unsettled by the swirling speculation about Lagarde's early exit, with internal sentiment described as a mix of confusion, irritation, and uncertainty. The reports have raised pointed questions about how effectively Lagarde can steer the eurozone's monetary policy while her own future at the helm remains unresolved — a particularly sensitive concern as the ECB navigates a complex economic landscape marked by sluggish growth, persistent geopolitical risks, and ongoing debates over the pace of interest rate adjustments.\n\nLagarde, who took office in November 2019 as the ECB's first female president, holds an eight-year non-renewable term that would ordinarily run through October 2027. Any premature departure would set off a high-stakes political negotiation among EU member states to select a successor, a process that has historically involved intense horse-trading between Europe's largest economies. The timing of such a leadership vacuum could prove particularly disruptive given the ECB's delicate balancing act between supporting a fragile eurozone recovery and maintaining credibility on inflation.\n\nThe internal discontent appears to center not merely on the possibility of Lagarde leaving, but on how the situation has been managed — or left unmanaged — within the institution. Central banks depend heavily on clarity and predictability, both in external communications with markets and in internal governance. An extended period of ambiguity over the presidency risks undermining staff morale and complicating the Governing Council's ability to project a unified front on policy decisions.\n\nNeither Lagarde nor the ECB has publicly confirmed any plans for an early departure. But the episode underscores the broader challenge facing European institutions, where top appointments are as much products of political consensus as they are of technocratic credentials. Whoever ultimately leads the ECB through the remainder of this decade will face the task of restoring internal cohesion while steering monetary policy through an era of unusual economic uncertainty.",
      "category": "business",
      "importance": 7,
      "tags": [
        "ECB",
        "Christine Lagarde",
        "European Central Bank",
        "monetary policy",
        "eurozone",
        "central banking"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1462206092226-f46025ffe607?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxN3x8YnVzaW5lc3N8ZW58MHwwfHx8MTc3MTYzMzk4NHww&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-21/inside-the-ecb-irritation-grows-over-lagarde-s-handling-of-exit",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-21T12:18:03.097Z"
    },
    {
      "id": "ps-1771675350180-pw91",
      "slug": "common-pneumonia-bacterium-linked-to-alzheimer-s-disease-pro",
      "headline": "Common Pneumonia Bacterium Linked to Alzheimer's Disease Progression",
      "subheadline": "Cedars-Sinai researchers find Chlamydia pneumoniae invades the retina and brain, triggering inflammation and amyloid buildup",
      "body": "A bacterium responsible for everyday pneumonia and sinus infections may be quietly accelerating Alzheimer's disease, according to a new study from Cedars-Sinai Medical Center published in Nature Communications on February 21.\n\nResearchers discovered that Chlamydia pneumoniae — a widespread respiratory pathogen — can persist for years in both the eye and the brain, where it triggers inflammation, kills nerve cells, and stimulates the production of amyloid-beta, the protein whose accumulation is the hallmark of Alzheimer's pathology. The findings, drawn from analysis of retinal tissue from 104 human participants as well as cell culture and animal experiments, represent the first demonstration that the bacterium can travel to the retina, potentially making the eye an early warning system for the neurodegenerative disease.\n\nParticipants with Alzheimer's diagnoses showed significantly higher levels of Chlamydia pneumoniae in both their retinas and brains compared to cognitively normal individuals. Greater bacterial loads correlated with more severe brain damage and steeper cognitive decline. The association was particularly pronounced among carriers of the APOE4 gene variant, the most significant known genetic risk factor for Alzheimer's. In laboratory experiments using human nerve cells and Alzheimer's mouse models, infection with the bacterium directly increased inflammation, neuronal death, and amyloid-beta production — strengthening the case for a causal link rather than mere correlation.\n\n\"Seeing Chlamydia pneumoniae consistently across human tissues, cell cultures and animal models allowed us to identify a previously unrecognized link between bacterial infection, inflammation and neurodegeneration,\" said Maya Koronyo-Hamaoui, professor of Neurosurgery, Neurology, and Biomedical Sciences at Cedars-Sinai and the study's senior author. She noted that retinal imaging could serve as a noninvasive screening tool to identify individuals at elevated Alzheimer's risk. Co-corresponding author Timothy Crother said the results raise the possibility of \"targeting the infection-inflammation axis\" as a novel therapeutic strategy, potentially through early antibiotic intervention or anti-inflammatory treatments.\n\nThe study adds momentum to a growing body of research implicating chronic infections in neurodegenerative disease, a hypothesis that has gained traction in recent years alongside the dominant amyloid-centric model of Alzheimer's. If validated in larger clinical trials, the findings could reshape both early detection and treatment paradigms for a disease that affects an estimated 6.9 million Americans. The research was supported by grants from the National Institutes of Health, the Alzheimer's Association, and several private foundations.",
      "category": "science",
      "importance": 7,
      "tags": [
        "Alzheimer's disease",
        "Chlamydia pneumoniae",
        "neurodegeneration",
        "retinal imaging",
        "amyloid-beta",
        "Cedars-Sinai"
      ],
      "imageUrl": "https://www.sciencedaily.com/images/1920/neuroscience-brain-inflammation-disease.webp",
      "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000321.htm",
      "sourceName": "Science Daily",
      "publishedAt": "2026-02-21T12:02:30.180Z"
    },
    {
      "id": "ps-1771660018513-f1ls",
      "slug": "trump-signals-possible-limited-military-strike-against-iran",
      "headline": "Trump Signals Possible Limited Military Strike Against Iran",
      "subheadline": "President floats military action as diplomatic window narrows, with Iran promising a draft agreement within days",
      "body": "President Donald Trump said Friday he is weighing a limited military strike on Iran, escalating pressure on Tehran as nuclear negotiations enter what both sides describe as a critical phase. The remarks came hours after senior administration officials had publicly raised the possibility of military action.\n\nTrump told reporters earlier in the week that the world would learn \"over the next, probably, 10 days\" whether Iran would agree to a deal constraining its nuclear program or face U.S. military force. Iranian Foreign Minister Abbas Araghchi responded Friday by announcing that Tehran is preparing \"a draft of a possible agreement\" to be delivered to U.S. Special Envoy Steve Witkoff within days. The two sides have been holding talks in Geneva, with both characterizing the discussions as productive.\n\nThe diplomatic maneuvering is unfolding against a backdrop of significant American military buildup in the region. The USS Gerald R. Ford — the world's largest warship — appears to be heading toward the vicinity of Iran, joining the USS Abraham Lincoln carrier strike group alongside an expanding flotilla of destroyers, combat ships, and fighter jets. Satellite imagery indicates Iran has bolstered its own military installations in response, while Supreme Leader Ayatollah Ali Khamenei has posted veiled threats aimed at U.S. forces on social media.\n\nThe situation carries echoes of last July's Operation Midnight Hammer, when U.S. forces struck Iranian nuclear facilities even as White House officials were still publicly discussing the prospects for successful negotiations. The day before that strike, Press Secretary Karoline Leavitt read a Trump statement suggesting he would decide on military action \"within the next two weeks\" — language strikingly similar to his current rhetoric. Trump has long favored strategic ambiguity, frequently reminding journalists he prefers to keep adversaries guessing about his intentions.\n\nAny military escalation would arrive at a politically delicate moment for the administration. Trump is contending with the Supreme Court's landmark ruling striking down his sweeping tariff regime, and polls show growing public dissatisfaction with his handling of immigration and the economy. A protracted, multi-week campaign against Iran — reportedly among the range of options presented to the president by military planners — could risk alienating elements of his MAGA base, many of whom were drawn to his promises to avoid costly foreign entanglements. The United States and its European allies maintain that Iran is moving toward developing a nuclear weapon, an accusation Tehran has consistently denied.",
      "category": "breaking",
      "importance": 9,
      "tags": [
        "Iran",
        "Trump",
        "military strike",
        "nuclear negotiations",
        "Middle East",
        "US foreign policy"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/1a63/live/ac7525e0-0ea4-11f1-8fa9-a78fde43271a.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/cdxzk4gvzp0o?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-21T07:46:58.513Z"
    },
    {
      "id": "ps-1771651943716-ny06",
      "slug": "ancient-oxygen-breathing-microbes-may-explain-origins-of-com",
      "headline": "Ancient Oxygen-Breathing Microbes May Explain Origins of Complex Life",
      "subheadline": "Massive genomic study of Asgard archaea resolves long-standing paradox about how eukaryotes first emerged",
      "body": "A sweeping genomic analysis of ancient microbes has yielded compelling evidence that the ancestors of all complex life — plants, animals, and fungi — were already capable of using oxygen long before they evolved into the first eukaryotic cells. The findings, published in Nature on February 20, address one of evolutionary biology's most persistent puzzles.\n\nResearchers at the University of Texas at Austin, led by marine scientist Brett Baker, assembled more than 13,000 new microbial genomes from roughly 15 terabytes of environmental DNA collected across multiple marine expeditions. From this dataset, the team recovered hundreds of previously unknown genomes belonging to Asgard archaea, a group widely regarded as the closest living relatives of the organism that gave rise to all complex life. The effort nearly doubled the known genomic diversity of the entire Asgard group and revealed previously unrecognized protein families, doubling the number of recognized enzymatic classes within these microbes.\n\nThe central finding challenges a longstanding assumption. Most known Asgard archaea inhabit oxygen-free deep-sea environments, which made it difficult to explain how they could have partnered with oxygen-dependent alphaproteobacteria — the symbiotic merger that scientists believe produced the first eukaryotic cell and its energy-producing mitochondria. Baker's team discovered that a subgroup called Heimdallarchaeia, the Asgards most closely related to eukaryotes, actually thrives in oxygen-rich shallow coastal sediments and open water columns. These organisms possess multiple metabolic pathways for oxygen use. Using the AI protein-structure prediction tool AlphaFold2, the researchers demonstrated that several Heimdallarchaeia proteins closely resemble those eukaryotic cells use today for oxygen-based energy metabolism.\n\nThe timeline reinforces the case. Following the Great Oxidation Event more than 1.7 billion years ago, when atmospheric oxygen levels surged, the earliest known eukaryotic microfossils appear in the geological record within a few hundred thousand years. \"Oxygen appeared in the environment, and Asgards adapted to that,\" Baker said. \"They found an energetic advantage to using oxygen, and then they evolved into eukaryotes.\"\n\nThe research, which grew from co-author Kathryn Appler's doctoral work beginning in 2019 at the UT Marine Science Institute, involved collaborators at Monash University in Australia, Wageningen University in the Netherlands, and several other institutions. Funding came in part from the Gordon and Betty Moore and Simons Foundations. By resolving the oxygen paradox at the heart of eukaryotic origins, the study offers the strongest evidence yet that breathable air was not merely a backdrop to the emergence of complex life — it was a catalyst.",
      "category": "science",
      "importance": 8,
      "tags": [
        "eukaryotes",
        "Asgard archaea",
        "evolution",
        "oxygen metabolism",
        "genomics",
        "origin of life"
      ],
      "imageUrl": "https://www.sciencedaily.com/images/1920/collecting-microbial-metagenomes-in-shallow-coastal-sediments.webp",
      "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260220010825.htm",
      "sourceName": "Science Daily",
      "publishedAt": "2026-02-21T05:32:23.716Z"
    },
    {
      "id": "ps-1771651049519-elrc",
      "slug": "giant-virus-found-in-japan-bolsters-theory-that-viruses-spar",
      "headline": "Giant Virus Found in Japan Bolsters Theory That Viruses Sparked Complex Life",
      "subheadline": "Ushikuvirus, isolated from a Japanese lake, exhibits unusual nuclear-disrupting behavior that bridges gaps in viral evolution",
      "body": "A newly identified giant virus isolated from a lake in Japan is providing fresh evidence for one of biology's most provocative hypotheses: that viruses may have given rise to the nucleus at the heart of all complex cells, effectively catalyzing the emergence of eukaryotic life on Earth.\n\nThe virus, named ushikuvirus after Lake Ushiku in Ibaraki Prefecture, was described in a study published in the Journal of Virology by a team led by Professor Masaharu Takemura of Tokyo University of Science alongside collaborators at Japan's National Institute of Natural Sciences. Ushikuvirus infects vermamoeba, a single-celled amoeba, and belongs to the broader group of giant DNA viruses — entities so large and genetically complex that they blur the traditional boundary between viruses and living cells. What makes this particular specimen significant is the way it replicates: unlike related viruses in the Mamonoviridae family, which commandeer the host cell's intact nucleus as a factory for producing new viral particles, ushikuvirus actively breaks down the nuclear membrane during replication.\n\nThat distinction matters because it positions ushikuvirus as a potential evolutionary link between two previously separate categories of giant viruses — those that replicate inside an intact nucleus, like medusavirus, and those that dismantle the nuclear membrane entirely, like pandoravirus. Takemura, who along with Macquarie University's Philip Bell independently proposed the viral eukaryogenesis hypothesis in 2001, argues that such intermediate behaviors strengthen the case that a large DNA virus once established a stable symbiotic relationship inside an ancient archaeal cell, eventually transforming into the membrane-bound nucleus found in all eukaryotes today. That hypothesis gained significant traction after the first giant DNA viruses were discovered in 2003, revealing that some viral infections produce membrane-enclosed \"virus factories\" inside host cells that bear a striking resemblance to primitive nuclei.\n\nBeyond its evolutionary implications, ushikuvirus presents a suite of distinctive physical features. Its capsid surface is studded with spiked structures capped by unique formations, some trailing filament-like extensions never observed in related medusaviruses. Infected vermamoeba cells swell to unusual sizes, a cytopathic effect distinct from those caused by other known giant viruses. The research team — which included master's students Jiwan Bae and Narumi Hantori, along with Dr. Raymond Burton-Smith and Professor Kazuyoshi Murata — notes that these differences likely reflect long-term adaptation to different amoeba hosts.\n\nThe discovery also carries potential medical relevance. Certain amoeba species closely related to those infected by giant viruses can cause life-threatening conditions, including amoebic encephalitis. Understanding how giant viruses infiltrate and destroy amoebae could eventually inform new strategies for treating such infections. \"Giant viruses can be said to be a treasure trove whose world has yet to be fully understood,\" Takemura said. \"One of the future possibilities of this research is to provide humanity with a new view that connects the world of living organisms with the world of viruses.\"",
      "category": "science",
      "importance": 7,
      "tags": [
        "giant virus",
        "eukaryogenesis",
        "evolution",
        "cell nucleus",
        "virology",
        "ushikuvirus"
      ],
      "imageUrl": "https://www.sciencedaily.com/images/1920/giant-virus.webp",
      "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040814.htm",
      "sourceName": "Science Daily",
      "publishedAt": "2026-02-21T05:17:29.519Z"
    },
    {
      "id": "ps-1771649229602-f22y",
      "slug": "new-method-measures-relativistic-temperature-using-only-stoc",
      "headline": "New Method Measures Relativistic Temperature Using Only Stochastic Noise",
      "subheadline": "Physicist demonstrates that electromagnetic fluctuations alone can reveal the full thermal state of a fast-moving plasma",
      "body": "A new theoretical framework shows that the temperature and velocity of a relativistic medium can be extracted purely from the random electromagnetic noise it naturally emits — eliminating the need for external probes, spectral line analysis, or absolute intensity calibration.\n\nPublished on the arXiv preprint server on February 18, physicist Ira Wolfson presents a method for reconstructing the inverse-temperature four-vector, the fundamental quantity describing thermal equilibrium in special relativity. Unlike classical thermodynamics, where temperature is a simple scalar, relativistic systems require a four-component object — denoted β^μ — that encodes both the rest-frame temperature and the medium's bulk drift velocity relative to an observer. Wolfson's key insight is that when a hot, moving plasma emits thermal radiation, a Lorentz boost transforms what would be isotropic noise in the plasma's rest frame into a distinctive pattern of correlated electric and magnetic field fluctuations. These correlations contain enough information to determine the drift velocity without any external reference.\n\nThe approach leverages the covariant fluctuation-dissipation theorem, a cornerstone result connecting thermal noise to the dissipative properties of a system. By measuring angle-resolved noise spectra from the electromagnetic emissions, the full four-vector β^μ can be assembled using only passive detection of stochastic fields. Critically, the method relies on a gain-independent observable — a ratio of fluctuation quantities that cancels out detector calibration factors — making it robust against the systematic uncertainties that typically plague precision plasma diagnostics.\n\nMonte Carlo simulations reported in the four-page paper demonstrate that the technique achieves percent-level accuracy at realistic signal-to-noise ratios. Feasibility estimates suggest that for laboratory plasmas, integration times on the order of sub-microsecond durations would be sufficient, placing the method well within reach of existing experimental capabilities. This speed could prove valuable in transient plasma experiments, including those in fusion energy research and high-energy-density physics, where conditions change rapidly.\n\nWolfson describes this as the first method capable of reconstructing the covariant thermal state of a relativistic medium from passive stochastic fields alone. If validated experimentally, the technique would establish vacuum electromagnetic fluctuations as a direct, operational probe of relativistic equilibrium — a conceptual advance that bridges plasma physics, statistical mechanics, and general relativity. The work has been cross-listed across all three of those arXiv categories, signaling its interdisciplinary significance.",
      "category": "physics",
      "importance": 6,
      "tags": [
        "relativistic thermodynamics",
        "plasma physics",
        "electromagnetic fluctuations",
        "covariant temperature",
        "fluctuation-dissipation theorem"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1652967358211-899209821b8b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxM3x8cmVsYXRpdmlzdGljJTIwdGhlcm1vZHluYW1pY3MlMjBwbGFzbWElMjBwaHlzaWNzfGVufDB8MHx8fDE3NzE2MDk3MDd8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://arxiv.org/abs/2602.16765",
      "sourceName": "arXiv Physics",
      "publishedAt": "2026-02-21T04:47:09.602Z"
    },
    {
      "id": "ps-1771648332888-qw76",
      "slug": "new-ai-framework-embeds-maxwell-s-equations-into-diffusion-m",
      "headline": "New AI Framework Embeds Maxwell's Equations Into Diffusion Models for Photonic Design",
      "subheadline": "MxDiffusion uses a two-stage physics-guided approach that outperforms purely data-driven methods for inverse metasurface engineering",
      "body": "A team of researchers has developed a novel generative AI framework that bakes the fundamental laws of electromagnetism directly into a diffusion model, enabling more accurate and physically consistent design of photonic metasurfaces — nanoscale structures that manipulate light in ways natural materials cannot.\n\nThe system, called MxDiffusion, was introduced in a preprint by Sujoy Mondal, Taehyuk Park, Sudipta Biswas, Alan X. Wang, and Wenshan Cai. Unlike conventional machine learning approaches to inverse photonic design, which rely entirely on training data to learn the relationship between a desired optical response and the structure that produces it, MxDiffusion incorporates Maxwell's equations — the foundational laws governing electromagnetic wave behavior — as an explicit constraint during model training. The result is a hybrid physics-and-data-driven system that generates photonic structures from target optical properties with significantly higher fidelity, particularly in challenging design scenarios.\n\nThe framework operates through a two-stage strategy. In the first stage, a diffusion model is trained using a loss function derived directly from Maxwell's equations, embedding physical principles into the generation process and producing a physically consistent intermediate representation. The second stage then translates that intermediate output into a final structural geometry. This division of labor allows the model to maintain physical plausibility while still leveraging the flexibility and generative power of modern diffusion architectures.\n\nThe researchers validated MxDiffusion on two representative test cases: gold nanostructures patterned on a silica substrate and a highly tunable bandpass filter based on phase-change material. In both scenarios, the physics-guided framework consistently outperformed a conventional data-driven diffusion model benchmark. The advantages were most pronounced for out-of-training-distribution design targets — cases where the desired optical response falls outside the range of examples the model was trained on — and for highly constrained resonance conditions, where small structural errors can produce large deviations in optical behavior.\n\nThe work addresses a persistent bottleneck in nanophotonics. Designing metasurfaces traditionally requires computationally expensive electromagnetic simulations, and purely data-driven inverse design methods often struggle with generalization and physical accuracy. By grounding the generative process in Maxwell's equations, MxDiffusion offers what the authors describe as a general physics-guided inverse design paradigm — one that could extend beyond photonics to other domains where governing physical laws can be mathematically encoded into machine learning pipelines. The preprint was posted to arXiv on February 18, 2026.",
      "category": "physics",
      "importance": 6,
      "tags": [
        "photonics",
        "metasurfaces",
        "diffusion models",
        "inverse design",
        "Maxwell's equations",
        "nanophotonics",
        "machine learning"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1622548283559-4dbd130508e0?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxfHxwaG90b25pY3MlMjBtZXRhc3VyZmFjZXN8ZW58MHwwfHx8MTc3MTYwOTUwOHww&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://arxiv.org/abs/2602.16851",
      "sourceName": "arXiv Physics",
      "publishedAt": "2026-02-21T04:32:12.888Z"
    },
    {
      "id": "ps-1771641184676-9ng0",
      "slug": "paramount-skydance-clears-key-antitrust-hurdle-in-77-9b-warn",
      "headline": "Paramount Skydance Clears Key Antitrust Hurdle in $77.9B Warner Bid",
      "subheadline": "Hart-Scott-Rodino waiting period expires, but Justice Department could still challenge the mega-merger",
      "body": "Paramount Skydance announced Friday that it faces no remaining statutory barrier in the United States to completing its proposed $77.9 billion acquisition of Warner Bros. Discovery, after a critical antitrust review period expired without federal action to block the deal.\n\nThe company said it has fully complied with the U.S. Justice Department's second-request review process under the Hart-Scott-Rodino Act, a procedural step that allows regulators to scrutinize large mergers before they close. A mandatory 10-day waiting period following that compliance lapsed on Thursday, removing one of the most significant regulatory checkpoints standing between the two entertainment giants and a transformative combination.\n\nHowever, the expiration of the waiting period does not constitute regulatory approval. The Justice Department retains the authority to file suit to block the merger at any point, and has done so in past cases even after HSR waiting periods have passed. The distinction is an important one for investors and industry observers watching what would be one of the largest media deals in history — a transaction that would unite Paramount's film studio, CBS network, and streaming platform with Warner Bros. Discovery's sprawling portfolio of assets including HBO, CNN, and the Warner Bros. film and television operations.\n\nThe deal, which would reshape the competitive landscape of an entertainment industry already under intense pressure from streaming economics and cord-cutting, has drawn scrutiny from analysts questioning whether regulators in the current administration would permit such extensive consolidation. A combined entity would control an enormous share of scripted television production, film distribution, and streaming content, potentially raising concerns about market concentration and bargaining power over distributors.\n\nParamount Skydance — itself the product of Skydance Media's recent takeover of the legacy Paramount operation — framed the milestone as significant forward progress, stating it sees \"no statutory impediment\" to closing. Yet the path to completion likely involves additional regulatory reviews in international jurisdictions, and the Justice Department's silence should not be read as tacit endorsement. For now, the mega-merger remains alive, but far from assured.",
      "category": "business",
      "importance": 7,
      "tags": [
        "Paramount",
        "Warner Bros Discovery",
        "mergers and acquisitions",
        "antitrust",
        "media consolidation",
        "Skydance"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1520607162513-77705c0f0d4a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw2fHxidXNpbmVzc3xlbnwwfDB8fHwxNzcxNjI4NTg2fDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/videos/2026-02-20/paramount-regulatory-waiting-period-for-warner-bid-ends-video",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-21T02:33:04.676Z"
    },
    {
      "id": "ps-1771634872111-tyjb",
      "slug": "new-asymptotic-solution-captures-heat-effects-of-em-beams-on",
      "headline": "New Asymptotic Solution Captures Heat Effects of EM Beams on Skin",
      "subheadline": "Researchers derive closed-form expressions that account for both incident angle and lateral heat conduction in electromagnetic skin heating",
      "body": "A team of researchers has developed a more complete mathematical framework for predicting how electromagnetic beams heat biological skin tissue, closing a gap in previous models that failed to capture the significant effects of lateral heat conduction at realistic length scales.\n\nThe study, posted to the arXiv preprint server on February 18 by Ulises Jaime-Yepez, Hongyun Wang, Shannon E. Foley, and Hong Zhou, extends earlier work that derived only the leading-term asymptotic solution for temperature distribution during electromagnetic skin heating at arbitrary incident angles. The new analysis provides closed-form analytical expressions for both the first-order and second-order terms in an asymptotic expansion, enabling substantially more accurate temperature predictions — particularly in scenarios where the ratio of beam penetration depth to lateral beam size is moderate rather than vanishingly small.\n\nThe asymptotic approach exploits the fact that electromagnetic beams penetrate skin to a depth much smaller than their cross-sectional width, allowing the temperature field to be expanded in powers of this small depth-to-lateral scale ratio. A key finding is that while the incident angle of the beam affects all terms in the expansion, lateral heat conduction — the sideways spreading of thermal energy through tissue — appears only in terms of positive even powers. This means the leading-term solution, which was the state of the art from prior work, entirely misses the contribution of lateral conduction. At a depth-to-lateral ratio of 0.1, a value the authors characterize as moderate and physically relevant, the lateral conduction effect proves \"quite significant\" and cannot be neglected in any meaningful approximation.\n\nThe work spans classical physics and biological physics, reflecting its dual relevance to electromagnetic theory and biomedical applications. Electromagnetic skin heating arises in contexts ranging from medical therapies and dermatological treatments to safety assessments of radiation exposure. Accurate modeling of temperature distributions in tissue is critical for predicting thermal damage thresholds, optimizing therapeutic protocols, and understanding how beam geometry and orientation influence heating patterns beneath the skin surface.\n\nThe paper, which the authors describe as a preprint to be submitted for publication, represents a meaningful advance in the analytical toolkit available for these problems. By providing exact closed-form expressions rather than purely numerical solutions, the framework offers both computational efficiency and physical transparency — allowing researchers and engineers to directly see how each parameter governs the thermal response of irradiated tissue.",
      "category": "physics",
      "importance": 4,
      "tags": [
        "electromagnetic heating",
        "asymptotic analysis",
        "skin tissue",
        "classical physics",
        "biophysics",
        "thermal modeling"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1765410848575-063a741bfcab?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw3fHxlbGVjdHJvbWFnbmV0aWMlMjBoZWF0aW5nJTIwYXN5bXB0b3RpYyUyMGFuYWx5c2lzfGVufDB8MHx8fDE3NzE2MzQ4NzJ8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://arxiv.org/abs/2602.16751",
      "sourceName": "arXiv Physics",
      "publishedAt": "2026-02-21T00:47:52.111Z"
    },
    {
      "id": "ps-1771632167941-u474",
      "slug": "tesla-fails-to-overturn-243-million-autopilot-crash-verdict",
      "headline": "Tesla Fails to Overturn $243 Million Autopilot Crash Verdict",
      "subheadline": "Federal judge rejects automaker's motion, saying arguments were already 'considered and rejected' during trial",
      "body": "A federal judge has denied Tesla's attempt to reverse a $243 million jury verdict that found the automaker partially liable for a fatal 2019 crash in Florida involving its Autopilot driver assistance system, dealing a significant blow to the company's legal defense of the technology.\n\nHon. Judge Beth Bloom ruled on February 20 that Tesla's arguments for overturning the verdict were essentially recycled from earlier stages of the litigation. \"The grounds for relief that Tesla relies upon are virtually the same as those Tesla put forth previously during the course of trial and in their briefings on summary judgment — arguments that were already considered and rejected,\" the judge wrote, adding that Tesla failed to present any new legal arguments or controlling law that would justify altering the jury's decision.\n\nThe case stems from a 2019 crash in Florida that killed Naibel Benavides and critically injured Dillon Angulo. Last August, a jury awarded $243 million in damages, assigning two-thirds of the blame to the driver and one-third to Tesla. In a notable detail, the jury levied punitive damages exclusively against Tesla — a signal that jurors found the company's conduct warranted punishment beyond simple compensation. Tesla's legal team had argued that responsibility for the crash rested squarely with the driver.\n\nThe ruling carries broad implications for Tesla as it faces mounting legal scrutiny over its driver assistance technology. Autopilot, which handles certain steering, acceleration, and braking functions, has been at the center of numerous lawsuits and federal investigations. Critics have long argued that Tesla's marketing and naming of the system encourages drivers to over-rely on technology that still requires active human supervision. The company maintains that Autopilot is designed to assist — not replace — an attentive driver.\n\nThe decision arrives at a sensitive moment for Tesla, which continues to push aggressively into autonomous driving with its Full Self-Driving software. With the $243 million verdict now upheld, the case could embolden plaintiffs in other pending Autopilot-related lawsuits and increase pressure on regulators to impose stricter oversight on advanced driver assistance systems across the industry.",
      "category": "tech",
      "importance": 7,
      "tags": [
        "Tesla",
        "Autopilot",
        "autonomous driving",
        "lawsuit",
        "EV safety"
      ],
      "imageUrl": "https://techcrunch.com/wp-content/uploads/2023/12/tesla-autopilot-2.jpg?resize=1200,675",
      "sourceUrl": "https://techcrunch.com/2026/02/20/tesla-loses-bid-to-overturn-243m-autopilot-verdict/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-21T00:02:47.941Z"
    },
    {
      "id": "ps-1771631277484-ghw1",
      "slug": "blue-owl-offloads-1-4b-loan-portfolio-to-pensions-own-insure",
      "headline": "Blue Owl Offloads $1.4B Loan Portfolio to Pensions, Own Insurer",
      "subheadline": "Alternative asset manager tapped North America's largest pension funds and its affiliated insurance unit to meet fund redemption deadline",
      "body": "Blue Owl Capital sold a $1.4 billion portfolio of private loans to four buyers — three of North America's largest pension funds and its own insurance asset management arm — as the firm raced to return capital to investors in one of its private credit funds ahead of a looming redemption deadline.\n\nThe transaction underscores the growing entanglement between alternative asset managers, institutional pension capital, and affiliated insurance platforms in the rapidly expanding private credit market. Blue Owl, which has built itself into one of the sector's most prominent players, turned to a mix of external and internal buyers to liquidate the loan book, a maneuver that highlights both the depth of institutional demand for private debt and the potential conflicts that arise when firms sell assets to entities they control.\n\nThe sale to Blue Owl's own insurance asset manager is likely to draw particular scrutiny. Asset managers that also operate or advise insurance affiliates have faced mounting regulatory attention over concerns that captive insurers can serve as convenient warehouses for assets that might otherwise be difficult to move. Regulators and ratings agencies have increasingly questioned whether such arrangements adequately protect policyholders and whether pricing reflects true arm's-length terms.\n\nFor the pension funds involved, the deal represents an opportunity to acquire seasoned private credit assets at a time when many institutional allocators are actively increasing their exposure to the asset class. Pension systems across North America have been shifting portfolios toward private markets in search of higher yields and diversification away from publicly traded fixed income, a trend that has accelerated as private credit has expanded to fill lending gaps left by traditional banks.\n\nBlue Owl Capital, publicly traded on the New York Stock Exchange, has amassed significant scale in direct lending and other alternative credit strategies. The firm's ability to orchestrate a $1.4 billion secondary sale to meet investor redemptions suggests both robust demand for its loan assets and the operational complexity of managing liquidity in funds that invest in inherently illiquid instruments. The transaction serves as a case study in how private credit managers navigate the tension between long-duration assets and investors' periodic need for cash.",
      "category": "business",
      "importance": 6,
      "tags": [
        "Blue Owl Capital",
        "private credit",
        "pension funds",
        "insurance",
        "alternative assets",
        "loan sales"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1641914568078-3b6e1aa2d987?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxNHx8Qmx1ZSUyME93bCUyMENhcGl0YWwlMjBwcml2YXRlJTIwY3JlZGl0fGVufDB8MHx8fDE3NzE2Mjk0ODd8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-20/blue-owl-sold-private-loans-to-pension-giants-and-own-insurer",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T23:47:57.484Z"
    },
    {
      "id": "ps-1771630382999-1l2h",
      "slug": "teneo-warns-scotus-tariff-ruling-adds-new-layer-of-market-un",
      "headline": "Teneo Warns SCOTUS Tariff Ruling Adds New Layer of Market Uncertainty",
      "subheadline": "Political risk adviser says Supreme Court decision compounds existing corporate damage from trade policy",
      "body": "A recent Supreme Court ruling on tariffs has injected fresh uncertainty into markets already grappling with the financial toll of trade restrictions on corporate America, according to a senior political risk adviser at Teneo.\n\nKevin Kajiwara, co-president of political risk advisory at the consulting firm, said in a Bloomberg Television appearance on Thursday that while tariffs have already left visible marks on corporate income statements and balance sheets, the high court's decision introduces an additional dimension of unpredictability for businesses and investors. Speaking on Bloomberg's \"The Close\" with Romaine Bostick and Katie Greifeld, Kajiwara outlined how the legal landscape surrounding trade policy is now compounding the economic pressures companies have been absorbing for months.\n\nThe comments underscore a growing concern among risk consultants and market strategists that U.S. trade policy has become a multi-front challenge for corporations. Beyond the direct cost increases from tariffs — which have forced companies to raise prices, absorb margin compression, or restructure supply chains — firms must now contend with evolving judicial interpretations of executive trade authority. The Supreme Court's involvement signals that the constitutional boundaries of tariff powers remain a live and contested legal question, one with potentially far-reaching consequences for how aggressively the executive branch can deploy trade barriers.\n\nKajiwara also flagged geopolitical tensions surrounding Iran as a concurrent risk factor for markets. The convergence of trade uncertainty with Middle Eastern security concerns creates a complex backdrop for corporate planning and investor positioning heading into the spring. Teneo, which advises major multinational companies on navigating political and regulatory risks, has seen demand for its services rise as firms struggle to scenario-plan amid overlapping policy and geopolitical disruptions.\n\nFor market participants, the message is sobering: tariff risk is no longer confined to spreadsheet calculations of duty rates and sourcing costs. It now encompasses constitutional law, judicial unpredictability, and the potential for abrupt shifts in the legal framework governing international trade — all layered atop a geopolitical environment that shows few signs of stabilizing.",
      "category": "business",
      "importance": 6,
      "tags": [
        "tariffs",
        "Supreme Court",
        "Teneo",
        "political risk",
        "trade policy",
        "Iran",
        "corporate earnings"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1704545576746-e282fd02f2ad?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxfHx0YXJpZmZzJTIwU3VwcmVtZSUyMENvdXJ0fGVufDB8MHx8fDE3NzE2MTUxMTN8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/videos/2026-02-20/teneo-s-kajiwara-on-scotus-tariff-impact-iran-concerns-video",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T23:33:02.999Z"
    },
    {
      "id": "ps-1771629487912-lp7y",
      "slug": "blue-owl-capital-offloads-1-4b-loan-portfolio-to-pensions-ow",
      "headline": "Blue Owl Capital Offloads $1.4B Loan Portfolio to Pensions, Own Insurance Arm",
      "subheadline": "Private credit giant tapped three major North American pension funds and its in-house insurer to meet investor redemption deadline",
      "body": "Blue Owl Capital arranged the sale of a $1.4 billion portfolio of loans from one of its private credit funds to four buyers, including three of North America's largest pension funds and the firm's own insurance asset management division, according to Bloomberg.\n\nThe deal was driven by an approaching deadline that required Blue Owl to return capital to investors in the fund. By assembling a group of institutional buyers willing to absorb the sizable loan book, the alternative asset manager was able to generate the liquidity needed to meet its payout obligations. The involvement of Blue Owl's own insurance arm in the transaction, however, is likely to draw scrutiny from market observers who monitor potential conflicts of interest when firms act on both sides of a deal.\n\nThe transaction underscores a growing dynamic in private credit markets, where managers increasingly rely on large institutional buyers — particularly pension funds and insurance companies hungry for yield — to provide secondary liquidity for portfolios that were originally designed to be held to maturity. As private credit has ballooned into a multi-trillion-dollar asset class, the infrastructure for trading and recycling these illiquid positions has become a critical piece of the market's plumbing.\n\nBlue Owl, which manages more than $200 billion in assets across private credit, GP stakes, and real estate strategies, has built one of the largest direct lending platforms in the industry. The New York-based firm has expanded aggressively into insurance asset management, a channel that has become a major source of permanent capital for alternative managers. That Blue Owl turned partly to its own insurance unit to absorb loans from a separate fund highlights how vertically integrated many of these platforms have become.\n\nFor the pension funds involved, the acquisition represents an opportunity to gain exposure to seasoned private credit assets at potentially attractive terms, bypassing the typical blind-pool commitment structure. The identities of the three pension buyers were not disclosed. The deal also reflects the broader trend of Canadian and American public pension systems allocating increasing shares of their portfolios to private debt as they seek returns above what public fixed-income markets currently offer.",
      "category": "business",
      "importance": 6,
      "tags": [
        "Blue Owl Capital",
        "private credit",
        "pension funds",
        "loan portfolio",
        "alternative assets",
        "insurance asset management"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1606904022510-cb7a4a492173?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxNnx8Qmx1ZSUyME93bCUyMENhcGl0YWwlMjBwcml2YXRlJTIwY3JlZGl0fGVufDB8MHx8fDE3NzE2Mjk0ODd8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/videos/2026-02-20/blue-owl-sold-loans-to-pensions-own-insurance-arm-video",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T23:18:07.912Z"
    },
    {
      "id": "ps-1771628587025-cyz7",
      "slug": "weinstein-s-saba-cox-launch-tender-offers-for-blue-owl-bdc-s",
      "headline": "Weinstein's Saba, Cox Launch Tender Offers for Blue Owl BDC Shares",
      "subheadline": "Activist investor moves on Blue Owl's business development companies amid growing private credit market concerns",
      "body": "Activist investor Boaz Weinstein's Saba Capital Management, along with Cox, has launched tender offers for shares in Blue Owl Capital's business development companies, seizing on a turbulent stretch for the lender and mounting anxiety over risks accumulating in the $1.8 trillion private credit market.\n\nThe move represents an escalation by Weinstein, who has built a reputation as one of Wall Street's most aggressive activist investors, particularly in the closed-end fund space. Blue Owl Capital, a major player in alternative asset management, operates several BDCs that provide financing to middle-market companies — vehicles that have surged in popularity as private credit has ballooned into one of the fastest-growing corners of finance.\n\nThe tender offers come after what Bloomberg described as a challenging week for Blue Owl, though the specific difficulties were not detailed. The broader context, however, is unmistakable: investors and regulators alike have grown increasingly wary of the rapid expansion of private credit, which has swelled to roughly $1.8 trillion in assets. Critics warn that the sector's explosive growth, fueled by years of institutional capital flooding into alternatives, may be masking credit quality issues that could surface as economic conditions shift.\n\nBDCs, which are publicly traded vehicles that lend to private companies, often trade at discounts to their net asset value — a gap that activist investors like Weinstein have historically targeted. By launching tender offers, Saba and Cox are effectively betting they can acquire shares below intrinsic value, pressuring Blue Owl's management in the process. Weinstein's Saba Capital has been involved in numerous campaigns against closed-end funds and similar structures, frequently pushing for measures to narrow trading discounts.\n\nThe campaign adds another front to the growing tension between alternative asset managers and activist investors who argue that certain fund structures inadequately serve shareholders. For Blue Owl, which has built a significant franchise in private credit and GP stakes investing, the tender offers could force a public defense of its BDC valuations and governance at a moment when the broader market is already scrutinizing the sector's fundamentals.",
      "category": "business",
      "importance": 6,
      "tags": [
        "Saba Capital",
        "Blue Owl Capital",
        "private credit",
        "BDC",
        "activist investing",
        "Boaz Weinstein"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1664575602276-acd073f104c1?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw0fHxidXNpbmVzc3xlbnwwfDB8fHwxNzcxNjI4NTg2fDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-20/saba-and-cox-announce-tender-offers-for-blue-owl-bdc-shares",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T23:03:07.025Z"
    },
    {
      "id": "ps-1771627625265-m04r",
      "slug": "nasa-sets-march-6-launch-for-artemis-ii-humanity-s-farthest-",
      "headline": "NASA Sets March 6 Launch for Artemis II, Humanity's Farthest Space Voyage",
      "subheadline": "Four astronauts will loop around the far side of the Moon in a 10-day mission, the first crewed lunar flight in over 50 years",
      "body": "NASA has confirmed a target launch date of March 6 for Artemis II, the mission that will send four astronauts around the Moon and back — marking humanity's deepest venture into space and the first crewed lunar voyage since the Apollo era ended in 1972.\n\nThe agency locked in the date after completing a successful \"wet dress rehearsal\" at Kennedy Space Center in Florida on Thursday, a critical test in which the 98-meter-tall Space Launch System (SLS) rocket was fully loaded with propellant and taken through its countdown sequence. The milestone came on the team's second attempt; an earlier rehearsal in early February was cut short by a hydrogen fuel leak at the launch pad. NASA's Lori Glaze told a Friday press conference that seal and filter issues had been resolved, and that the rocket was fueled within the planned timeline. The four-person crew — Americans Reid Wiseman, Victor Glover, and Christina Koch, joined by Canadian astronaut Jeremy Hansen — entered quarantine on Friday.\n\nThe 10-day mission profile calls for the crew to spend their first day orbiting Earth inside the Orion capsule, a cabin roughly the size of a minibus mounted atop the SLS. If systems check out, they will fire toward the Moon on a four-day transit, swinging around its far side at an altitude of 6,500 to 9,500 kilometers above the lunar surface. The astronauts will have several hours to study and photograph the Moon before beginning a four-day return trip, culminating in a splashdown in the Pacific Ocean. The SLS has flown only once before, carrying an uncrewed Orion capsule on the Artemis I test flight in November 2022.\n\nA successful Artemis II would set the stage for Artemis III, the mission intended to put boots on the lunar surface for the first time in more than half a century. NASA has targeted 2028 for that landing, though the timeline remains ambitious. SpaceX holds the contract to build the Artemis III lunar lander using a variant of its Starship vehicle, but persistent delays have prompted NASA to request an accelerated development plan. The agency has also asked Blue Origin, Jeff Bezos's space company, to propose a faster path to the Moon as a potential alternative.\n\nThe urgency is partly geopolitical. China has announced plans for a crewed lunar landing by 2030 and has demonstrated steady progress toward that goal. Both the United States and China are eyeing the Moon's south pole as the prime location for future bases, creating a new era of space competition that lends strategic weight to every launch window NASA can meet.",
      "category": "science",
      "importance": 9,
      "tags": [
        "NASA",
        "Artemis II",
        "Moon mission",
        "SLS",
        "space exploration",
        "SpaceX",
        "lunar landing"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/041d/live/dd9135c0-0e80-11f1-801d-ed3cff6bf876.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/c86y1g6wde3o?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T22:47:05.265Z"
    },
    {
      "id": "ps-1771626777547-t2v2",
      "slug": "russian-fuel-tanker-headed-for-cuba-tests-trump-sanctions-re",
      "headline": "Russian Fuel Tanker Headed for Cuba Tests Trump Sanctions Regime",
      "subheadline": "The shipment challenges U.S. blockade enforcement as Cuba's energy crisis deepens and geopolitical tensions mount",
      "body": "A tanker believed to be loaded with Russian fuel is currently en route to Cuba, setting up a direct confrontation with the Trump administration's sanctions apparatus as the Caribbean island nation grapples with a worsening energy emergency.\n\nThe vessel's voyage, first reported by Bloomberg on February 20, represents one of the most visible tests yet of Washington's willingness and ability to enforce its economic restrictions on both Cuba and Russia simultaneously. The Trump administration has pursued an aggressive sanctions posture toward Havana, building on measures tightened during the president's first term and further expanded since his return to office. Russia, meanwhile, remains subject to sweeping U.S. financial and trade penalties stemming from its invasion of Ukraine.\n\nCuba has been mired in a severe energy crisis that has left millions of residents enduring rolling blackouts, fuel shortages, and collapsing infrastructure. The island's antiquated power grid, heavily dependent on imported petroleum, has struggled to meet even basic demand. Russia has historically been a key energy supplier to Cuba, stepping into a role once filled by Venezuela, whose own economic troubles have curtailed its ability to deliver subsidized oil to allied nations.\n\nThe shipment poses a delicate enforcement question for Washington. Intercepting or deterring the tanker would signal robust sanctions enforcement but could escalate tensions with Moscow at a moment when U.S.-Russia relations are already under intense scrutiny. Allowing the delivery to proceed, however, risks undermining the credibility of the broader sanctions framework and inviting further attempts to circumvent American restrictions. The scenario also highlights the persistent challenge of policing global maritime trade routes, where sanctions evasion tactics — including ship-to-ship transfers, flag changes, and opaque ownership structures — have become increasingly sophisticated.\n\nThe situation underscores the broader geopolitical chess match playing out in the Western Hemisphere, where Russia has maintained strategic relationships with Cuba, Venezuela, and Nicaragua even as the United States has sought to isolate those governments economically and diplomatically. How the Trump administration responds to this particular shipment could set a precedent for future enforcement actions and signal its priorities in balancing Cuba policy against its wider approach to Russia.",
      "category": "business",
      "importance": 6,
      "tags": [
        "Cuba",
        "Russia",
        "sanctions",
        "Trump",
        "energy crisis",
        "oil tanker",
        "geopolitics"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1696148899432-13ff6c14b8e2?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw4fHxydXNzaWFuJTIwZnVlbCUyMHRhbmtlcnxlbnwwfDB8fHwxNzcxNjI2Nzc3fDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-20/cuba-bound-tanker-carrying-russian-fuels-to-test-trump-blockade",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T22:32:57.547Z"
    },
    {
      "id": "ps-1771625889964-4e8j",
      "slug": "supreme-court-tariff-ruling-sparks-rally-in-emerging-market-",
      "headline": "Supreme Court Tariff Ruling Sparks Rally in Emerging-Market Assets",
      "subheadline": "BlackRock's flagship emerging-market ETF surges to all-time high as currencies recover weekly losses following landmark decision",
      "body": "Emerging-market stocks, currencies, and bonds rallied sharply after the U.S. Supreme Court struck down President Donald Trump's sweeping global tariffs, removing one of the most significant headwinds that had weighed on developing economies for months.\n\nThe landmark ruling sent a wave of relief through global markets, with emerging-market currencies erasing their weekly losses in a single session. BlackRock's flagship emerging-market exchange-traded fund surged to a record high as investors rapidly repriced the outlook for trade-dependent economies that had been most vulnerable to the tariff regime. The decision effectively invalidated the broad-based import duties that Trump had imposed, which had disrupted supply chains and dampened growth prospects across Asia, Latin America, and other developing regions.\n\nThe court's intervention marks a pivotal turning point for emerging markets, which had been caught in the crossfire of escalating trade tensions. Nations that rely heavily on exports to the United States — including major manufacturing hubs in Southeast Asia and commodity producers in Latin America — stand to benefit most directly from the removal of tariff barriers. The ruling also alleviates pressure on central banks in developing countries that had been forced to defend their currencies against dollar strength driven in part by trade uncertainty.\n\nThe rally in the BlackRock ETF to all-time highs signals that institutional investors are moving quickly to rebuild positions in emerging-market assets. Portfolio flows into developing economies had slowed significantly during the tariff regime, as fund managers weighed the risks of holding assets in countries facing potential export disruptions. With that overhang now lifted by the Supreme Court, strategists expect a period of sustained inflows as valuations in many emerging markets remain attractive relative to developed-market peers.\n\nWhile the immediate market reaction has been overwhelmingly positive, analysts caution that the broader policy landscape remains uncertain. The Trump administration could pursue alternative trade measures that fall within constitutional boundaries, and geopolitical tensions — including building concerns over Iran — continue to pose risks to emerging-market stability. Still, for now, the court's decision has delivered the clearest positive catalyst for developing economies in months, resetting expectations for growth, trade, and capital flows across the emerging world.",
      "category": "markets",
      "importance": 8,
      "tags": [
        "emerging-markets",
        "Supreme Court",
        "tariffs",
        "BlackRock",
        "ETF",
        "trade-policy",
        "currencies"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1748267887709-25aaa0c30115?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxNXx8ZW1lcmdpbmctbWFya2V0cyUyMFN1cHJlbWUlMjBDb3VydHxlbnwwfDB8fHwxNzcxNjI0MDkzfDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-20/em-stocks-currencies-decline-as-iran-tensions-build-oil-spikes",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T22:18:09.964Z"
    },
    {
      "id": "ps-1771625904613-gjny",
      "slug": "purpose-built-ai-catches-92-of-defi-exploits-dwarfing-generi",
      "headline": "Purpose-Built AI Catches 92% of DeFi Exploits, Dwarfing Generic Models",
      "subheadline": "New open-source benchmark reveals domain-specific AI detected vulnerabilities worth $96.8M versus just $7.5M for a standard GPT-5.1 agent",
      "body": "A specialized artificial intelligence security system identified exploitable vulnerabilities in 92 percent of real-world decentralized finance smart contracts that had already been hacked, dramatically outperforming a general-purpose AI coding agent that caught only 34 percent, according to new research published Thursday by AI security firm Cecuro.\n\nThe study tested both systems against a benchmark of 90 smart contracts exploited between October 2024 and early 2026, collectively representing $228 million in verified losses. The purpose-built agent flagged flaws tied to $96.8 million in exploit value, while a baseline agent built on OpenAI's GPT-5.1 managed to cover just $7.5 million. Critically, both systems ran on the same underlying frontier model — the performance gap stemmed entirely from domain-specific methodology, structured audit phases, and DeFi-focused security heuristics layered on top by Cecuro's team. Several of the exploited contracts in the dataset had previously passed professional security audits before being drained.\n\nThe findings land at a particularly fraught moment for crypto security. Separate research from Anthropic and OpenAI has demonstrated that AI agents can now execute end-to-end exploits on most known vulnerable smart contracts at an average cost of roughly $1.22 per attempt, with offensive exploit capability reportedly doubling every 1.3 months. North Korean hacking operations have already begun integrating AI tools to automate and scale their attacks, widening what researchers describe as a growing asymmetry between offensive and defensive AI capabilities in the crypto ecosystem.\n\nCecuro has open-sourced its benchmark dataset, evaluation framework, and baseline agent on GitHub, but the firm declined to release its full specialized security agent, citing concerns that the tooling could be repurposed by attackers. The company argues that many DeFi teams continue to rely on general-purpose AI tools or periodic one-off audits — an approach the benchmark data suggests is inadequate for catching the high-value, complex vulnerabilities that sophisticated attackers target.\n\nThe research underscores a broader tension in the race between AI-powered offense and defense in decentralized finance. As the cost and technical barrier to launching AI-driven exploits continues to plummet, the results suggest that generic AI models alone are insufficient for meaningful smart contract security — and that the application layer built around a model may matter far more than the model itself.",
      "category": "tech",
      "importance": 6,
      "tags": [
        "artificial intelligence",
        "DeFi",
        "cybersecurity",
        "smart contracts",
        "crypto exploits"
      ],
      "imageUrl": "https://cdn.sanity.io/images/s3y3vcno/production/56a4c15b5193f534a64f932d3e14fdd33fafac55-1919x1080.jpg?auto=format&amp;w=960&amp;h=540&amp;crop=focalpoint&amp;fit=clip&amp;q=75&amp;fm=jpg",
      "sourceUrl": "https://www.coindesk.com/business/2026/02/20/specialized-ai-detects-92-of-real-world-defi-exploits",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T22:18:24.614Z"
    },
    {
      "id": "ps-1771624987782-wgmm",
      "slug": "canadian-stocks-rally-after-u-s-supreme-court-strikes-down-t",
      "headline": "Canadian Stocks Rally After U.S. Supreme Court Strikes Down Trump Tariffs",
      "subheadline": "Canada's benchmark index climbs as the high court's ruling removes a major overhang on North American trade",
      "body": "Canadian equities surged on Thursday after the United States Supreme Court struck down President Donald Trump's sweeping global tariffs, removing one of the most significant sources of uncertainty that had weighed on cross-border commerce for months.\n\nCanada's benchmark stock index posted broad-based gains as investors recalibrated their outlook for the country's export-heavy economy. The ruling effectively dismantles a tariff regime that had disrupted supply chains and dampened business confidence across North America, particularly in Canada, where roughly three-quarters of exports are destined for the U.S. market. Sectors with heavy American exposure — including energy, manufacturing, and materials — were among the biggest beneficiaries of the post-ruling rally.\n\nThe Supreme Court's decision marks a pivotal moment in the legal battle over Trump's trade agenda, which had drawn challenges from multiple trading partners and domestic industry groups arguing the tariffs exceeded presidential authority. While the full scope of the ruling and its implications for existing trade agreements remain subject to legal interpretation, markets moved swiftly to price in a more favorable environment for Canadian exporters. The Canadian dollar also strengthened against its U.S. counterpart in the wake of the news.\n\nThe tariffs had been a persistent drag on Canadian markets since their implementation, prompting retaliatory measures from Ottawa and fueling fears of a broader economic slowdown. Canadian business leaders and policymakers had repeatedly warned that prolonged trade barriers risked undermining the deeply integrated North American economy, where goods and components routinely cross the border multiple times during production.\n\nAnalysts cautioned that volatility could persist as the legal and political fallout from the ruling unfolds. The Trump administration could pursue alternative trade measures or seek legislative avenues to reimpose duties, leaving some uncertainty intact. Still, for now, the court's decision has provided a significant tailwind for Canadian equities and a measure of relief to businesses on both sides of the border that had been navigating an unpredictable trade landscape.",
      "category": "markets",
      "importance": 9,
      "tags": [
        "Canadian stocks",
        "Trump tariffs",
        "Supreme Court",
        "trade policy",
        "North American trade"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1718332521992-4a407b3b23b0?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwyfHxDYW5hZGlhbiUyMHN0b2NrcyUyMFRydW1wJTIwdGFyaWZmc3xlbnwwfDB8fHwxNzcxNjI0OTg3fDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-20/canadian-stocks-whipsaw-after-trump-tariffs-struck-down",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T22:03:07.782Z"
    },
    {
      "id": "ps-1771623188968-1t6g",
      "slug": "supreme-court-strikes-down-trump-s-global-tariffs-in-6-3-rul",
      "headline": "Supreme Court Strikes Down Trump's Global Tariffs in 6-3 Ruling",
      "subheadline": "Chief Justice Roberts writes majority opinion finding president exceeded his authority; markets rally on the decision",
      "body": "The United States Supreme Court on Thursday declared President Donald Trump's sweeping global tariffs unconstitutional, ruling 6-3 that the president overstepped his executive authority in imposing the trade levies. Chief Justice John Roberts authored the majority opinion in what stands as one of the most consequential checks on presidential trade power in decades.\n\nThe decision immediately reverberated through financial markets. U.S. equities and Treasury yields jumped on the news, while the dollar weakened — a signal that investors view the removal of tariffs as a net positive for the domestic economy and a potential easing of inflationary pressures that had built up since the duties were first imposed. The tariffs, which targeted imports from countries around the world, had been a cornerstone of Trump's economic agenda and a persistent source of friction with trading partners.\n\nPresident Trump responded sharply, calling the ruling a \"disgrace\" — language that underscores the political stakes of the decision and sets the stage for a potential confrontation between the executive branch and the judiciary over the limits of trade authority. The ruling effectively curtails the president's ability to unilaterally impose broad-based tariffs without explicit congressional authorization, a question that legal scholars and trade policy experts have debated since the tariffs were first enacted.\n\nThe 6-3 split suggests the court's decision crossed ideological lines, with Roberts — a George W. Bush appointee — leading a coalition that included justices from both conservative and liberal wings of the bench. The ruling carries significant implications not only for current trade policy but for the broader balance of power between Congress and the White House on economic matters. Constitutional experts say the opinion could reshape how future administrations approach tariff authority under statutes like the International Emergency Economic Powers Act and the Trade Expansion Act of 1962.\n\nFor businesses and consumers, the practical effect may be substantial. The global tariffs had raised costs across a wide range of imported goods, contributing to elevated prices and supply chain adjustments. Their removal could provide relief to industries from manufacturing to retail, though the timeline for unwinding the tariffs and any potential legislative response from Congress remains unclear. The White House has not yet indicated whether it will seek alternative legal avenues to reimpose the duties.",
      "category": "breaking",
      "importance": 10,
      "tags": [
        "Supreme Court",
        "tariffs",
        "Trump",
        "trade policy",
        "constitutional law",
        "markets"
      ],
      "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iOhKLBvpGeck/v3/-1x-1.webp",
      "sourceUrl": "https://www.bloomberg.com/news/videos/2026-02-20/us-supreme-court-strikes-down-trump-s-global-tariffs-video",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T21:33:08.968Z"
    },
    {
      "id": "ps-1771618705921-im22",
      "slug": "trump-s-tariff-regime-reshapes-global-trade-as-costs-mount",
      "headline": "Trump's Tariff Regime Reshapes Global Trade as Costs Mount",
      "subheadline": "A sprawling web of import levies across sectors and countries is altering supply chains and raising prices for businesses and consumers",
      "body": "President Donald Trump's expansive tariff agenda has grown into one of the most aggressive trade policy campaigns in modern American history, imposing levies across a broad swath of industries and trading partners that are rippling through the global economy.\n\nThe administration has enacted tariffs targeting steel, aluminum, automobiles, and a wide range of Chinese goods, among other categories, creating a complex and shifting landscape that businesses must navigate in real time. The cumulative effect has pushed the effective U.S. tariff rate to levels not seen in decades, according to trade economists, with some estimates suggesting it now exceeds rates that prevailed before the mid-20th century liberalization of global commerce. China has faced some of the steepest levies, with tariffs on certain goods reaching well above 100 percent after successive rounds of escalation.\n\nThe economic consequences are increasingly tangible. Importers face higher costs that many are passing along to consumers, contributing to upward pressure on prices for everything from electronics to household goods. Manufacturers that depend on imported components have been forced to reconfigure supply chains, in some cases shifting sourcing to countries not subject to the highest tariffs — a phenomenon economists call trade diversion. Retaliatory measures from trading partners, particularly China, Canada, and the European Union, have meanwhile squeezed American exporters, especially in agriculture.\n\nThe administration has argued the tariffs serve multiple strategic objectives: reducing the U.S. trade deficit, reviving domestic manufacturing, and providing leverage in bilateral negotiations. Some sectors, notably steel production, have seen modest employment gains. But broader economic assessments have been more cautious. Multiple analyses suggest the tariffs function as a tax on American consumers and businesses, with the costs outweighing the targeted benefits. The Federal Reserve and private forecasters have flagged tariff-related uncertainty as a drag on business investment.\n\nAs the tariff regime continues to evolve — with pauses, exemptions, and new levies announced at irregular intervals — the lack of predictability has become a challenge in its own right. Companies report difficulty planning capital expenditures when the rules of international commerce can shift with a single presidential announcement. The ultimate economic toll will depend on whether the tariffs prove to be temporary negotiating tools or permanent features of U.S. trade policy, a question that remains unresolved as the administration presses forward on multiple fronts simultaneously.",
      "category": "business",
      "importance": 7,
      "tags": [
        "tariffs",
        "trade policy",
        "Trump administration",
        "global trade",
        "supply chains",
        "U.S. economy"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1678716193852-e6ca47a46b4f?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxNnx8dGFyaWZmcyUyMHRyYWRlJTIwcG9saWN5fGVufDB8MHx8fDE3NzE2MTg3MDV8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/graphics/trump-tariffs-tracker/",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T20:18:25.921Z"
    },
    {
      "id": "ps-1771617810051-wnxd",
      "slug": "trump-announces-10-global-tariff-hours-after-supreme-court-s",
      "headline": "Trump Announces 10% Global Tariff Hours After Supreme Court Strikes Down Previous Levies",
      "subheadline": "President invokes Section 122 authority to reimpose sweeping trade barriers, declares all national security tariffs remain in effect",
      "body": "President Donald Trump moved swiftly on Friday to reimpose broad trade barriers on imports worldwide, announcing a 10% global tariff just hours after the U.S. Supreme Court struck down his administration's earlier tariff regime as unconstitutional.\n\nSpeaking at a White House press conference, Trump said the new levy — which would be layered on top of existing duties — would be authorized under Section 122 of the Trade Act of 1974, a rarely invoked provision that grants the president temporary authority to impose tariffs of up to 15% for 150 days to address large and serious balance-of-payments deficits. The president simultaneously declared that all national security tariffs imposed under Section 232, as well as existing Section 301 tariffs targeting specific countries and industries, remain in full force and effect.\n\nThe announcement represents a dramatic legal pivot by the administration, which had relied on broader executive authority to justify its earlier global tariff program before the Supreme Court invalidated that approach. By shifting to Section 122, Trump is effectively daring opponents to mount a fresh legal challenge while maintaining economic pressure on trading partners. Legal experts have noted, however, that Section 122 imposes significant constraints — including a cap on tariff rates and a built-in expiration — that could limit the administration's ability to sustain the policy long-term without congressional action.\n\nThe Supreme Court's ruling earlier Friday marked one of the most significant checks on presidential trade authority in decades, finding that the administration had exceeded its statutory power in levying sweeping tariffs without explicit congressional authorization. Markets had initially rallied on the decision, but gains were quickly pared as Trump signaled his intent to find alternative legal pathways to maintain the tariffs. The rapid response underscores the administration's determination to preserve its aggressive trade posture as a cornerstone of economic policy.\n\nThe reimposition of a 10% blanket tariff is likely to reignite tensions with major trading partners, including the European Union, China, and Japan, all of which had signaled relief at the court's ruling. Business groups and importers, who had lobbied aggressively against the earlier tariff regime, now face renewed uncertainty over supply chains and input costs. With the Section 122 clock ticking from the moment of imposition, attention will turn quickly to whether Congress moves to codify or block the tariffs — and whether a second round of legal challenges can reach the courts before the duties take full economic effect.",
      "category": "breaking",
      "importance": 10,
      "tags": [
        "tariffs",
        "Supreme Court",
        "trade policy",
        "Trump",
        "Section 122",
        "global trade"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1640537125136-84808f980658?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHw4fHx0YXJpZmZzJTIwU3VwcmVtZSUyMENvdXJ0fGVufDB8MHx8fDE3NzE2MTUxMTN8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/videos/2026-02-20/trump-to-impose-10-global-tariff-after-scotus-ruling-video",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T20:03:30.051Z"
    },
    {
      "id": "ps-1771614223694-n35u",
      "slug": "dubai-opens-secondary-market-for-tokenized-real-estate-on-xr",
      "headline": "Dubai Opens Secondary Market for Tokenized Real Estate on XRP Ledger",
      "subheadline": "The $5 million pilot marks phase two of Dubai's plan to tokenize $16 billion in property by 2033",
      "body": "Dubai's government real estate authority has launched a secondary trading market for blockchain-based property tokens, advancing one of the most ambitious tokenization experiments in the world. The Dubai Land Department (DLD) and infrastructure partner Ctrl Alt announced on Friday that roughly 7.8 million tokens representing fractional ownership in ten Dubai properties — valued at over $5 million — are now eligible for resale on a controlled trading platform.\n\nThe tokens, built on Ripple's XRP Ledger and secured through Ripple Custody, are directly backed by title deeds and synced with Dubai's official land registry. A compliance layer using so-called Asset-Referenced Virtual Assets (ARVAs) governs who can trade and under what conditions, ensuring that every transaction is reflected in the emirate's property records. The setup represents a deliberate effort to bridge decentralized blockchain infrastructure with traditional real estate law.\n\nThe secondary market launch constitutes the second phase of a pilot that began when the DLD partnered with Ctrl Alt and Prypco to tokenize property deeds on the XRP Ledger. The broader ambition is sweeping: Dubai aims to tokenize 7% of its real estate market — approximately $16 billion worth — by 2033. If successful, the initiative could position the city-state as the global leader in blockchain-based property transactions, where ownership transfers that currently take days or weeks could settle in minutes.\n\nThe project arrives at a moment of growing momentum for real-world asset tokenization globally. A Deloitte report published last year projected that $4 trillion in real estate will be tokenized by 2035, implying annual growth of roughly 27%. Yet significant obstacles remain. An EY analysis has noted that uneven regulation across jurisdictions continues to limit adoption, while thin secondary market liquidity — the very problem Dubai's pilot seeks to address — constrains investor interest. In the United States, real estate billionaire Barry Sternlicht has publicly expressed interest in tokenization but cited regulatory barriers as a major impediment.\n\nDubai's controlled trading environment is designed to test market infrastructure, investor protections, and legal alignment before any broader rollout. While $5 million in tradable property tokens remains a tiny fraction of the emirate's roughly $229 billion real estate market, the pilot's significance lies in what it is proving: that government registries and blockchain settlement can operate in tandem. Whether that model scales to $16 billion will depend on liquidity depth, regulatory durability, and whether investors trust tokens as much as traditional title deeds.",
      "category": "markets",
      "importance": 6,
      "tags": [
        "tokenization",
        "Dubai",
        "real estate",
        "XRP Ledger",
        "Ripple",
        "blockchain",
        "real-world assets"
      ],
      "imageUrl": "https://cdn.sanity.io/images/s3y3vcno/production/8120f19a9e4ab07a954184d8a19c7b3decd072de-1920x1080.png?auto=format&amp;w=960&amp;h=540&amp;crop=focalpoint&amp;fit=clip&amp;q=75&amp;fm=jpg",
      "sourceUrl": "https://www.coindesk.com/business/2026/02/20/dubai-unveils-secondary-market-for-usd5-million-tokenized-real-estate-via-xrp-ledger",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T19:03:43.694Z"
    },
    {
      "id": "ps-1771613326260-7yhf",
      "slug": "oil-prices-hold-near-six-month-high-amid-trump-s-iran-strike",
      "headline": "Oil Prices Hold Near Six-Month High Amid Trump's Iran Strike Warning",
      "subheadline": "President issues 15-day ultimatum to Tehran over nuclear program as U.S. forces gather in the Middle East",
      "body": "Crude oil prices remained elevated near six-month highs on Thursday after President Donald Trump disclosed he is considering a limited military strike against Iran, injecting fresh geopolitical risk into global energy markets already grappling with tight supply dynamics.\n\nTrump's remarks, in which he warned Tehran it had no more than 15 days to reach an agreement over its nuclear program, came as U.S. military forces were reported gathering in the Middle East. The combination of an explicit ultimatum and visible force posturing sent a clear signal that Washington is prepared to escalate if diplomatic efforts stall. Iran, an OPEC member that produces roughly 3.2 million barrels per day, sits at a critical chokepoint for global oil flows — any disruption to its output or to shipping through the Strait of Hormuz could ripple through markets worldwide.\n\nThe threat alone has been sufficient to buoy prices. Oil traders have been pricing in a growing geopolitical risk premium, reflecting the possibility that even a limited strike could trigger retaliatory actions that disrupt regional production or tanker traffic. The Strait of Hormuz, through which approximately 20% of the world's petroleum passes daily, remains the most watched bottleneck in global energy logistics. Market participants are now closely monitoring diplomatic channels for any indication of whether Tehran will engage in negotiations or dig in ahead of the deadline.\n\nThe standoff adds another layer of complexity to an oil market already shaped by OPEC+ production management, sanctions enforcement, and shifting demand forecasts. Analysts note that sustained elevated prices could compound inflationary pressures in the United States and Europe at a time when central banks are navigating delicate monetary policy paths. For consumers, a prolonged crisis could translate into higher gasoline and heating costs heading into the spring.\n\nWith the 15-day window now ticking, energy markets are likely to remain volatile as traders weigh the probability of a diplomatic resolution against the risk of military action. The coming days will test whether Trump's ultimatum represents a genuine redline or a negotiating tactic designed to force Tehran back to the table.",
      "category": "markets",
      "importance": 8,
      "tags": [
        "oil prices",
        "Iran",
        "Trump",
        "Middle East",
        "geopolitics",
        "crude oil",
        "energy markets"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1656567298829-480f3666addc?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxfHxvaWwlMjBwcmljZXMlMjBJcmFufGVufDB8MHx8fDE3NzE2MTMzMjZ8MA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/articles/2026-02-19/latest-oil-market-news-and-analysis-for-feb-20",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T18:48:46.260Z"
    },
    {
      "id": "ps-1771611447873-1psy",
      "slug": "uk-man-faces-48-charges-for-drugging-wife-recruiting-men-to-",
      "headline": "UK Man Faces 48 Charges for Drugging Wife, Recruiting Men to Assault Her",
      "subheadline": "Twelve co-defendants also charged in case spanning decades; trial set for September in Manchester",
      "body": "A man in his sixties from Stockport, Greater Manchester, has been charged with 48 criminal counts for allegedly drugging his wife into unconsciousness and facilitating her sexual assault by multiple men over a period stretching back to the early 2000s.\n\nThe husband, who cannot be named for legal reasons, faces charges including conspiracy to rape, sexual assault by penetration, and conspiracy to administer a substance with intent to commit a sexual offence. Twelve other men, ranging in age from 28 to 73, are co-defendants in the case. All 13 appeared at Manchester Minshull Street Crown Court, where seven — including the husband — entered not guilty pleas to all charges. Five defendants were not asked to enter pleas at this stage. One man pleaded guilty to conspiracy to commit rape, conspiracy to administer a substance with intent, conspiracy to commit sexual assault by penetration, and one count of committing sexual assault by penetration.\n\nMembers of the woman's family were present in the public gallery during the hearing. The allegations describe a prolonged pattern of abuse in which the victim was rendered unconscious before being subjected to sexual violence by her husband and men he allegedly recruited. The case bears striking similarities to the high-profile French trial of Dominique Pelicot, who was convicted in December 2024 of drugging his wife Gisèle and inviting dozens of strangers to rape her over nearly a decade.\n\nA further hearing is scheduled for March, with a full trial set to begin on September 1. The proceedings are expected to last approximately 12 weeks, reflecting the breadth and complexity of the charges. Greater Manchester Police are leading the investigation.\n\nThe case underscores ongoing concerns about drug-facilitated sexual violence within intimate relationships — crimes that experts say remain significantly underreported due to victims being unaware of the abuse while it occurs. Legal observers note that the scale of the alleged conspiracy, involving more than a dozen defendants over two decades, makes it one of the most significant cases of its kind to come before UK courts.",
      "category": "breaking",
      "importance": 8,
      "tags": [
        "sexual assault",
        "UK crime",
        "Manchester",
        "drug-facilitated abuse",
        "criminal trial"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/3f1a/live/dcd53690-0e71-11f1-9acc-6bf6c7adf476.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/cqxde27ep5qo?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T18:17:27.873Z"
    },
    {
      "id": "ps-1771611507034-hfos",
      "slug": "trade-linked-stocks-surge-after-supreme-court-strikes-down-t",
      "headline": "Trade-Linked Stocks Surge After Supreme Court Strikes Down Tariffs",
      "subheadline": "Retailers, industrials, and automakers rally sharply as high court rules against Trump's sweeping global trade levies",
      "body": "Shares of trade-sensitive companies across the retail, industrial, and automotive sectors jumped sharply on Friday after the U.S. Supreme Court struck down President Donald Trump's sweeping global tariffs, removing a major overhang that had weighed on corporate earnings outlooks and supply chain planning for months.\n\nThe ruling, which invalidated the broad tariff regime Trump had imposed on imports from countries around the world, sent an immediate jolt through equity markets. Retailers — many of which rely heavily on imported consumer goods — were among the biggest beneficiaries, alongside industrial manufacturers and automakers whose complex global supply chains had been disrupted and made more costly by the levies. The decision effectively unwound one of the most consequential trade policy experiments in modern American history, restoring a degree of certainty to businesses that had struggled to price in the unpredictable tariff landscape.\n\nThe Supreme Court's intervention marks a dramatic check on executive trade authority and is likely to reshape the legal and political boundaries of presidential power over commerce. While the specifics of the court's reasoning were not immediately detailed, the market's reaction suggested investors had been pricing in at least some probability that the tariffs would remain in place. The swift rally indicated significant pent-up demand for exposure to trade-dependent sectors that had been under pressure.\n\nFor retailers, the ruling could translate into lower input costs and improved margins in coming quarters, particularly for companies that source heavily from Asia. Automakers, which had faced the dual burden of higher component costs and retaliatory measures from trading partners, stand to benefit from both reduced expenses and potentially reopened export markets. Industrial firms with sprawling international operations may see relief on both the cost and revenue sides of their ledgers.\n\nThe broader implications for U.S. trade policy remain to be seen. The decision could constrain future administrations' ability to impose unilateral tariffs without congressional approval, fundamentally altering the balance of power over trade. Market participants will be closely watching for any legislative response from Capitol Hill, as well as the administration's next moves in the wake of what amounts to a historic judicial rebuke of its economic agenda.",
      "category": "markets",
      "importance": 9,
      "tags": [
        "Supreme Court",
        "tariffs",
        "trade policy",
        "stock market",
        "Trump administration",
        "retailers",
        "automakers"
      ],
      "imageUrl": "https://images.unsplash.com/photo-1648344621504-88ee18f2864a?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4Nzg4ODZ8MHwxfHNlYXJjaHwxNHx8U3VwcmVtZSUyMENvdXJ0JTIwdGFyaWZmc3xlbnwwfDB8fHwxNzcxNjA5NzUzfDA&ixlib=rb-4.1.0&q=80&w=1080",
      "sourceUrl": "https://www.bloomberg.com/news/videos/2026-02-20/trade-linked-stocks-rise-as-court-strikes-down-tariffs-video",
      "sourceName": "Bloomberg",
      "publishedAt": "2026-02-20T18:18:27.034Z"
    },
    {
      "id": "ps-1771608680835-p41q",
      "slug": "police-search-former-prince-andrew-s-homes-after-historic-ar",
      "headline": "Police Search Former Prince Andrew's Homes After Historic Arrest",
      "subheadline": "Andrew Mountbatten-Windsor held for nearly 11 hours on suspicion of sharing confidential trade secrets with Jeffrey Epstein",
      "body": "British police conducted extensive searches of two properties linked to Andrew Mountbatten-Windsor on Friday, one day after the former prince was arrested on suspicion of misconduct in public office — marking the first arrest of a member of the royal family in nearly four centuries.\n\nThames Valley Police detained the 66-year-old at 8 a.m. Thursday — his birthday — at his temporary residence on King Charles III's Sandringham estate, holding him for nearly 11 hours at a nearby police station before releasing him. Officers have since completed their search of Wood Farm, his current accommodation on the Sandringham grounds, but continued combing through Royal Lodge, the 30-room Windsor residence from which he was evicted earlier this month after his brother stripped him of all royal titles and honors in October. Unmarked vans, believed to be police vehicles, were observed entering the Royal Lodge grounds throughout Friday morning.\n\nThe investigation centers on allegations that Mountbatten-Windsor passed confidential government information to the late convicted sex offender Jeffrey Epstein while serving as a U.K. trade envoy. Emails released last month by the U.S. Department of Justice appear to show him forwarding official reports on diplomatic visits to Hong Kong, Vietnam, and Singapore — one sent just five minutes after he received it. A separate communication allegedly contained a confidential brief on investment opportunities tied to reconstruction in Afghanistan's Helmand Province. Mountbatten-Windsor has consistently denied any wrongdoing but has not addressed the most recent allegations stemming from the so-called Epstein files.\n\nLegal experts cautioned that the road to any prosecution remains uncertain. Criminal defense lawyer Sean Caulfield noted that misconduct in public office is \"notoriously difficult to prove,\" beginning with the threshold question of whether Andrew's trade envoy role legally constitutes that of a public officer. The Crown Prosecution Service will ultimately decide whether to bring charges, applying a two-stage test weighing the realistic prospect of conviction and the public interest. Mountbatten-Windsor, who remains eighth in line to the throne, has not been charged.\n\nThe arrest represents one of the gravest crises to confront the House of Windsor in its century-long history, drawing comparisons to the abdication of Edward VIII in 1936 and the death of Princess Diana in 1997. It is the first arrest of a royal since King Charles I, whose detention precipitated the English Civil War and his eventual execution. King Charles III issued a brief statement saying \"the law must take its course\" but declined further comment. Separately, police forces across the U.K. are conducting their own investigations into Epstein's ties to Britain, including reviews of flight logs at multiple airports. The trafficking allegations previously made by the late Virginia Giuffre were not part of Thursday's arrest, though they remain under separate review.",
      "category": "breaking",
      "importance": 9,
      "tags": [
        "Prince Andrew",
        "Jeffrey Epstein",
        "British monarchy",
        "misconduct in public office",
        "Thames Valley Police",
        "King Charles III"
      ],
      "imageUrl": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7109x3997+0+540/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fee%2F58%2Fc6fe821d489780cf6485e6cf85aa%2Fap26051383066859.jpg",
      "sourceUrl": "https://www.npr.org/2026/02/20/g-s1-110915/uk-former-prince-andrew-epstein-investigation",
      "sourceName": "NPR News",
      "publishedAt": "2026-02-20T17:31:20.835Z"
    },
    {
      "id": "ps-1771608223355-59yq",
      "slug": "u-s-military-buildup-near-iran-reaches-critical-mass-as-seco",
      "headline": "U.S. Military Buildup Near Iran Reaches Critical Mass as Second Carrier Deploys",
      "subheadline": "Pentagon positions forces capable of sustained bombing campaign while Trump remains noncommittal on use of force",
      "body": "The United States has amassed military assets in the Middle East sufficient to sustain a weeks-long bombing campaign against Iran, with a second aircraft carrier moving into the Mediterranean and 50 additional fighter jets arriving in the region, according to NPR reporting on February 20.\n\nThe buildup significantly exceeds what military analysts say would be needed simply to pressure Tehran during nuclear negotiations, raising questions about the administration's endgame. President Trump has declined to specify his objectives but has demanded that Iran effectively dismantle its nuclear program and make additional concessions — terms Tehran has historically rejected. Alex Vatanka, an Iran expert at the Middle East Institute, told NPR that Iranian leadership anticipates a military conflict with the United States larger than last summer's 12-day war with Israel, though not on the scale of the 2003 Iraq invasion.\n\nThe military escalation comes as Trump simultaneously pursues an expansive diplomatic agenda through his newly created Board of Peace, which held its inaugural meeting on February 19. The administration used the occasion to unveil ambitious development plans for Gaza's coastline, including high-end condominiums and skyscrapers. Trump announced that member states have pledged $7 billion for Gaza's reconstruction, with the United States committing an additional $10 billion. The board, initially formed to oversee the Gaza ceasefire, is being positioned as a vehicle for addressing multiple global conflicts — a scope that has alarmed some world leaders who fear it could sideline the United Nations. Critics warn that the world's most powerful nation establishing an alternative multilateral framework threatens to undermine the U.N.'s role as a platform where smaller countries participate in international decision-making.\n\nThe dual developments — military brinkmanship with Iran and a bold reimagining of postwar Gaza — underscore the administration's willingness to reshape Middle Eastern geopolitics through both hard and soft power simultaneously. With Iran showing no signs of capitulating to American demands and the Board of Peace generating international unease, the coming weeks could prove pivotal for regional stability and the broader international order. The situation also arrives against the backdrop of significant domestic and allied tensions, including the unprecedented arrest of King Charles' brother Andrew Mountbatten-Windsor on suspicion of sharing sensitive government information, which British authorities continue to investigate.",
      "category": "breaking",
      "importance": 9,
      "tags": [
        "Iran",
        "U.S. military",
        "Middle East",
        "Board of Peace",
        "Gaza",
        "Trump",
        "nuclear negotiations"
      ],
      "imageUrl": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7755x4362+0+404/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc1%2Fcc%2F4f9efaaf4862a0d8ccf034d96f78%2Fgettyimages-2261210029.jpg",
      "sourceUrl": "https://www.npr.org/2026/02/20/g-s1-110892/up-first-newsletter-iran-us-military-board-of-peace-former-prince-andrew-arrest-kennedy-center",
      "sourceName": "NPR News",
      "publishedAt": "2026-02-20T17:23:43.355Z"
    },
    {
      "id": "ps-1771608073029-l1cr",
      "slug": "two-teenagers-sentenced-to-life-for-racist-murder-in-south-w",
      "headline": "Two Teenagers Sentenced to Life for Racist Murder in South Wales",
      "subheadline": "Kamran Aman, 38, was stabbed through the heart while delivering groceries to his mother's home in Barry",
      "body": "Two teenagers have been sentenced to life in prison for the racially motivated murder of Kamran Aman, a 38-year-old father who was attacked without provocation while delivering food to his mother's home in Barry, south Wales. Marcus Staniforth, 17, received a minimum term of 17 years, while a second defendant, 16, who cannot be named for legal reasons, was given a minimum of 15 years at Cardiff Crown Court.\n\nThe attack occurred just before midnight on June 30, when Aman parked his car a few doors from his mother's house on Barry Road after spending the day working and the evening with his wife and four-year-old daughter. The younger defendant, looking down from a bedroom window after hours of drinking, spotted Aman in his car and decided to attack him. After hurling racist abuse and attempting to enter the vehicle, the 16-year-old began punching Aman as he exited the car, with Staniforth quickly joining the assault. Witnesses described the beating as \"relentless,\" likening the attackers to a \"pack of animals.\" Staniforth then ran into a nearby house, returning 15 seconds later with a large kitchen knife that he swung \"multiple times,\" stabbing Aman once through the heart.\n\nAman managed to reach a neighbor's doorway, telling her \"I think I've been stabbed\" and \"I can't breathe\" as blood pooled on the floor. Even as the victim lay dying, the younger defendant bent over him shouting racist abuse. South Wales Police said Aman suffered \"abhorrent racist abuse before, during and after\" the assault. Staniforth attempted to destroy evidence by washing the knife and his hands with bleach, but both teenagers were arrested roughly 10 minutes later. His DNA was found on the weapon, and Aman's blood was recovered from Staniforth's shorts and the other defendant's shoes.\n\nJudge Mr. Justice Griffiths called Staniforth a \"very dangerous man indeed,\" telling him he had \"turned a failing attempt at beating a man into murder.\" Addressing the younger defendant, the judge said he had \"instigated a deliberate, unprovoked, sustained, violent racist attack\" and was \"old enough to know that to cause serious injury on a stranger because of his race was wrong.\" Defense counsel argued the 16-year-old suffered from autism spectrum disorder and ADHD that affected his emotional maturity, and that he had not known Staniforth would bring a knife. The court was not persuaded to significantly reduce the sentence.\n\nAman's wife, Khaleela James, told the court their daughter is now \"traumatised\" by her father's death and suffers from separation anxiety, fearing her mother will also not come home. \"There is a hole in our heart that can never be filled,\" she said, addressing the defendants, who showed no emotion. Aman's mother, Shahnaz Aman, said her surviving family members are now \"terrified\" and no longer visit Barry. Aliya Mohammed, CEO of Race Equality First, said the court's explicit recognition of the racial motive sends \"an important message that racism has been taken seriously by the courts,\" adding that racist violence harms entire communities beyond the immediate victim.",
      "category": "breaking",
      "importance": 7,
      "tags": [
        "hate crime",
        "racism",
        "Wales",
        "knife crime",
        "murder sentencing",
        "Barry"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/c7a3/live/4caa5f40-0c10-11f1-ad4b-755d3b02c9a5.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/c8r1kmz614po?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T17:21:13.029Z"
    },
    {
      "id": "ps-1771603361793-owem",
      "slug": "uk-athletics-pleads-guilty-to-corporate-manslaughter-of-para",
      "headline": "UK Athletics Pleads Guilty to Corporate Manslaughter of Paralympian",
      "subheadline": "Abdullah Hayayei, a UAE father of five, was killed when a metal cage collapsed on him during training in 2017",
      "body": "UK Athletics, the governing body for track and field in Britain, reversed its earlier plea on Friday and admitted guilt to the corporate manslaughter of Paralympian Abdullah Hayayei, who was killed during a training session in London nearly eight years ago.\n\nHayayei, a 36-year-old thrower from the United Arab Emirates and father of five, died in July 2017 when a metal cage fell on him at Newham Leisure Centre. He had been preparing for the World Para-athletics Championships in London, where he was due to compete in the F34 shot put, discus, and javelin events. The athlete had made his Paralympic debut at Rio 2016, finishing sixth in the javelin and seventh in the shot put, and had previously represented his country at the 2015 World Championships in Doha.\n\nThe guilty plea, entered at the Old Bailey, marks a dramatic reversal from March 2025, when UK Athletics had denied the charge. Keith Davies, 78, who served as head of sport for the 2017 World Para-athletics Championships, also changed his plea on Friday, admitting to a health and safety offense after previously denying gross negligence manslaughter. Prosecutor Karen Robinson told the court that a two-day sentencing hearing would be scheduled for early June, and that the prosecution would not pursue a trial. Outstanding charges against both defendants will be resolved at sentencing. Davies was granted continued bail on the condition that he cooperate with the Probation Service for a pre-sentence report.\n\nThe case has drawn renewed attention to safety standards at major international athletics events. Hayayei's death cast a shadow over the 2017 World Para-athletics Championships, where a moment of silence was held in his honor during the opening ceremony at London Stadium. The lengthy legal proceedings — spanning nearly eight years from the incident to a guilty plea — underscore the complexity of corporate manslaughter prosecutions in the United Kingdom, which require proof that senior management failures caused a death.\n\nUK Athletics now faces what could be a substantial financial penalty at sentencing. Under English law, corporate manslaughter convictions carry unlimited fines, with courts directed to consider the severity of the management failure and the organization's financial resources. The sentencing hearing in June will determine the consequences for both the governing body and Davies personally.",
      "category": "breaking",
      "importance": 7,
      "tags": [
        "UK Athletics",
        "corporate manslaughter",
        "Abdullah Hayayei",
        "Paralympics",
        "athlete safety"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a742/live/9c6dfac0-0e4d-11f1-9189-e7ebb4fb5ccd.jpg",
      "sourceUrl": "https://www.bbc.com/sport/articles/c0ljn0z94n5o?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T16:02:41.793Z"
    },
    {
      "id": "ps-1771602464205-hxpm",
      "slug": "eric-dane-grey-s-anatomy-and-euphoria-star-dies-at-53",
      "headline": "Eric Dane, Grey's Anatomy and Euphoria Star, Dies at 53",
      "subheadline": "The actor spent his final months as a tireless advocate for ALS research after revealing his diagnosis in April 2025",
      "body": "Eric Dane, the actor beloved for his roles as \"Dr. McSteamy\" on Grey's Anatomy and the troubled patriarch Cal Jacobs on HBO's Euphoria, died Thursday afternoon following a battle with amyotrophic lateral sclerosis. He was 53 years old, and had lived less than a year since publicly disclosing his diagnosis.\n\nDane's family confirmed his death in a statement, saying he spent his final days surrounded by his wife, actress and model Rebecca Gayheart, and their two daughters, Billie and Georgia, who were \"the center of his world.\" Born in San Francisco in 1972, Dane built a career spanning more than three decades, beginning with a television debut on The Wonder Years in 1993. He went on to appear in Charmed, The Last Ship, and films including Marley & Me and Burlesque, but it was his 2006 arrival on Grey's Anatomy as the charismatic plastic surgeon Dr. Mark Sloan that made him a household name.\n\nIn the ten months between his April 2025 diagnosis and his death, Dane channeled his public profile into an urgent campaign for ALS awareness and research funding. He joined the board of directors of Target ALS in December and helped one of its fundraising campaigns surpass $500,000. Earlier this month, Time magazine named him among its 100 most influential people in health. \"I'm trying to save my life,\" he told the publication, \"and if my actions can move the needle forward for myself and countless others, I'm satisfied.\" In November, he took on a role in NBC's Brilliant Minds portraying a firefighter grappling with an ALS diagnosis — art mirroring his own reality.\n\nTributes poured in from across Hollywood. Patrick Dempsey, his longtime Grey's Anatomy co-star, called him \"the funniest man\" and \"wickedly intelligent,\" praising both his on-set humor and his advocacy work. Euphoria creator Sam Levinson described working with Dane as \"an honor\" and his friendship as \"a gift.\" Ashton Kutcher urged fans to \"keep fighting the fight to solve ALS,\" while actress Nina Dobrev said Dane \"led with kindness and made everyone on our set feel seen.\"\n\nDane had spoken candidly about the emotional weight of his illness, telling Good Morning America in June that the diagnosis made him \"angry\" — particularly because he had lost his own father to suicide as a child and feared his daughters would lose him while they were still young. ALS, also known as Lou Gehrig's disease, is a progressive neurodegenerative condition with no cure. According to the Muscular Dystrophy Association, most patients survive three to five years after diagnosis, though Dane's decline was notably swift. His family asked that his memory continue to fuel the research and awareness he championed until the end.",
      "category": "breaking",
      "importance": 7,
      "tags": [
        "Eric Dane",
        "ALS",
        "Grey's Anatomy",
        "Euphoria",
        "celebrity death",
        "motor neurone disease"
      ],
      "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/15be/live/432eaa20-0e45-11f1-8705-e59653a64488.jpg",
      "sourceUrl": "https://www.bbc.com/news/articles/c78j01n775ko?at_medium=RSS&at_campaign=rss",
      "sourceName": "BBC News",
      "publishedAt": "2026-02-20T15:47:44.205Z"
    },
    {
      "id": "ps-1771599751437-wz7m",
      "slug": "israeli-settlers-kill-19-year-old-palestinian-american-in-we",
      "headline": "Israeli Settlers Kill 19-Year-Old Palestinian American in West Bank",
      "subheadline": "Nasrallah Abu Siyam is the second U.S. citizen killed by settlers in under a year as West Bank violence escalates",
      "body": "Israeli settlers shot and killed Nasrallah Abu Siyam, a 19-year-old Palestinian American, during an attack on the West Bank village of Mukhmas on Wednesday, according to the Palestinian Health Ministry and eyewitnesses. The killing marks the first Palestinian death at the hands of settlers in 2026 and the second fatal shooting of a U.S. citizen by settlers in less than a year.\n\nAccording to village resident Raed Abu Ali, a group of settlers descended on Mukhmas — located east of Ramallah — on Wednesday afternoon, assaulting a farmer and triggering clashes when villagers intervened. Israeli military forces subsequently arrived and deployed tear gas, sound grenades, and live ammunition, Abu Ali said. He described armed settlers opening fire after soldiers appeared on the scene, killing Abu Siyam and injuring several others. \"When the settlers saw the army, they were encouraged and started shooting live bullets,\" Abu Ali told the Associated Press, adding that settlers beat wounded Palestinians with sticks as they lay on the ground.\n\nThe Israeli military acknowledged using \"riot dispersal methods\" after receiving reports of rock-throwing but denied its forces fired during the confrontation. It confirmed that unnamed suspects had shot at Palestinians, who were evacuated for medical treatment. The military did not indicate whether any arrests were made. A U.S. Embassy spokesperson said they \"condemn this violence,\" though offered no further detail.\n\nThe incident comes amid a sustained escalation in the occupied West Bank. Israeli forces and settlers killed 240 Palestinians in 2025, according to the United Nations Office for the Coordination of Humanitarian Affairs, while Palestinians killed 17 Israelis — six of them soldiers — over the same period. The Palestinian Authority's Wall and Settlement Resistance Commission identified Abu Siyam as the first settler-related fatality of the new year. Mukhmas and its surrounding area, most of which falls under Israeli civil and military administration, have become a focal point for settler violence, including arson, physical assaults, and the construction of outposts deemed illegal even under Israeli law.\n\nThe killing coincided with a sweeping report from the U.N. High Commissioner for Human Rights accusing Israel of war crimes in the West Bank and warning that the forced displacement of Palestinians and demographic alterations to the territory \"raise concerns over ethnic cleansing.\" The office cited a \"concerted and accelerating effort to consolidate annexation\" based on findings from November 2024 through October 2025. Palestinian rights advocates and human rights organizations have long charged that Israeli authorities routinely fail to prosecute settlers or hold them accountable, a pattern they say emboldens further violence. Israel has repeatedly rejected allegations of bias from U.N. bodies.",
      "category": "breaking",
      "importance": 8,
      "tags": [
        "West Bank",
        "Israeli settlers",
        "Palestinian American",
        "U.S. citizen",
        "settler violence",
        "United Nations",
        "human rights"
      ],
      "imageUrl": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8563x4817+0+446/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4f%2F53%2Fc86adc87442b828e675c1713f10a%2Fap26050415877532.jpg",
      "sourceUrl": "https://www.npr.org/2026/02/20/nx-s1-5720677/israeli-settlers-kill-19-year-old-palestinian-american-officials-and-witnesses-say",
      "sourceName": "NPR News",
      "publishedAt": "2026-02-20T15:02:31.437Z"
    }
  ]
}