{
  "lastUpdated": "2026-02-20T07:04:52.184Z",
  "count": 10,
  "articles": [
    {
      "id": "ps-1771571003378-7zprzr",
      "headline": "Bitcoin Mining Difficulty Surges 15%, Biggest Jump in Four Years",
      "subheadline": "Network difficulty hits 144.4T as global hashrate recovers to 1 ZH/s, even as miners face historically low revenues per unit of computing power.",
      "body": "Bitcoin's mining difficulty has spiked 15% in a single adjustment — the largest increase since 2021 — rising to 144.4 trillion as the network's total hashrate recovered to approximately 1 zettahash per second. The jump signals a rapid return of computing power to the network despite a prolonged slump in bitcoin's price.\n\nThe surge is particularly notable given that hashprice, the revenue miners earn per unit of computational output, has fallen to multi-year lows. That metric reflects the squeeze miners face as operational costs remain elevated while bitcoin trades well below previous highs. Yet the difficulty increase suggests miners are either deploying more efficient hardware, securing cheaper energy, or betting on a future price recovery that justifies current losses.\n\nDifficulty adjustments are an automatic feature of the Bitcoin protocol, recalibrating roughly every two weeks to maintain a consistent ten-minute block interval. A 15% single-period increase is rare and indicates that substantial hashrate came online rapidly between adjustments. The last comparable jump occurred during the recovery from China's 2021 mining ban, when displaced operators relocated and reconnected en masse. The current rebound raises questions about whether a similar wave of new or returning mining capacity is underway, and whether the economics of mining at depressed prices can sustain it.",
      "category": "markets",
      "breaking": false,
      "importance": 5,
      "imageUrl": "https://source.unsplash.com/1200x630/?markets",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/bitcoin-difficulty-jumps-15-largest-increase-since-2021-despite-price-slump",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T07:03:23.378Z"
    },
    {
      "id": "ps-1771571013489-ruyppb",
      "headline": "General Catalyst Pledges $5B to India, Quintupling Previous Commitment",
      "subheadline": "The venture firm dramatically escalates its India bet, up from an earlier $500M–$1B earmark over five years.",
      "body": "General Catalyst has committed $5 billion to investments in India over the next five years, marking a dramatic escalation of the venture capital firm's ambitions in one of the world's fastest-growing startup ecosystems. The pledge represents at least a fivefold increase from the firm's previous India earmark of $500 million to $1 billion.\n\nThe move signals deepening confidence among top-tier Silicon Valley firms in India's technology sector, which has benefited from a maturing founder ecosystem, rising domestic consumption, and government-led digitization efforts. India has steadily climbed the ranks as a global venture destination, attracting increasing attention as investors look beyond China for high-growth emerging market opportunities.\n\nGeneral Catalyst's outsized commitment positions it as one of the largest single-firm allocators to the Indian market and is likely to intensify competition among global venture firms jockeying for access to the country's most promising startups. The five-year timeline suggests the firm expects a sustained pipeline of dealflow across sectors including fintech, enterprise software, consumer internet, and artificial intelligence — areas where Indian companies have increasingly demonstrated the ability to build at global scale.",
      "category": "business",
      "breaking": false,
      "importance": 6,
      "imageUrl": "https://source.unsplash.com/1200x630/?business",
      "sourceUrl": "https://techcrunch.com/2026/02/19/general-catalyst-commits-5b-to-india-over-five-years/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-20T07:03:33.489Z"
    },
    {
      "id": "ps-1771571022036-w1ztne",
      "headline": "Fostrom Launches IoT Cloud Platform Born from Vertical Farming Frustrations",
      "subheadline": "Two founders who spent more time on IoT plumbing than farm automation built the platform they wished existed",
      "body": "Fostrom, a new IoT cloud platform aimed at developers, has launched in technical preview after its founders spent years wrestling with the infrastructure challenges of connected devices at their previous vertical farming startup.\n\nBuilt by Arjun and Sid, Fostrom offers device SDKs in Python, JavaScript, and Elixir, along with typed schemas, per-device mailboxes, programmable actions, and deployment across four global regions. The technical architecture reflects hard-won lessons: a Go-to-Elixir bridge executes JavaScript code in WebAssembly for serverless actions, while a Rust-based device agent runs locally alongside SDK code. The open-source device agent is available on GitHub.\n\nPerhaps the most consequential design choice was the data layer. After years of experimenting with distributed databases and complex abstraction layers, the team concluded that operational correctness and rich querying for fleet data demanded a SQL-first approach. They built a DuckDB-based replicated multi-tenant data layer — a decision they say dramatically simplified the broader codebase while concentrating operational complexity in a manageable number of components. The platform is currently in technical preview as the data architecture continues to mature, with a CLI tool and automatic device monitoring among the next planned additions.",
      "category": "tech",
      "breaking": false,
      "importance": 4,
      "imageUrl": "https://source.unsplash.com/1200x630/?tech",
      "sourceUrl": "https://fostrom.io/",
      "sourceName": "Hacker News",
      "publishedAt": "2026-02-20T07:03:42.036Z"
    },
    {
      "id": "ps-1771571033150-01hilo",
      "headline": "Neo Launches Residency Program With $750K Investment on Uncapped SAFE",
      "subheadline": "Ali Partovi's accelerator offers founder-friendly terms and $40K grants for college students, challenging traditional models",
      "body": "Neo, the startup community and accelerator founded by tech investor Ali Partovi, is rolling out a new Residency program that aims to reshape how early-stage funding works. The program offers participating startups $750,000 invested through an uncapped SAFE — a structure that avoids setting a valuation cap, potentially resulting in significantly less dilution for founders compared to traditional accelerator deals.\n\nThe move represents a direct challenge to established accelerators like Y Combinator and Techstars, which typically take fixed equity stakes of 5-7% in exchange for smaller investment amounts. By using an uncapped SAFE, Neo is betting that founder-friendly terms will attract top-tier talent, with the fund's returns depending on the valuation set by the startup's next priced round.\n\nNeo is also extending its reach to earlier-stage talent with a $40,000 no-strings-attached grant for college students — requiring no equity in return. Partovi, who previously co-founded Code.org and has made early investments in companies like Dropbox and Facebook, has positioned Neo as a curated network that blends community building with capital deployment. The new Residency program signals an escalation of that strategy, offering significantly more capital than most accelerators while asking for less in return.",
      "category": "business",
      "breaking": false,
      "importance": 5,
      "imageUrl": "https://source.unsplash.com/1200x630/?business",
      "sourceUrl": "https://techcrunch.com/2026/02/19/ali-partovis-neo-looks-to-upend-the-accelerator-model-with-low-dilution-terms/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-20T07:03:53.150Z"
    },
    {
      "id": "ps-1771571042365-mg282a",
      "headline": "Bitcoin Retreats Near $68,000, Gold Surges as U.S.-Iran Tensions Escalate",
      "subheadline": "Geopolitical uncertainty dampens risk appetite across equities and crypto while safe-haven assets rally",
      "body": "Bitcoin hovered near $68,000 as renewed tensions between the United States and Iran sent investors toward traditional safe-haven assets, with gold prices jumping sharply. The move reflects a broader pullback in risk appetite that has also weighed on U.S. equities.\n\nThe cryptocurrency's retreat comes amid growing caution across global markets, as geopolitical uncertainty overshadows what had been a relatively constructive outlook for digital assets earlier in 2026. Some strategists are now warning that Bitcoin could retest its 2024 lows before establishing a more durable recovery, suggesting the current sell-off may have further to run.\n\nGold's rally underscores the divergence between risk assets and traditional stores of value in periods of geopolitical stress. With U.S. stocks also trading on a cautious footing, market participants appear to be broadly de-risking portfolios rather than rotating within asset classes. The situation bears watching for signs of further escalation, which could deepen the flight to safety and put additional pressure on speculative assets including cryptocurrencies.",
      "category": "markets",
      "breaking": false,
      "importance": 6,
      "imageUrl": "https://source.unsplash.com/1200x630/?markets",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/bitcoin-nears-usd68-000-gold-jumps-as-us-iran-tensions-return",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T07:04:02.365Z"
    },
    {
      "id": "ps-1771571050819-uossz0",
      "headline": "Bitcoin Posts Worst 50-Day Start to a Year on Record",
      "subheadline": "The cryptocurrency is tracking toward its first-ever consecutive monthly declines in January and February.",
      "body": "Bitcoin has recorded its weakest opening stretch to any calendar year, with the first 50 days of 2026 marking an unprecedented slump for the world's largest cryptocurrency.\n\nThe downturn puts Bitcoin on pace for back-to-back monthly declines in January and February — a pattern never before seen in the asset's history during those months. The sustained selling pressure contrasts sharply with the bullish momentum that typically characterizes the early weeks of a new year, when institutional portfolio rebalancing and renewed retail interest have historically provided tailwinds.\n\nThe record-setting poor start raises questions about whether the post-halving cycle dynamics that have long governed Bitcoin's price trajectory are weakening, or whether broader macroeconomic headwinds — including persistent interest rate uncertainty and tightening liquidity conditions — are simply overpowering crypto-specific catalysts. Analysts will be watching closely to see whether March brings a reversal or whether 2026 is shaping up to fundamentally challenge long-held assumptions about Bitcoin's cyclical behavior.",
      "category": "markets",
      "breaking": false,
      "importance": 6,
      "imageUrl": "https://source.unsplash.com/1200x630/?markets",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/bitcoin-logs-worst-ever-start-to-a-year-through-first-50-days",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T07:04:10.819Z"
    },
    {
      "id": "ps-1771571060959-d96mqh",
      "headline": "Metaplanet CEO Defends Firm's Bitcoin Strategy Amid Growing Scrutiny",
      "subheadline": "Simon Gerovich pushes back on critics questioning the Japanese firm's disclosure standards, options model, and core hotel business.",
      "body": "Metaplanet CEO Simon Gerovich has publicly addressed mounting criticism of the company's bitcoin-centric corporate strategy, defending its transparency practices, options trading model, and the viability of its legacy hotel operations.\n\nThe Tokyo-listed firm, which has drawn comparisons to MicroStrategy for its aggressive bitcoin accumulation approach, has faced questions from skeptics who argue its disclosure standards fall short and that its pivot away from traditional hospitality raises governance concerns. Gerovich countered that Metaplanet meets or exceeds Japanese regulatory requirements for corporate disclosure and that its bitcoin options trading strategy — used to generate yield on its holdings — is both sound and well-documented.\n\nOn the hotel business, Gerovich maintained that operations remain intact and continue to generate revenue, rejecting characterizations of Metaplanet as a bitcoin holding company masquerading as a hospitality firm. The defense comes as a growing cohort of publicly traded companies adopt bitcoin treasury strategies, inviting heightened scrutiny from regulators and market analysts over whether such approaches serve shareholder interests or introduce undue volatility risk. Metaplanet's stock has experienced significant swings tied to bitcoin price movements, underscoring the tension between its dual identity as both an operating business and a de facto cryptocurrency vehicle.",
      "category": "markets",
      "breaking": false,
      "importance": 4,
      "imageUrl": "https://source.unsplash.com/1200x630/?markets",
      "sourceUrl": "https://www.coindesk.com/markets/2026/02/20/metaplanet-ceo-rebuts-critics-over-bitcoin-strategy-and-transparency",
      "sourceName": "CoinDesk",
      "publishedAt": "2026-02-20T07:04:20.959Z"
    },
    {
      "id": "ps-1771571071561-s2gvvu",
      "headline": "Developer Unlocks Hidden MEMS Accelerometer on Apple Silicon MacBooks",
      "subheadline": "Undocumented sensor accessed through reverse-engineering Apple's IOKit framework, revealing motion data Apple never exposed publicly",
      "body": "A developer has successfully accessed the undocumented MEMS accelerometer embedded in Apple Silicon MacBooks by reverse-engineering Apple's IOKit framework, publishing the findings and working code as an open-source project on GitHub.\n\nThe project, created by developer Olvvier, demonstrates how to read real-time accelerometer data from the motion sensor that Apple includes in its M-series MacBooks but has never officially documented or exposed through public APIs. The accelerometer, a micro-electromechanical system (MEMS) chip, detects physical orientation and movement of the laptop — the same class of sensor that older Intel-based MacBooks once made accessible through the Sudden Motion Sensor API, which Apple used primarily for hard drive protection during freefall events.\n\nThe discovery opens the door to a range of potential applications, from motion-based input and orientation-aware interfaces to scientific data collection and accessibility tools. While Apple likely includes the sensor for internal diagnostics or possible future features, the lack of public documentation meant most developers had no idea it existed on Apple Silicon hardware. The IOKit-based approach bypasses the need for any official API, communicating directly with the hardware driver layer. The project underscores the broader reality that modern consumer hardware often contains capabilities that manufacturers choose not to surface — and that determined reverse engineers will inevitably find them.",
      "category": "tech",
      "breaking": false,
      "importance": 4,
      "imageUrl": "https://source.unsplash.com/1200x630/?tech",
      "sourceUrl": "https://github.com/olvvier/apple-silicon-accelerometer",
      "sourceName": "Hacker News",
      "publishedAt": "2026-02-20T07:04:31.561Z"
    },
    {
      "id": "ps-1771571080896-oypcoy",
      "headline": "New Models Map Antarctica's Climate Future From Manageable to Catastrophic",
      "subheadline": "Scientists outline best- and worst-case warming scenarios, showing significant harm can still be averted with action",
      "body": "Scientists have produced comprehensive models of Antarctica's climate future, charting a wide range of outcomes from best- to worst-case scenarios as the continent warms at an accelerating pace. The research underscores both the severity of the threat and the meaningful difference that emissions reductions could still make.\n\nUnder the worst-case projections, unchecked warming drives substantial ice sheet loss, contributing to significant global sea level rise and disrupting ocean circulation patterns that regulate climate systems worldwide. The cascading effects would reach far beyond the Southern Ocean, threatening coastal populations and ecosystems across the planet.\n\nCritically, however, the modeling also demonstrates that the gap between the best and worst outcomes remains wide—meaning policy decisions made in the near term still have enormous leverage over Antarctica's trajectory. The findings offer a counterpoint to fatalism about polar ice loss, suggesting that while some degree of Antarctic warming is now locked in, the most catastrophic scenarios are not inevitable. The research adds urgency to international climate negotiations by quantifying precisely what is at stake in one of Earth's most consequential and rapidly changing environments.",
      "category": "science",
      "breaking": false,
      "importance": 7,
      "imageUrl": "https://source.unsplash.com/1200x630/?science",
      "sourceUrl": "https://phys.org/news/2026-02-scientists-reveal-worst-case-scenarios.html",
      "sourceName": "Phys.org",
      "publishedAt": "2026-02-20T07:04:40.896Z"
    },
    {
      "id": "ps-1771571092184-bk02pk",
      "headline": "New Math Model Captures How Angled EM Beams Heat Human Skin",
      "subheadline": "Closed-form solutions account for both beam angle and lateral heat conduction, improving accuracy at practical scales",
      "body": "Researchers have derived new analytical expressions that significantly improve predictions of how electromagnetic beams heat skin tissue at various angles of incidence — a problem with direct implications for medical treatments, safety standards, and directed-energy applications.\n\nThe work builds on a previous asymptotic approach that exploited a key physical fact: EM beams penetrate skin to a depth far smaller than the beam's lateral width. By expanding the temperature distribution in powers of this small depth-to-width ratio, the team had previously captured only the leading-order effect of incident angle. The new study extends the solution to first- and second-order terms, crucially incorporating lateral heat conduction — the sideways spread of thermal energy within tissue. While mathematically negligible in the theoretical limit of an infinitely wide beam, lateral conduction proves surprisingly important at realistic beam geometries where the depth-to-width ratio is around 0.1.\n\nThe closed-form expressions derived in the paper allow researchers and engineers to compute accurate temperature profiles without resorting to expensive numerical simulations. The solution handles arbitrary incident angles and captures the interplay between beam penetration and lateral thermal diffusion, providing a practical analytical tool where simpler models fall short. The authors demonstrate that omitting the second-order lateral conduction term introduces significant errors at moderate scale ratios commonly encountered in real-world scenarios, making the extended solution essential for meaningful thermal predictions in skin-heating applications.",
      "category": "physics",
      "breaking": false,
      "importance": 4,
      "imageUrl": "https://source.unsplash.com/1200x630/?physics",
      "sourceUrl": "https://arxiv.org/abs/2602.16751",
      "sourceName": "arXiv Physics",
      "publishedAt": "2026-02-20T07:04:52.184Z"
    }
  ]
}