{
  "lastUpdated": "2026-02-20T06:45:12.769Z",
  "count": 2,
  "articles": [
    {
      "id": "ps-1771569902862-z43e07",
      "headline": "General Catalyst Pledges $5B to India, Quintupling Previous Commitment",
      "subheadline": "The venture capital giant dramatically escalates its India bet, up from an earlier $500M–$1B earmark over five years.",
      "body": "General Catalyst has committed $5 billion to investments in India over the next five years, a dramatic escalation that signals deepening confidence in the country's technology ecosystem. The pledge represents as much as a tenfold increase from the firm's previous India earmark of $500 million to $1 billion.\n\nThe move positions General Catalyst among the most aggressive international investors in India's startup landscape, which has matured rapidly amid a growing consumer internet market, expanding digital infrastructure, and a deep pool of engineering talent. India has become an increasingly important destination for global venture capital as firms seek growth opportunities outside the United States and China.\n\nThe commitment comes as competition among top-tier venture firms for access to India's most promising startups intensifies. General Catalyst's outsized bet suggests the firm sees a generational opportunity in the country's technology sector, where rising AI adoption, fintech expansion, and enterprise software development continue to attract significant capital. The five-year timeline indicates a long-term strategic play rather than a short-term allocation shift.",
      "category": "business",
      "breaking": false,
      "importance": 6,
      "sourceUrl": "https://techcrunch.com/2026/02/19/general-catalyst-commits-5b-to-india-over-five-years/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-20T06:45:02.862Z"
    },
    {
      "id": "ps-1771569912769-fu7uqb",
      "headline": "Neo Launches Residency Program With $750K Investment on Uncapped SAFE",
      "subheadline": "Ali Partovi's accelerator offers founder-friendly terms alongside $40K no-strings grants for college students",
      "body": "Neo, the accelerator founded by tech investor Ali Partovi, is challenging the conventional startup accelerator model with a new Residency program that offers significantly more founder-friendly terms than its competitors.\n\nThe program invests $750,000 in each participating startup through an uncapped SAFE — a financing structure that avoids setting a valuation cap, potentially meaning far less dilution for founders than the terms offered by established players like Y Combinator or Techstars. In a separate track aimed at nurturing the next generation of founders, Neo is also providing $40,000 grants to college students with no equity or strings attached.\n\nThe move signals a broader shift in the accelerator landscape, where founders increasingly have leverage to demand better terms. As competition among accelerators intensifies for access to the most promising early-stage companies, programs are being forced to differentiate on deal structure rather than brand alone. Partovi, who previously co-founded Code.org and LinkExchange, has positioned Neo as a community-driven network connecting young technical talent with seasoned founders and investors. The new Residency program represents Neo's most aggressive bid yet to attract top-tier startups by minimizing the equity cost of participation.",
      "category": "business",
      "breaking": false,
      "importance": 5,
      "sourceUrl": "https://techcrunch.com/2026/02/19/ali-partovis-neo-looks-to-upend-the-accelerator-model-with-low-dilution-terms/",
      "sourceName": "TechCrunch",
      "publishedAt": "2026-02-20T06:45:12.769Z"
    }
  ]
}